#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EletrocutedArrow

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EletrocutedArrow.BP_EletrocutedArrow_C
// 0x0028 (0x0248 - 0x0220)
class ABP_EletrocutedArrow_C final : public AActor
{
public:
	class UNiagaraComponent*                      Niagara;                                           // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStatusEffectTriggerComponent*          StatusEffectTrigger;                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EletrocutedArrow_C">();
	}
	static class ABP_EletrocutedArrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EletrocutedArrow_C>();
	}
};
static_assert(alignof(ABP_EletrocutedArrow_C) == 0x000008, "Wrong alignment on ABP_EletrocutedArrow_C");
static_assert(sizeof(ABP_EletrocutedArrow_C) == 0x000248, "Wrong size on ABP_EletrocutedArrow_C");
static_assert(offsetof(ABP_EletrocutedArrow_C, Niagara) == 0x000220, "Member 'ABP_EletrocutedArrow_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_EletrocutedArrow_C, Sphere) == 0x000228, "Member 'ABP_EletrocutedArrow_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_EletrocutedArrow_C, StatusEffectTrigger) == 0x000230, "Member 'ABP_EletrocutedArrow_C::StatusEffectTrigger' has a wrong offset!");
static_assert(offsetof(ABP_EletrocutedArrow_C, Audio) == 0x000238, "Member 'ABP_EletrocutedArrow_C::Audio' has a wrong offset!");
static_assert(offsetof(ABP_EletrocutedArrow_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_EletrocutedArrow_C::DefaultSceneRoot' has a wrong offset!");

}

