#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HDPlayerCharacter_SharedIK

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_HDPlayerCharacter_SharedIK.ABP_HDPlayerCharacter_SharedIK_C.ExecuteUbergraph_ABP_HDPlayerCharacter_SharedIK
// 0x0004 (0x0004 - 0x0000)
struct ABP_HDPlayerCharacter_SharedIK_C_ExecuteUbergraph_ABP_HDPlayerCharacter_SharedIK final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_HDPlayerCharacter_SharedIK_C_ExecuteUbergraph_ABP_HDPlayerCharacter_SharedIK) == 0x000004, "Wrong alignment on ABP_HDPlayerCharacter_SharedIK_C_ExecuteUbergraph_ABP_HDPlayerCharacter_SharedIK");
static_assert(sizeof(ABP_HDPlayerCharacter_SharedIK_C_ExecuteUbergraph_ABP_HDPlayerCharacter_SharedIK) == 0x000004, "Wrong size on ABP_HDPlayerCharacter_SharedIK_C_ExecuteUbergraph_ABP_HDPlayerCharacter_SharedIK");
static_assert(offsetof(ABP_HDPlayerCharacter_SharedIK_C_ExecuteUbergraph_ABP_HDPlayerCharacter_SharedIK, EntryPoint) == 0x000000, "Member 'ABP_HDPlayerCharacter_SharedIK_C_ExecuteUbergraph_ABP_HDPlayerCharacter_SharedIK::EntryPoint' has a wrong offset!");

// Function ABP_HDPlayerCharacter_SharedIK.ABP_HDPlayerCharacter_SharedIK_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_HDPlayerCharacter_SharedIK_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_HDPlayerCharacter_SharedIK_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_HDPlayerCharacter_SharedIK_C_AnimGraph");
static_assert(sizeof(ABP_HDPlayerCharacter_SharedIK_C_AnimGraph) == 0x000020, "Wrong size on ABP_HDPlayerCharacter_SharedIK_C_AnimGraph");
static_assert(offsetof(ABP_HDPlayerCharacter_SharedIK_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_HDPlayerCharacter_SharedIK_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_HDPlayerCharacter_SharedIK_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_HDPlayerCharacter_SharedIK_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_HDPlayerCharacter_SharedIK.ABP_HDPlayerCharacter_SharedIK_C.HandIK
// 0x0020 (0x0020 - 0x0000)
struct ABP_HDPlayerCharacter_SharedIK_C_HandIK final
{
public:
	struct FPoseLink                              InLocoPose;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HandIK_0;                                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_HDPlayerCharacter_SharedIK_C_HandIK) == 0x000008, "Wrong alignment on ABP_HDPlayerCharacter_SharedIK_C_HandIK");
static_assert(sizeof(ABP_HDPlayerCharacter_SharedIK_C_HandIK) == 0x000020, "Wrong size on ABP_HDPlayerCharacter_SharedIK_C_HandIK");
static_assert(offsetof(ABP_HDPlayerCharacter_SharedIK_C_HandIK, InLocoPose) == 0x000000, "Member 'ABP_HDPlayerCharacter_SharedIK_C_HandIK::InLocoPose' has a wrong offset!");
static_assert(offsetof(ABP_HDPlayerCharacter_SharedIK_C_HandIK, HandIK_0) == 0x000010, "Member 'ABP_HDPlayerCharacter_SharedIK_C_HandIK::HandIK_0' has a wrong offset!");

// Function ABP_HDPlayerCharacter_SharedIK.ABP_HDPlayerCharacter_SharedIK_C.FootIK
// 0x0020 (0x0020 - 0x0000)
struct ABP_HDPlayerCharacter_SharedIK_C_FootIK final
{
public:
	struct FPoseLink                              InLocoPose;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FootIK_0;                                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_HDPlayerCharacter_SharedIK_C_FootIK) == 0x000008, "Wrong alignment on ABP_HDPlayerCharacter_SharedIK_C_FootIK");
static_assert(sizeof(ABP_HDPlayerCharacter_SharedIK_C_FootIK) == 0x000020, "Wrong size on ABP_HDPlayerCharacter_SharedIK_C_FootIK");
static_assert(offsetof(ABP_HDPlayerCharacter_SharedIK_C_FootIK, InLocoPose) == 0x000000, "Member 'ABP_HDPlayerCharacter_SharedIK_C_FootIK::InLocoPose' has a wrong offset!");
static_assert(offsetof(ABP_HDPlayerCharacter_SharedIK_C_FootIK, FootIK_0) == 0x000010, "Member 'ABP_HDPlayerCharacter_SharedIK_C_FootIK::FootIK_0' has a wrong offset!");

}

