#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_PlayCameraAnimation

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimNotify_PlayCameraAnimation.AnimNotify_PlayCameraAnimation_C.Received_Notify
// 0x0030 (0x0030 - 0x0000)
struct AnimNotify_PlayCameraAnimation_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HDPlayerCharacterBase_C*            K2Node_DynamicCast_AsBP_HDPlayer_Character_Base;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotify_PlayCameraAnimation_C_Received_Notify) == 0x000008, "Wrong alignment on AnimNotify_PlayCameraAnimation_C_Received_Notify");
static_assert(sizeof(AnimNotify_PlayCameraAnimation_C_Received_Notify) == 0x000030, "Wrong size on AnimNotify_PlayCameraAnimation_C_Received_Notify");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_PlayCameraAnimation_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_PlayCameraAnimation_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AnimNotify_PlayCameraAnimation_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AnimNotify_PlayCameraAnimation_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_Received_Notify, K2Node_DynamicCast_AsBP_HDPlayer_Character_Base) == 0x000020, "Member 'AnimNotify_PlayCameraAnimation_C_Received_Notify::K2Node_DynamicCast_AsBP_HDPlayer_Character_Base' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AnimNotify_PlayCameraAnimation_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_Received_Notify, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000029, "Member 'AnimNotify_PlayCameraAnimation_C_Received_Notify::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_Received_Notify, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00002A, "Member 'AnimNotify_PlayCameraAnimation_C_Received_Notify::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_Received_Notify, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00002B, "Member 'AnimNotify_PlayCameraAnimation_C_Received_Notify::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");

// Function AnimNotify_PlayCameraAnimation.AnimNotify_PlayCameraAnimation_C.GetNotifyName
// 0x0078 (0x0078 - 0x0000)
struct AnimNotify_PlayCameraAnimation_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_PlayCameraAnimation_C_GetNotifyName) == 0x000008, "Wrong alignment on AnimNotify_PlayCameraAnimation_C_GetNotifyName");
static_assert(sizeof(AnimNotify_PlayCameraAnimation_C_GetNotifyName) == 0x000078, "Wrong size on AnimNotify_PlayCameraAnimation_C_GetNotifyName");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'AnimNotify_PlayCameraAnimation_C_GetNotifyName::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_GetNotifyName, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'AnimNotify_PlayCameraAnimation_C_GetNotifyName::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_GetNotifyName, CallFunc_Replace_ReturnValue) == 0x000020, "Member 'AnimNotify_PlayCameraAnimation_C_GetNotifyName::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_GetNotifyName, CallFunc_Split_LeftS) == 0x000030, "Member 'AnimNotify_PlayCameraAnimation_C_GetNotifyName::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_GetNotifyName, CallFunc_Split_RightS) == 0x000040, "Member 'AnimNotify_PlayCameraAnimation_C_GetNotifyName::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_GetNotifyName, CallFunc_Split_ReturnValue) == 0x000050, "Member 'AnimNotify_PlayCameraAnimation_C_GetNotifyName::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_GetNotifyName, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'AnimNotify_PlayCameraAnimation_C_GetNotifyName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayCameraAnimation_C_GetNotifyName, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'AnimNotify_PlayCameraAnimation_C_GetNotifyName::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

}

