#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArcVehiclesExtra

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class ArcVehiclesExtra.ArcVehicleSampleCharacter
// 0x0000 (0x04C0 - 0x04C0)
class AArcVehicleSampleCharacter final : public ACharacter
{
public:
	bool                                          bUseAttachedVehicleRelevancy;                      // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArcVehicleSampleCharacter">();
	}
	static class AArcVehicleSampleCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArcVehicleSampleCharacter>();
	}
};
static_assert(alignof(AArcVehicleSampleCharacter) == 0x000010, "Wrong alignment on AArcVehicleSampleCharacter");
static_assert(sizeof(AArcVehicleSampleCharacter) == 0x0004C0, "Wrong size on AArcVehicleSampleCharacter");
static_assert(offsetof(AArcVehicleSampleCharacter, bUseAttachedVehicleRelevancy) == 0x0004B8, "Member 'AArcVehicleSampleCharacter::bUseAttachedVehicleRelevancy' has a wrong offset!");

// Class ArcVehiclesExtra.ArcVehicleSpawner
// 0x0038 (0x0258 - 0x0220)
class AArcVehicleSpawner final : public AActor
{
public:
	class UChildActorComponent*                   EditorVehicleMesh;                                 // 0x0220(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class AArcBaseVehicle>            VehicleClass;                                      // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpawnImmediately;                                 // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RespawnDelay;                                      // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxVehiclesAlive;                                  // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23C[0x1C];                                     // 0x023C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnVehicleDestroyed(class AActor* DestroyedActor);
	void SpawnVehicleTimerEnd();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArcVehicleSpawner">();
	}
	static class AArcVehicleSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArcVehicleSpawner>();
	}
};
static_assert(alignof(AArcVehicleSpawner) == 0x000008, "Wrong alignment on AArcVehicleSpawner");
static_assert(sizeof(AArcVehicleSpawner) == 0x000258, "Wrong size on AArcVehicleSpawner");
static_assert(offsetof(AArcVehicleSpawner, EditorVehicleMesh) == 0x000220, "Member 'AArcVehicleSpawner::EditorVehicleMesh' has a wrong offset!");
static_assert(offsetof(AArcVehicleSpawner, VehicleClass) == 0x000228, "Member 'AArcVehicleSpawner::VehicleClass' has a wrong offset!");
static_assert(offsetof(AArcVehicleSpawner, bSpawnImmediately) == 0x000230, "Member 'AArcVehicleSpawner::bSpawnImmediately' has a wrong offset!");
static_assert(offsetof(AArcVehicleSpawner, RespawnDelay) == 0x000234, "Member 'AArcVehicleSpawner::RespawnDelay' has a wrong offset!");
static_assert(offsetof(AArcVehicleSpawner, MaxVehiclesAlive) == 0x000238, "Member 'AArcVehicleSpawner::MaxVehiclesAlive' has a wrong offset!");

}

