#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HDCharacterLeanHandler

#include "Basic.hpp"

#include "DonkehFramework_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HDCharacterLeanHandler.BP_HDCharacterLeanHandler_C
// 0x0030 (0x02B0 - 0x0280)
class UBP_HDCharacterLeanHandler_C final : public UDFCharacterLeanHandler
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       CachedFPPCamera;                                   // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CachedFPPMesh;                                     // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastLeanRollAmt;                                   // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastXOffset;                                       // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastYOffset;                                       // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USpringArmComponent*                    CachedFPPSpringArm;                                // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HDCharacterLeanHandler(int32 EntryPoint);
	void ReceiveTick(float DeltaTime);
	void GetFPPMeshComp(class USkeletalMeshComponent** FPPMesh);
	void GetFPPCameraComp(class UCameraComponent** FPPCamera);
	void GetFPPSpringArmComp(class USpringArmComponent** FPPSpringArm);
	void TickXOffset(float DeltaTime);
	void TickYOffset(float DeltaTime);
	void TickRot(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HDCharacterLeanHandler_C">();
	}
	static class UBP_HDCharacterLeanHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HDCharacterLeanHandler_C>();
	}
};
static_assert(alignof(UBP_HDCharacterLeanHandler_C) == 0x000008, "Wrong alignment on UBP_HDCharacterLeanHandler_C");
static_assert(sizeof(UBP_HDCharacterLeanHandler_C) == 0x0002B0, "Wrong size on UBP_HDCharacterLeanHandler_C");
static_assert(offsetof(UBP_HDCharacterLeanHandler_C, UberGraphFrame) == 0x000280, "Member 'UBP_HDCharacterLeanHandler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HDCharacterLeanHandler_C, CachedFPPCamera) == 0x000288, "Member 'UBP_HDCharacterLeanHandler_C::CachedFPPCamera' has a wrong offset!");
static_assert(offsetof(UBP_HDCharacterLeanHandler_C, CachedFPPMesh) == 0x000290, "Member 'UBP_HDCharacterLeanHandler_C::CachedFPPMesh' has a wrong offset!");
static_assert(offsetof(UBP_HDCharacterLeanHandler_C, LastLeanRollAmt) == 0x000298, "Member 'UBP_HDCharacterLeanHandler_C::LastLeanRollAmt' has a wrong offset!");
static_assert(offsetof(UBP_HDCharacterLeanHandler_C, LastXOffset) == 0x00029C, "Member 'UBP_HDCharacterLeanHandler_C::LastXOffset' has a wrong offset!");
static_assert(offsetof(UBP_HDCharacterLeanHandler_C, LastYOffset) == 0x0002A0, "Member 'UBP_HDCharacterLeanHandler_C::LastYOffset' has a wrong offset!");
static_assert(offsetof(UBP_HDCharacterLeanHandler_C, CachedFPPSpringArm) == 0x0002A8, "Member 'UBP_HDCharacterLeanHandler_C::CachedFPPSpringArm' has a wrong offset!");

}

