#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HDAIControllerBase

#include "Basic.hpp"

#include "HDMain_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HDAIControllerBase.BP_HDAIControllerBase_C
// 0x0030 (0x0390 - 0x0360)
class ABP_HDAIControllerBase_C final : public AHDAIController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAIPerceptionComponent*                 PerceptionComp;                                    // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHDGOAPComponent*                       GOAPComp;                                          // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SavedMaxConeOfFireAngleDegrees;                    // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SavedMinConeOfFireAngleDegrees;                    // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSavedInfiniteAmmo;                                // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSavedInfiniteClipAmmo;                            // 0x0381(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382[0x6];                                      // 0x0382(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             DefaultFactionVocalProfiles;                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HDAIControllerBase(int32 EntryPoint);
	void ReceiveUnPossess(class APawn* UnpossessedPawn);
	void HitDamageEvent(class ADFBaseProjectile* OtherProjectile, class ADFBasePickup* Pickup);
	void SuppressionEvent(class ADFBaseProjectile* OtherProjectile, class ADFBasePickup* Pickup);
	void ReceivePossess(class APawn* PossessedPawn);
	void OnOwnerPawnEquippedItemChange(class ADFBaseCharacter* Character_0, class ADFBaseItem* NewEquippedItem, class ADFBaseItem* PrevEquippedItem);
	void OnOwnerPawnDeath(class APawn* VictimPawn, class AController* VictimController, float KillingDamage, const struct FDamageEvent& DamageEvent, class APawn* InstigatingPawn, class AActor* DamageCauser);
	void WarnOfNoRecoilHandler(class ABP_HDWeaponBase_C* EquippedWeapon);
	void BindEventsToCharacter(class ABP_HDPlayerCharacterBase_C* Character_0);
	void UnbindEventsFromCharacter(class ABP_HDPlayerCharacterBase_C* Character_0);
	void CharacterCleanup(class ABP_HDPlayerCharacterBase_C* Character_0);
	void SetupRecoilHandler(class ABP_HDWeaponBase_C* Weapon);
	void ResetRecoilHandler(class ABP_HDWeaponBase_C* Weapon);
	void SaveAndApplyNewValuesToWeapon(class ABP_HDWeaponBase_C* Weapon);
	void RestorePreviousValuesForWeapon(class ABP_HDWeaponBase_C* Weapon);
	void ClearWeaponSavedValues();
	void SetupWeaponBase(class ABP_HDWeaponBase_C* Weapon);
	void ResetWeaponBase(class ABP_HDWeaponBase_C* Weapon);
	void SetupVocalProfile();

	class UHDKit* GetFactionSpecifiedSquadLeaderKit() const;
	class UHDKit* GetFactionSpecifiedSquadMemberKit() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HDAIControllerBase_C">();
	}
	static class ABP_HDAIControllerBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HDAIControllerBase_C>();
	}
};
static_assert(alignof(ABP_HDAIControllerBase_C) == 0x000008, "Wrong alignment on ABP_HDAIControllerBase_C");
static_assert(sizeof(ABP_HDAIControllerBase_C) == 0x000390, "Wrong size on ABP_HDAIControllerBase_C");
static_assert(offsetof(ABP_HDAIControllerBase_C, UberGraphFrame) == 0x000360, "Member 'ABP_HDAIControllerBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HDAIControllerBase_C, PerceptionComp) == 0x000368, "Member 'ABP_HDAIControllerBase_C::PerceptionComp' has a wrong offset!");
static_assert(offsetof(ABP_HDAIControllerBase_C, GOAPComp) == 0x000370, "Member 'ABP_HDAIControllerBase_C::GOAPComp' has a wrong offset!");
static_assert(offsetof(ABP_HDAIControllerBase_C, SavedMaxConeOfFireAngleDegrees) == 0x000378, "Member 'ABP_HDAIControllerBase_C::SavedMaxConeOfFireAngleDegrees' has a wrong offset!");
static_assert(offsetof(ABP_HDAIControllerBase_C, SavedMinConeOfFireAngleDegrees) == 0x00037C, "Member 'ABP_HDAIControllerBase_C::SavedMinConeOfFireAngleDegrees' has a wrong offset!");
static_assert(offsetof(ABP_HDAIControllerBase_C, bSavedInfiniteAmmo) == 0x000380, "Member 'ABP_HDAIControllerBase_C::bSavedInfiniteAmmo' has a wrong offset!");
static_assert(offsetof(ABP_HDAIControllerBase_C, bSavedInfiniteClipAmmo) == 0x000381, "Member 'ABP_HDAIControllerBase_C::bSavedInfiniteClipAmmo' has a wrong offset!");
static_assert(offsetof(ABP_HDAIControllerBase_C, DefaultFactionVocalProfiles) == 0x000388, "Member 'ABP_HDAIControllerBase_C::DefaultFactionVocalProfiles' has a wrong offset!");

}

