#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HDVOIPTalker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HDVOIPTalker.BP_HDVOIPTalker_C
// 0x0050 (0x0138 - 0x00E8)
class UBP_HDVOIPTalker_C final : public UVOIPTalker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerState*                           OwningPS;                                          // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVoiceSettings                         NonSpatializedSettings;                            // 0x00F8(0x0018)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	struct FVoiceSettings                         SpatializedSettings;                               // 0x0110(0x0018)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	bool                                          bRegistered;                                       // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bTalking;                                          // 0x0129(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CachedAudioComp;                                   // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HDVOIPTalker(int32 EntryPoint);
	void TalkStateChangedOnChannel(class UDFCommChannel* MsgTalkerChannel, class APlayerState* MsgTalkerPS, bool bMsgIsTalking);
	void BPOnTalkingEnd();
	void BPOnTalkingBegin(class UAudioComponent* AudioComponent);
	void RegisterTalker(class APlayerState* InRegisteredPS, struct FVoiceSettings& InSpatializedSettings, struct FVoiceSettings& InNonSpatializedSettings, bool bStartSpatialized);
	void UpdateSettingsUsageForNextBeginTalk(bool bUseSpatialized, bool* bSettingsUpdated);
	void ListenForTalkingStateChangedEvents();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HDVOIPTalker_C">();
	}
	static class UBP_HDVOIPTalker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HDVOIPTalker_C>();
	}
};
static_assert(alignof(UBP_HDVOIPTalker_C) == 0x000008, "Wrong alignment on UBP_HDVOIPTalker_C");
static_assert(sizeof(UBP_HDVOIPTalker_C) == 0x000138, "Wrong size on UBP_HDVOIPTalker_C");
static_assert(offsetof(UBP_HDVOIPTalker_C, UberGraphFrame) == 0x0000E8, "Member 'UBP_HDVOIPTalker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HDVOIPTalker_C, OwningPS) == 0x0000F0, "Member 'UBP_HDVOIPTalker_C::OwningPS' has a wrong offset!");
static_assert(offsetof(UBP_HDVOIPTalker_C, NonSpatializedSettings) == 0x0000F8, "Member 'UBP_HDVOIPTalker_C::NonSpatializedSettings' has a wrong offset!");
static_assert(offsetof(UBP_HDVOIPTalker_C, SpatializedSettings) == 0x000110, "Member 'UBP_HDVOIPTalker_C::SpatializedSettings' has a wrong offset!");
static_assert(offsetof(UBP_HDVOIPTalker_C, bRegistered) == 0x000128, "Member 'UBP_HDVOIPTalker_C::bRegistered' has a wrong offset!");
static_assert(offsetof(UBP_HDVOIPTalker_C, bTalking) == 0x000129, "Member 'UBP_HDVOIPTalker_C::bTalking' has a wrong offset!");
static_assert(offsetof(UBP_HDVOIPTalker_C, CachedAudioComp) == 0x000130, "Member 'UBP_HDVOIPTalker_C::CachedAudioComp' has a wrong offset!");

}

