#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HDCapturePointBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HDMain_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_HDCapturePointBase.BP_HDCapturePointBase_C.OnCaptureStatusUpdated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_HDCapturePointBase_C_OnCaptureStatusUpdated__DelegateSignature final
{
public:
	class ABP_HDCapturePointBase_C*               ControlPoint;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HDCapturePointBase_C_OnCaptureStatusUpdated__DelegateSignature) == 0x000008, "Wrong alignment on BP_HDCapturePointBase_C_OnCaptureStatusUpdated__DelegateSignature");
static_assert(sizeof(BP_HDCapturePointBase_C_OnCaptureStatusUpdated__DelegateSignature) == 0x000008, "Wrong size on BP_HDCapturePointBase_C_OnCaptureStatusUpdated__DelegateSignature");
static_assert(offsetof(BP_HDCapturePointBase_C_OnCaptureStatusUpdated__DelegateSignature, ControlPoint) == 0x000000, "Member 'BP_HDCapturePointBase_C_OnCaptureStatusUpdated__DelegateSignature::ControlPoint' has a wrong offset!");

// Function BP_HDCapturePointBase.BP_HDCapturePointBase_C.ExecuteUbergraph_BP_HDCapturePointBase
// 0x06D0 (0x06D0 - 0x0000)
struct BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x9];                                       // 0x0017(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNavigationInvokerComponent*            CallFunc_AddComponent_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0138(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0178(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0190(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x01A8(0x0018)()
	EHDTeam                                       K2Node_Event_LastOwningTeam;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewContested;                        // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x01C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x01D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01E8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0228(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0238(0x0018)()
	bool                                          K2Node_CustomEvent_bContested;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Progress;                       // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewActive;                           // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewLocked;                           // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0280(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x02C0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0304(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0318(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0330(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0348(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0360(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x0378(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0390(0x0040)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_2;                           // 0x03D0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x03E8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0428(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x0468(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x04A8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x04E8(0x0040)(HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x052A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x052B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_12;           // 0x0530(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_13;           // 0x0570(0x0040)(HasGetValueTypeHash)
	EHDTeam                                       Temp_byte_Variable;                                // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B2[0x6];                                      // 0x05B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x05B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_14;           // 0x05D0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_15;           // 0x0610(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0650(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0660(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0670(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0688(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x06A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x06B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_4;                           // 0x06C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase) == 0x000010, "Wrong alignment on BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase");
static_assert(sizeof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase) == 0x0006D0, "Wrong size on BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, EntryPoint) == 0x000000, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, Temp_struct_Variable) == 0x000004, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, Temp_bool_Variable) == 0x000014, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, Temp_bool_Variable_1) == 0x000015, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, Temp_bool_Variable_2) == 0x000016, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, Temp_struct_Variable_1) == 0x000020, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_IsDedicatedServer_ReturnValue) == 0x000050, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_AddComponent_ReturnValue) == 0x000058, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_HasAuthority_ReturnValue) == 0x000060, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_Event_DeltaSeconds) == 0x000064, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_Conv_BoolToString_ReturnValue) == 0x000068, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_Conv_BoolToString_ReturnValue_1) == 0x000078, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_Conv_BoolToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000A0, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData) == 0x0000B8, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F8, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_2) == 0x000138, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_MakeLiteralText_ReturnValue) == 0x000178, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000190, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_MakeLiteralText_ReturnValue_2) == 0x0001A8, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_Event_LastOwningTeam) == 0x0001C0, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_Event_LastOwningTeam' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_Event_bNewContested) == 0x0001C1, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_Event_bNewContested' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_SelectColor_ReturnValue) == 0x0001C4, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, Temp_struct_Variable_2) == 0x0001D4, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001E8, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeArray_Array) == 0x000228, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_Format_ReturnValue) == 0x000238, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_CustomEvent_bContested) == 0x000250, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_CustomEvent_bContested' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_CustomEvent_Progress) == 0x000254, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_CustomEvent_Progress' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_Conv_TextToString_ReturnValue) == 0x000258, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_SelectString_ReturnValue) == 0x000268, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_Event_bNewActive) == 0x000278, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_Event_bNewActive' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_Event_bNewLocked) == 0x000279, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_Event_bNewLocked' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_4) == 0x000280, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_5) == 0x0002C0, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_BooleanAND_ReturnValue) == 0x000300, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_Not_PreBool_ReturnValue) == 0x000301, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, Temp_bool_Variable_3) == 0x000302, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_BooleanOR_ReturnValue) == 0x000303, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_Select_Default) == 0x000304, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000318, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_MakeLiteralText_ReturnValue_4) == 0x000330, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_MakeLiteralText_ReturnValue_5) == 0x000348, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_Select_Default_1) == 0x000360, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_MakeLiteralText_ReturnValue_6) == 0x000378, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_MakeLiteralText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_6) == 0x000390, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_Select_Default_2) == 0x0003D0, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_7) == 0x0003E8, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_8) == 0x000428, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_8' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_9) == 0x000468, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_9' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_10) == 0x0004A8, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_10' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_11) == 0x0004E8, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_11' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_Event_EndPlayReason) == 0x000528, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000529, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_Not_PreBool_ReturnValue_1) == 0x00052A, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_BooleanAND_ReturnValue_1) == 0x00052B, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_12) == 0x000530, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_12' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_13) == 0x000570, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_13' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, Temp_byte_Variable) == 0x0005B0, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_IsValid_ReturnValue) == 0x0005B1, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_Select_Default_3) == 0x0005B8, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_14) == 0x0005D0, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_14' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeStruct_FormatArgumentData_15) == 0x000610, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeStruct_FormatArgumentData_15' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeArray_Array_1) == 0x000650, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_MakeArray_Array_2) == 0x000660, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_Format_ReturnValue_1) == 0x000670, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_Format_ReturnValue_2) == 0x000688, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0006A0, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0006B0, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase, K2Node_Select_Default_4) == 0x0006C0, "Member 'BP_HDCapturePointBase_C_ExecuteUbergraph_BP_HDCapturePointBase::K2Node_Select_Default_4' has a wrong offset!");

// Function BP_HDCapturePointBase.BP_HDCapturePointBase_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_HDCapturePointBase_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HDCapturePointBase_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_HDCapturePointBase_C_ReceiveEndPlay");
static_assert(sizeof(BP_HDCapturePointBase_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_HDCapturePointBase_C_ReceiveEndPlay");
static_assert(offsetof(BP_HDCapturePointBase_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_HDCapturePointBase_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_HDCapturePointBase.BP_HDCapturePointBase_C.ReceiveOnLocked
// 0x0001 (0x0001 - 0x0000)
struct BP_HDCapturePointBase_C_ReceiveOnLocked final
{
public:
	bool                                          bNewLocked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HDCapturePointBase_C_ReceiveOnLocked) == 0x000001, "Wrong alignment on BP_HDCapturePointBase_C_ReceiveOnLocked");
static_assert(sizeof(BP_HDCapturePointBase_C_ReceiveOnLocked) == 0x000001, "Wrong size on BP_HDCapturePointBase_C_ReceiveOnLocked");
static_assert(offsetof(BP_HDCapturePointBase_C_ReceiveOnLocked, bNewLocked) == 0x000000, "Member 'BP_HDCapturePointBase_C_ReceiveOnLocked::bNewLocked' has a wrong offset!");

// Function BP_HDCapturePointBase.BP_HDCapturePointBase_C.ReceiveOnActive
// 0x0001 (0x0001 - 0x0000)
struct BP_HDCapturePointBase_C_ReceiveOnActive final
{
public:
	bool                                          bNewActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HDCapturePointBase_C_ReceiveOnActive) == 0x000001, "Wrong alignment on BP_HDCapturePointBase_C_ReceiveOnActive");
static_assert(sizeof(BP_HDCapturePointBase_C_ReceiveOnActive) == 0x000001, "Wrong size on BP_HDCapturePointBase_C_ReceiveOnActive");
static_assert(offsetof(BP_HDCapturePointBase_C_ReceiveOnActive, bNewActive) == 0x000000, "Member 'BP_HDCapturePointBase_C_ReceiveOnActive::bNewActive' has a wrong offset!");

// Function BP_HDCapturePointBase.BP_HDCapturePointBase_C.OnCaptureUpdate
// 0x0008 (0x0008 - 0x0000)
struct BP_HDCapturePointBase_C_OnCaptureUpdate final
{
public:
	bool                                          bContested_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Progress;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HDCapturePointBase_C_OnCaptureUpdate) == 0x000004, "Wrong alignment on BP_HDCapturePointBase_C_OnCaptureUpdate");
static_assert(sizeof(BP_HDCapturePointBase_C_OnCaptureUpdate) == 0x000008, "Wrong size on BP_HDCapturePointBase_C_OnCaptureUpdate");
static_assert(offsetof(BP_HDCapturePointBase_C_OnCaptureUpdate, bContested_0) == 0x000000, "Member 'BP_HDCapturePointBase_C_OnCaptureUpdate::bContested_0' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_OnCaptureUpdate, Progress) == 0x000004, "Member 'BP_HDCapturePointBase_C_OnCaptureUpdate::Progress' has a wrong offset!");

// Function BP_HDCapturePointBase.BP_HDCapturePointBase_C.ReceiveOnCaptureProgress
// 0x0001 (0x0001 - 0x0000)
struct BP_HDCapturePointBase_C_ReceiveOnCaptureProgress final
{
public:
	bool                                          bNewContested;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HDCapturePointBase_C_ReceiveOnCaptureProgress) == 0x000001, "Wrong alignment on BP_HDCapturePointBase_C_ReceiveOnCaptureProgress");
static_assert(sizeof(BP_HDCapturePointBase_C_ReceiveOnCaptureProgress) == 0x000001, "Wrong size on BP_HDCapturePointBase_C_ReceiveOnCaptureProgress");
static_assert(offsetof(BP_HDCapturePointBase_C_ReceiveOnCaptureProgress, bNewContested) == 0x000000, "Member 'BP_HDCapturePointBase_C_ReceiveOnCaptureProgress::bNewContested' has a wrong offset!");

// Function BP_HDCapturePointBase.BP_HDCapturePointBase_C.ReceiveOnOwningTeamUpdated
// 0x0001 (0x0001 - 0x0000)
struct BP_HDCapturePointBase_C_ReceiveOnOwningTeamUpdated final
{
public:
	EHDTeam                                       LastOwningTeam;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HDCapturePointBase_C_ReceiveOnOwningTeamUpdated) == 0x000001, "Wrong alignment on BP_HDCapturePointBase_C_ReceiveOnOwningTeamUpdated");
static_assert(sizeof(BP_HDCapturePointBase_C_ReceiveOnOwningTeamUpdated) == 0x000001, "Wrong size on BP_HDCapturePointBase_C_ReceiveOnOwningTeamUpdated");
static_assert(offsetof(BP_HDCapturePointBase_C_ReceiveOnOwningTeamUpdated, LastOwningTeam) == 0x000000, "Member 'BP_HDCapturePointBase_C_ReceiveOnOwningTeamUpdated::LastOwningTeam' has a wrong offset!");

// Function BP_HDCapturePointBase.BP_HDCapturePointBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_HDCapturePointBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HDCapturePointBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_HDCapturePointBase_C_ReceiveTick");
static_assert(sizeof(BP_HDCapturePointBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_HDCapturePointBase_C_ReceiveTick");
static_assert(offsetof(BP_HDCapturePointBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_HDCapturePointBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_HDCapturePointBase.BP_HDCapturePointBase_C.UserConstructionScript
// 0x00D0 (0x00D0 - 0x0000)
struct BP_HDCapturePointBase_C_UserConstructionScript final
{
public:
	float                                         CapsuleHalfHeight;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class UChildActorComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HDCapturePointBase_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_HDCapturePointBase_C_UserConstructionScript");
static_assert(sizeof(BP_HDCapturePointBase_C_UserConstructionScript) == 0x0000D0, "Wrong size on BP_HDCapturePointBase_C_UserConstructionScript");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CapsuleHalfHeight) == 0x000000, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x000040, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x00004C, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x000058, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000068, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x00006C, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000070, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_FMax_ReturnValue) == 0x000078, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x00007C, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x0000C0, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x0000C8, "Member 'BP_HDCapturePointBase_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_HDCapturePointBase.BP_HDCapturePointBase_C.UpdateFlagColor
// 0x0050 (0x0050 - 0x0000)
struct BP_HDCapturePointBase_C_UpdateFlagColor final
{
public:
	EHDTeam                                       InOwningTeam;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHDTeam                                       Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HDCapturePointBase_C_UpdateFlagColor) == 0x000008, "Wrong alignment on BP_HDCapturePointBase_C_UpdateFlagColor");
static_assert(sizeof(BP_HDCapturePointBase_C_UpdateFlagColor) == 0x000050, "Wrong size on BP_HDCapturePointBase_C_UpdateFlagColor");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagColor, InOwningTeam) == 0x000000, "Member 'BP_HDCapturePointBase_C_UpdateFlagColor::InOwningTeam' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagColor, Temp_byte_Variable) == 0x000001, "Member 'BP_HDCapturePointBase_C_UpdateFlagColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagColor, Temp_struct_Variable) == 0x000004, "Member 'BP_HDCapturePointBase_C_UpdateFlagColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagColor, Temp_struct_Variable_1) == 0x000014, "Member 'BP_HDCapturePointBase_C_UpdateFlagColor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagColor, Temp_struct_Variable_2) == 0x000024, "Member 'BP_HDCapturePointBase_C_UpdateFlagColor::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagColor, K2Node_Select_Default) == 0x000034, "Member 'BP_HDCapturePointBase_C_UpdateFlagColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagColor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000048, "Member 'BP_HDCapturePointBase_C_UpdateFlagColor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_HDCapturePointBase.BP_HDCapturePointBase_C.UpdateFlagIcon
// 0x0080 (0x0080 - 0x0000)
struct BP_HDCapturePointBase_C_UpdateFlagIcon final
{
public:
	EHDTeam                                       InOwningTeam;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   InLocalPlayerHUD;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   LocalPlayerHUDToUse;                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHDControlPointObjectiveType                  Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamNum_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHDControlPointObjectiveType                  CallFunc_GetObjectiveTypeForTeam_ReturnValue;      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CaptureStatus_FlagIcon_C*          K2Node_DynamicCast_AsWBP_Capture_Status_Flag_Icon; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HDCapturePointBase_C_UpdateFlagIcon) == 0x000008, "Wrong alignment on BP_HDCapturePointBase_C_UpdateFlagIcon");
static_assert(sizeof(BP_HDCapturePointBase_C_UpdateFlagIcon) == 0x000080, "Wrong size on BP_HDCapturePointBase_C_UpdateFlagIcon");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, InOwningTeam) == 0x000000, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::InOwningTeam' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, InLocalPlayerHUD) == 0x000008, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::InLocalPlayerHUD' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, LocalPlayerHUDToUse) == 0x000010, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::LocalPlayerHUDToUse' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, Temp_byte_Variable) == 0x000018, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, CallFunc_IsDedicatedServer_ReturnValue) == 0x000019, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, CallFunc_GetHUD_ReturnValue) == 0x000030, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, CallFunc_IsValid_ReturnValue_2) == 0x000038, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, Temp_bool_Variable) == 0x000039, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, CallFunc_GetPlayerController_ReturnValue_1) == 0x000040, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, CallFunc_IsValid_ReturnValue_3) == 0x000048, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, CallFunc_GetHUD_ReturnValue_1) == 0x000050, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HDCapturePointBase_C_UpdateFlagIcon, CallFunc_GetTeamNum_ReturnValue) == 0x000058, "Member 'BP_HDCapturePointBase_C_UpdateFlagIcon::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
