#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_RadialMenuHelpers

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPFL_RadialMenuHelpers.BPFL_RadialMenuHelpers_C.CenterMousePosition
// 0x0038 (0x0038 - 0x0000)
struct BPFL_RadialMenuHelpers_C_CenterMousePosition final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PlayerController;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_RadialMenuHelpers_C_CenterMousePosition) == 0x000008, "Wrong alignment on BPFL_RadialMenuHelpers_C_CenterMousePosition");
static_assert(sizeof(BPFL_RadialMenuHelpers_C_CenterMousePosition) == 0x000038, "Wrong size on BPFL_RadialMenuHelpers_C_CenterMousePosition");
static_assert(offsetof(BPFL_RadialMenuHelpers_C_CenterMousePosition, PlayerIndex) == 0x000000, "Member 'BPFL_RadialMenuHelpers_C_CenterMousePosition::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BPFL_RadialMenuHelpers_C_CenterMousePosition, PlayerController) == 0x000008, "Member 'BPFL_RadialMenuHelpers_C_CenterMousePosition::PlayerController' has a wrong offset!");
static_assert(offsetof(BPFL_RadialMenuHelpers_C_CenterMousePosition, __WorldContext) == 0x000010, "Member 'BPFL_RadialMenuHelpers_C_CenterMousePosition::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RadialMenuHelpers_C_CenterMousePosition, CallFunc_GetViewportSize_ReturnValue) == 0x000018, "Member 'BPFL_RadialMenuHelpers_C_CenterMousePosition::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RadialMenuHelpers_C_CenterMousePosition, CallFunc_BreakVector2D_X) == 0x000020, "Member 'BPFL_RadialMenuHelpers_C_CenterMousePosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BPFL_RadialMenuHelpers_C_CenterMousePosition, CallFunc_BreakVector2D_Y) == 0x000024, "Member 'BPFL_RadialMenuHelpers_C_CenterMousePosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BPFL_RadialMenuHelpers_C_CenterMousePosition, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'BPFL_RadialMenuHelpers_C_CenterMousePosition::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RadialMenuHelpers_C_CenterMousePosition, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'BPFL_RadialMenuHelpers_C_CenterMousePosition::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_RadialMenuHelpers_C_CenterMousePosition, CallFunc_FTrunc_ReturnValue) == 0x000030, "Member 'BPFL_RadialMenuHelpers_C_CenterMousePosition::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RadialMenuHelpers_C_CenterMousePosition, CallFunc_FTrunc_ReturnValue_1) == 0x000034, "Member 'BPFL_RadialMenuHelpers_C_CenterMousePosition::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");

}

