#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_UINotificationSticky

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_UINotificationSticky.BPI_UINotificationSticky_C.Get Is Sticky?
// 0x0008 (0x0008 - 0x0000)
struct BPI_UINotificationSticky_C_Get_Is_Sticky_ final
{
public:
	bool                                          bIsSticky;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StickyPriority;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_UINotificationSticky_C_Get_Is_Sticky_) == 0x000004, "Wrong alignment on BPI_UINotificationSticky_C_Get_Is_Sticky_");
static_assert(sizeof(BPI_UINotificationSticky_C_Get_Is_Sticky_) == 0x000008, "Wrong size on BPI_UINotificationSticky_C_Get_Is_Sticky_");
static_assert(offsetof(BPI_UINotificationSticky_C_Get_Is_Sticky_, bIsSticky) == 0x000000, "Member 'BPI_UINotificationSticky_C_Get_Is_Sticky_::bIsSticky' has a wrong offset!");
static_assert(offsetof(BPI_UINotificationSticky_C_Get_Is_Sticky_, StickyPriority) == 0x000004, "Member 'BPI_UINotificationSticky_C_Get_Is_Sticky_::StickyPriority' has a wrong offset!");

// Function BPI_UINotificationSticky.BPI_UINotificationSticky_C.Set Top
// 0x0001 (0x0001 - 0x0000)
struct BPI_UINotificationSticky_C_Set_Top final
{
public:
	bool                                          bTop;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_UINotificationSticky_C_Set_Top) == 0x000001, "Wrong alignment on BPI_UINotificationSticky_C_Set_Top");
static_assert(sizeof(BPI_UINotificationSticky_C_Set_Top) == 0x000001, "Wrong size on BPI_UINotificationSticky_C_Set_Top");
static_assert(offsetof(BPI_UINotificationSticky_C_Set_Top, bTop) == 0x000000, "Member 'BPI_UINotificationSticky_C_Set_Top::bTop' has a wrong offset!");

// Function BPI_UINotificationSticky.BPI_UINotificationSticky_C.Set Tray
// 0x0008 (0x0008 - 0x0000)
struct BPI_UINotificationSticky_C_Set_Tray final
{
public:
	class UWBP_NotificationTray_C*                Notification_Tray;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_UINotificationSticky_C_Set_Tray) == 0x000008, "Wrong alignment on BPI_UINotificationSticky_C_Set_Tray");
static_assert(sizeof(BPI_UINotificationSticky_C_Set_Tray) == 0x000008, "Wrong size on BPI_UINotificationSticky_C_Set_Tray");
static_assert(offsetof(BPI_UINotificationSticky_C_Set_Tray, Notification_Tray) == 0x000000, "Member 'BPI_UINotificationSticky_C_Set_Tray::Notification_Tray' has a wrong offset!");

}

