#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DonkehFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DonkehFramework_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_classes.hpp"
#include "UMG_structs.hpp"
#include "NavigationSystem_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"


namespace SDK
{

// Class DonkehFramework.DFGunRecoilHandler
// 0x0000 (0x0028 - 0x0028)
class UDFGunRecoilHandler : public UObject
{
public:
	struct FVector GetConeOfFireOffset();
	void OnTick(float DeltaTime);
	void OnWeaponFire();
	void OnWeaponStartFire();
	void OnWeaponStopFire();

	class ADFBaseGun* GetOwningGun() const;
	class APawn* GetOwningPawn() const;
	bool IsFiring() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFGunRecoilHandler">();
	}
	static class UDFGunRecoilHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFGunRecoilHandler>();
	}
};
static_assert(alignof(UDFGunRecoilHandler) == 0x000008, "Wrong alignment on UDFGunRecoilHandler");
static_assert(sizeof(UDFGunRecoilHandler) == 0x000028, "Wrong size on UDFGunRecoilHandler");

// Class DonkehFramework.DFCfgDataManager
// 0x0050 (0x0078 - 0x0028)
class UDFCfgDataManager : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFCfgDataManager">();
	}
	static class UDFCfgDataManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFCfgDataManager>();
	}
};
static_assert(alignof(UDFCfgDataManager) == 0x000008, "Wrong alignment on UDFCfgDataManager");
static_assert(sizeof(UDFCfgDataManager) == 0x000078, "Wrong size on UDFCfgDataManager");

// Class DonkehFramework.DFHandlerInterface
// 0x0000 (0x0028 - 0x0028)
class IDFHandlerInterface final : public IInterface
{
public:
	void EventInit();
	void EventOnNewPawn(class APawn* NewPawn, class APawn* PreviousPawn);
	void EventReset();
	void EventRespawn();
	bool EventShouldUpdateThisFrame(float DeltaTime, bool bActiveAndSpawnedInWorld);
	void EventUpdate(float DeltaTime, bool bMakeDecision);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFHandlerInterface">();
	}
	static class IDFHandlerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDFHandlerInterface>();
	}
};
static_assert(alignof(IDFHandlerInterface) == 0x000008, "Wrong alignment on IDFHandlerInterface");
static_assert(sizeof(IDFHandlerInterface) == 0x000028, "Wrong size on IDFHandlerInterface");

// Class DonkehFramework.DFMapRotationManager
// 0x0018 (0x0090 - 0x0078)
class UDFMapRotationManager final : public UDFCfgDataManager
{
public:
	uint8                                         Pad_78[0x18];                                      // 0x0078(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFMapRotationManager">();
	}
	static class UDFMapRotationManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMapRotationManager>();
	}
};
static_assert(alignof(UDFMapRotationManager) == 0x000008, "Wrong alignment on UDFMapRotationManager");
static_assert(sizeof(UDFMapRotationManager) == 0x000090, "Wrong size on UDFMapRotationManager");

// Class DonkehFramework.DFLocalPlayer
// 0x0000 (0x0258 - 0x0258)
class UDFLocalPlayer : public ULocalPlayer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFLocalPlayer">();
	}
	static class UDFLocalPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFLocalPlayer>();
	}
};
static_assert(alignof(UDFLocalPlayer) == 0x000008, "Wrong alignment on UDFLocalPlayer");
static_assert(sizeof(UDFLocalPlayer) == 0x000258, "Wrong size on UDFLocalPlayer");

// Class DonkehFramework.DFBaseAIController
// 0x0008 (0x0330 - 0x0328)
class ADFBaseAIController : public AAIController
{
public:
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CanRestartPlayer();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFBaseAIController">();
	}
	static class ADFBaseAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADFBaseAIController>();
	}
};
static_assert(alignof(ADFBaseAIController) == 0x000008, "Wrong alignment on ADFBaseAIController");
static_assert(sizeof(ADFBaseAIController) == 0x000330, "Wrong size on ADFBaseAIController");

// Class DonkehFramework.DFInfo
// 0x0000 (0x0220 - 0x0220)
class ADFInfo : public AInfo
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFInfo">();
	}
	static class ADFInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADFInfo>();
	}
};
static_assert(alignof(ADFInfo) == 0x000008, "Wrong alignment on ADFInfo");
static_assert(sizeof(ADFInfo) == 0x000220, "Wrong size on ADFInfo");

// Class DonkehFramework.DFPlayerAdminList
// 0x0050 (0x00C8 - 0x0078)
class UDFPlayerAdminList final : public UDFCfgDataManager
{
public:
	uint8                                         Pad_78[0x50];                                      // 0x0078(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFPlayerAdminList">();
	}
	static class UDFPlayerAdminList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFPlayerAdminList>();
	}
};
static_assert(alignof(UDFPlayerAdminList) == 0x000008, "Wrong alignment on UDFPlayerAdminList");
static_assert(sizeof(UDFPlayerAdminList) == 0x0000C8, "Wrong size on UDFPlayerAdminList");

// Class DonkehFramework.DFBaseItem
// 0x0188 (0x03A8 - 0x0220)
class ADFBaseItem : public AActor
{
public:
	class ADFBaseCharacter*                       PawnOwner;                                         // 0x0220(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   ItemMesh;                                          // 0x0228(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   ItemMesh1P;                                        // 0x0230(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMesh*                          PawnMesh1P;                                        // 0x0238(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAnimInstance>              PawnMesh1PAnimClass;                               // 0x0240(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PawnMesh1PLocationOffset;                          // 0x0248(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               PawnMesh1PRotationOffset;                          // 0x0254(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EItemType                                     ItemType;                                          // 0x0260(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESpecificItemType                             SpecificItemType;                                  // 0x0261(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bCanEquip : 1;                                     // 0x0262(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCanAimWhileEquipped : 1;                          // 0x0262(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bDisableFireInput : 1;                             // 0x0262(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEquipped : 1;                                     // 0x0262(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bPendingEquip : 1;                                 // 0x0262(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bPendingUnEquip : 1;                               // 0x0262(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bWantsToFire : 1;                                  // 0x0262(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_263[0x1];                                      // 0x0263(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastFiredShotID;                                   // 0x0264(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_268[0x10];                                     // 0x0268(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bDebug : 1;                                        // 0x0278(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterAnimCollection               CharacterAnimCollection;                           // 0x0280(0x0128)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void ForceStopFiring();
	void OnEnterInventory(class ADFBaseCharacter* NewOwner, class ADFBaseCharacter* LastOwner);
	void OnEquip(const class ADFBaseItem* LastItem);
	void OnLeaveInventory(class ADFBaseCharacter* LastOwner);
	void OnRep_PawnOwner(class ADFBaseCharacter* LastOwner);
	void OnTurnOff();
	void OnUnEquip(bool bPlayAnimAndWait, bool bLeavingPawnInventory);
	void ReceiveOnEnterInventory(class ADFBaseCharacter* NewOwner, class ADFBaseCharacter* LastOwner);
	void ReceiveOnEquip(const class ADFBaseItem* LastItem);
	void ReceiveOnEquipFinished();
	void ReceiveOnLeaveInventory(class ADFBaseCharacter* LastOwner);
	void ReceiveOnTurnOff();
	void ReceiveOnUnEquip(bool bPlayAnimAndWait, bool bLeavingPawnInventory);
	void ReceiveOnUnEquipFinished(bool bLeavingPawnInventory);
	void ReceiveStartFire();
	void ReceiveStopFire();
	void ReceiveVisibilityChanged(bool bFirstPerson);
	bool RemoveLegacyLocomotionAnims(bool bFPP);
	void ServerStartFire(const struct FVector_NetQuantize& Origin, const struct FVector_NetQuantizeNormal& ShootDir, int32 RandomSeed, float Timestamp, int32 ShotID);
	void ServerStopFire();
	void SetMeshVisibility(bool bFirstPerson);
	void SetOwningPawn(class ADFBaseCharacter* NewOwner);
	void StartFire();
	void StopFire();

	bool CanAimWhileEquipped() const;
	bool CanEquip() const;
	bool CanFire() const;
	bool CanSprintWhileEquipped() const;
	bool CanStartFire() const;
	bool CanTriggerFire() const;
	struct FVector GetAdjustedAimDirection() const;
	class UStaticMeshComponent* GetItemMesh() const;
	class UStaticMeshComponent* GetItemMesh1P() const;
	class UStaticMeshComponent* GetItemMeshToUse(bool bIgnoreLocalControlOnServer) const;
	EItemType GetItemType() const;
	TMap<class FName, class UAnimSequenceBase*> GetLegacyLocomotionAnims(bool bFPP) const;
	struct FVector GetOwnerViewLocation() const;
	bool GetOwnerViewPoint(struct FVector* OutViewLoc, struct FRotator* OutViewRot) const;
	struct FRotator GetOwnerViewRotation() const;
	class UDFInventoryComponent* GetPawnInventory() const;
	class ADFBaseCharacter* GetPawnOwner() const;
	ESpecificItemType GetSpecificItemType() const;
	bool IsClientSimulated() const;
	bool IsEquipped() const;
	bool IsEquipping() const;
	bool IsLocallyControlled() const;
	bool IsUnEquipping() const;
	bool OwnerIsAiming() const;
	bool OwnerIsSprinting() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFBaseItem">();
	}
	static class ADFBaseItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADFBaseItem>();
	}
};
static_assert(alignof(ADFBaseItem) == 0x000008, "Wrong alignment on ADFBaseItem");
static_assert(sizeof(ADFBaseItem) == 0x0003A8, "Wrong size on ADFBaseItem");
static_assert(offsetof(ADFBaseItem, PawnOwner) == 0x000220, "Member 'ADFBaseItem::PawnOwner' has a wrong offset!");
static_assert(offsetof(ADFBaseItem, ItemMesh) == 0x000228, "Member 'ADFBaseItem::ItemMesh' has a wrong offset!");
static_assert(offsetof(ADFBaseItem, ItemMesh1P) == 0x000230, "Member 'ADFBaseItem::ItemMesh1P' has a wrong offset!");
static_assert(offsetof(ADFBaseItem, PawnMesh1P) == 0x000238, "Member 'ADFBaseItem::PawnMesh1P' has a wrong offset!");
static_assert(offsetof(ADFBaseItem, PawnMesh1PAnimClass) == 0x000240, "Member 'ADFBaseItem::PawnMesh1PAnimClass' has a wrong offset!");
static_assert(offsetof(ADFBaseItem, PawnMesh1PLocationOffset) == 0x000248, "Member 'ADFBaseItem::PawnMesh1PLocationOffset' has a wrong offset!");
static_assert(offsetof(ADFBaseItem, PawnMesh1PRotationOffset) == 0x000254, "Member 'ADFBaseItem::PawnMesh1PRotationOffset' has a wrong offset!");
static_assert(offsetof(ADFBaseItem, ItemType) == 0x000260, "Member 'ADFBaseItem::ItemType' has a wrong offset!");
static_assert(offsetof(ADFBaseItem, SpecificItemType) == 0x000261, "Member 'ADFBaseItem::SpecificItemType' has a wrong offset!");
static_assert(offsetof(ADFBaseItem, LastFiredShotID) == 0x000264, "Member 'ADFBaseItem::LastFiredShotID' has a wrong offset!");
static_assert(offsetof(ADFBaseItem, CharacterAnimCollection) == 0x000280, "Member 'ADFBaseItem::CharacterAnimCollection' has a wrong offset!");

// Class DonkehFramework.DFIntrinsicCharAnimInstInterface
// 0x0000 (0x0028 - 0x0028)
class IDFIntrinsicCharAnimInstInterface final : public IInterface
{
public:
	float PlayDeathMontage(class UAnimMontage* MontageToPlay);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFIntrinsicCharAnimInstInterface">();
	}
	static class IDFIntrinsicCharAnimInstInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDFIntrinsicCharAnimInstInterface>();
	}
};
static_assert(alignof(IDFIntrinsicCharAnimInstInterface) == 0x000008, "Wrong alignment on IDFIntrinsicCharAnimInstInterface");
static_assert(sizeof(IDFIntrinsicCharAnimInstInterface) == 0x000028, "Wrong size on IDFIntrinsicCharAnimInstInterface");

// Class DonkehFramework.DFPlayerBanList
// 0x0050 (0x00C8 - 0x0078)
class UDFPlayerBanList final : public UDFCfgDataManager
{
public:
	uint8                                         Pad_78[0x50];                                      // 0x0078(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFPlayerBanList">();
	}
	static class UDFPlayerBanList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFPlayerBanList>();
	}
};
static_assert(alignof(UDFPlayerBanList) == 0x000008, "Wrong alignment on UDFPlayerBanList");
static_assert(sizeof(UDFPlayerBanList) == 0x0000C8, "Wrong size on UDFPlayerBanList");

// Class DonkehFramework.DFIntrinsicWeapAnimInstInterface
// 0x0000 (0x0028 - 0x0028)
class IDFIntrinsicWeapAnimInstInterface final : public IInterface
{
public:
	float PlayEquipMontage(class UAnimMontage* MontageToPlay);
	float PlayFireMontage(class UAnimMontage* MontageToPlay, bool bFireLast, bool bAiming);
	float PlayReloadMontage(class UAnimMontage* MontageToPlay, bool bFullReload);
	float PlayUnEquipMontage(class UAnimMontage* MontageToPlay);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFIntrinsicWeapAnimInstInterface">();
	}
	static class IDFIntrinsicWeapAnimInstInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDFIntrinsicWeapAnimInstInterface>();
	}
};
static_assert(alignof(IDFIntrinsicWeapAnimInstInterface) == 0x000008, "Wrong alignment on IDFIntrinsicWeapAnimInstInterface");
static_assert(sizeof(IDFIntrinsicWeapAnimInstInterface) == 0x000028, "Wrong size on IDFIntrinsicWeapAnimInstInterface");

// Class DonkehFramework.DFPlayerWhitelist
// 0x0050 (0x00C8 - 0x0078)
class UDFPlayerWhitelist final : public UDFCfgDataManager
{
public:
	uint8                                         Pad_78[0x50];                                      // 0x0078(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFPlayerWhitelist">();
	}
	static class UDFPlayerWhitelist* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFPlayerWhitelist>();
	}
};
static_assert(alignof(UDFPlayerWhitelist) == 0x000008, "Wrong alignment on UDFPlayerWhitelist");
static_assert(sizeof(UDFPlayerWhitelist) == 0x0000C8, "Wrong size on UDFPlayerWhitelist");

// Class DonkehFramework.DFAssetManager
// 0x0008 (0x0440 - 0x0438)
class UDFAssetManager : public UAssetManager
{
public:
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFAssetManager">();
	}
	static class UDFAssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFAssetManager>();
	}
};
static_assert(alignof(UDFAssetManager) == 0x000008, "Wrong alignment on UDFAssetManager");
static_assert(sizeof(UDFAssetManager) == 0x000440, "Wrong size on UDFAssetManager");

// Class DonkehFramework.DFBaseAmmoClip
// 0x0020 (0x03C8 - 0x03A8)
class ADFBaseAmmoClip final : public ADFBaseItem
{
public:
	class ADFBaseGun*                             GunOwner;                                          // 0x03A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentClipAmmo;                                   // 0x03B0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         ReloadCounter;                                     // 0x03B4(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SimulatedCurrentClipAmmo;                          // 0x03B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartingClipAmmo;                                  // 0x03C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxClipAmmo;                                       // 0x03C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static int32 StoreAmmoInInventory(class UDFInventoryComponent* AmmoStore, int32 AmmoAmt, const TSubclassOf<class ADFBaseAmmoClip>& AmmoType);

	void ConsumeAmmo(int32 AmmoToConsume);
	void OnRep_CurrentClipAmmo();
	void OnRep_ReloadCounter();
	void SetCurrentClipAmmo(int32 NewClipAmmo);
	void SetOwningGun(class ADFBaseGun* NewOwner);
	void StoreAmmo(int32 AmmoToStore);

	int32 GetCurrentClipAmmo() const;
	class ADFBaseGun* GetGunOwner() const;
	int32 GetMaxClipAmmo() const;
	int32 GetStartingClipAmmo() const;
	bool IsLoaded() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFBaseAmmoClip">();
	}
	static class ADFBaseAmmoClip* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADFBaseAmmoClip>();
	}
};
static_assert(alignof(ADFBaseAmmoClip) == 0x000008, "Wrong alignment on ADFBaseAmmoClip");
static_assert(sizeof(ADFBaseAmmoClip) == 0x0003C8, "Wrong size on ADFBaseAmmoClip");
static_assert(offsetof(ADFBaseAmmoClip, GunOwner) == 0x0003A8, "Member 'ADFBaseAmmoClip::GunOwner' has a wrong offset!");
static_assert(offsetof(ADFBaseAmmoClip, CurrentClipAmmo) == 0x0003B0, "Member 'ADFBaseAmmoClip::CurrentClipAmmo' has a wrong offset!");
static_assert(offsetof(ADFBaseAmmoClip, ReloadCounter) == 0x0003B4, "Member 'ADFBaseAmmoClip::ReloadCounter' has a wrong offset!");
static_assert(offsetof(ADFBaseAmmoClip, SimulatedCurrentClipAmmo) == 0x0003B8, "Member 'ADFBaseAmmoClip::SimulatedCurrentClipAmmo' has a wrong offset!");
static_assert(offsetof(ADFBaseAmmoClip, StartingClipAmmo) == 0x0003C0, "Member 'ADFBaseAmmoClip::StartingClipAmmo' has a wrong offset!");
static_assert(offsetof(ADFBaseAmmoClip, MaxClipAmmo) == 0x0003C4, "Member 'ADFBaseAmmoClip::MaxClipAmmo' has a wrong offset!");

// Class DonkehFramework.DFNavigationSystem
// 0x0000 (0x0538 - 0x0538)
class UDFNavigationSystem : public UNavigationSystemV1
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFNavigationSystem">();
	}
	static class UDFNavigationSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFNavigationSystem>();
	}
};
static_assert(alignof(UDFNavigationSystem) == 0x000008, "Wrong alignment on UDFNavigationSystem");
static_assert(sizeof(UDFNavigationSystem) == 0x000538, "Wrong size on UDFNavigationSystem");

// Class DonkehFramework.DFBaseCharacter
// 0x0450 (0x0910 - 0x04C0)
#pragma pack(push, 0x1)
class alignas(0x10) ADFBaseCharacter : public ACharacter
{
public:
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         RemoteViewYaw;                                     // 0x04C0(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bClientResimulateSprintStamina : 1;                // 0x04C8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterAnimCollection               DefaultPawnAnimCollection;                         // 0x04D0(0x0128)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         bPlayFootstepFXWithPerspMeshOnly : 1;              // 0x05F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTickAllAnimationOnDedicatedServer : 1;            // 0x05F8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOnlyTickAnimMontagesOnDedicatedServer : 1;        // 0x05F8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterSoundCollection              DefaultPawnSoundCollection;                        // 0x0600(0x0010)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class ADFBaseItem*                            EquippedItem;                                      // 0x0610(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADFBaseItem*                            LastEquippedItem;                                  // 0x0618(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             OnEquippedItemChanged;                             // 0x0620(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FName                                   ItemAttachPoint;                                   // 0x0630(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFInventoryComponent*                  Inventory;                                         // 0x0638(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFLoadout*                             DefaultLoadout;                                    // 0x0640(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDFItemEnabledMode                            ItemEnabledMode;                                   // 0x0648(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_649[0x3];                                      // 0x0649(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ShotIDCounter;                                     // 0x064C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bAllowWeaponFireWhileCrawling : 1;                 // 0x0650(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDying : 1;                                        // 0x0650(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_651[0x7];                                      // 0x0651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnHealthChanged;                                   // 0x0658(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         Health;                                            // 0x0668(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_66C[0x14];                                     // 0x066C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RagdollLifeSpan;                                   // 0x0680(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCharacterDeath;                                  // 0x0688(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         MaxHealth;                                         // 0x0698(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTakeHitInfo                           LastTakeHitInfo;                                   // 0x06A0(0x0120)(Edit, Net, Transient, EditConst, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C0[0x8];                                      // 0x07C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      BoneDamageMultipliers;                             // 0x07C8(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         bApplyDamageMomentumOnHit : 1;                     // 0x0818(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_819[0x7];                                      // 0x0819(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSprintTransition;                                // 0x0820(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnAimTransition;                                   // 0x0830(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLeanTransition;                                  // 0x0840(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnVaultTransition;                                 // 0x0850(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	ECharacterStance                              ReplicatedStance;                                  // 0x0860(0x0001)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharacterStance                              PreviousStance;                                    // 0x0861(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPressedVault : 1;                                 // 0x0862(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSprinting : 1;                                    // 0x0862(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAiming : 1;                                       // 0x0862(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsProne : 1;                                      // 0x0862(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bVaulting : 1;                                     // 0x0862(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWasVaulting : 1;                                  // 0x0862(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_863[0x1];                                      // 0x0863(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDFVaultTraceResult                    PendingVaultTraceResult;                           // 0x0864(0x001C)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDFVaultTraceData                      VaultParams;                                       // 0x0880(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         ReplicatedLeanAmount;                              // 0x0898(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89C[0x4];                                      // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFCharacterLeanHandler*                LeanHandler;                                       // 0x08A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoClear, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDFCharacterMovementComponent*          DFCharacterMovement;                               // 0x08A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetEyeHeight;                                   // 0x08B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         BitPad_8B4_0 : 1;                                  // 0x08B4(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bInterpCrouchedEyeHeight : 1;                      // 0x08B4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_8B5[0x3];                                      // 0x08B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CrouchedTransitionInterpSpeed;                     // 0x08B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInterpProneEyeHeight : 1;                         // 0x08BC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_8BD[0x3];                                      // 0x08BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProneTransitionInterpSpeed;                        // 0x08C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProneEyeHeight;                                    // 0x08C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TeamNum;                                           // 0x08C8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C9[0x7];                                      // 0x08C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADFTeamState*                           TeamState;                                         // 0x08D0(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADFTeamState*                           PrevTeamState;                                     // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bAllowTeamIdOverride : 1;                          // 0x08E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_8E1[0x7];                                      // 0x08E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnPawnTeamNumUpdated;                              // 0x08E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPawnTeamStateUpdated;                            // 0x08F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void Aim(bool bClientSimulation);
	void AimToggle();
	void ClearCharacterAnimInstances(bool bPerspectiveMeshOnly);
	void ClientAdjustPosition_CustomStamina(float Timestamp, const struct FVector& NewLoc, const struct FVector& NewVel, class UPrimitiveComponent* NewBase, class FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, uint8 ServerMovementMode, float ServerSprintStamina);
	void ClientAdjustRootMotionPosition_CustomStamina(float Timestamp, float ServerMontageTrackPosition, const struct FVector& ServerLoc, const struct FVector_NetQuantizeNormal& ServerRotation, float ServerVelZ, class UPrimitiveComponent* ServerBase, class FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, uint8 ServerMovementMode, float ServerSprintStamina);
	void ClientAdjustRootMotionSourcePosition_CustomStamina(float Timestamp, const struct FRootMotionSourceGroup& ServerRootMotion, bool bHasAnimRootMotion, float ServerMontageTrackPosition, const struct FVector& ServerLoc, const struct FVector_NetQuantizeNormal& ServerRotation, float ServerVelZ, class UPrimitiveComponent* ServerBase, class FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, uint8 ServerMovementMode, float ServerSprintStamina);
	void ClientVeryShortAdjustPosition_CustomStamina(float Timestamp, const struct FVector& NewLoc, class UPrimitiveComponent* NewBase, class FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, uint8 ServerMovementMode, float ServerSprintStamina);
	void CrouchToggle();
	bool Die(float KillingDamage, const struct FDamageEvent& DamageEvent, class AController* Killer, class AActor* DamageCauser);
	void EquipItem(class ADFBaseItem* ItemToEquip);
	void EquipNextItem();
	void EquipNextItemByType(EItemType ItemType);
	void EquipPreviousItem();
	class ADFBaseItem* GetNextInventoryItem(bool bEquippable);
	class ADFBaseItem* GetPreviousInventoryItem(bool bEquippable);
	void GiveLoadout(class UDFLoadout* Loadout, bool bEquipFirstItem);
	void GoProne(bool bClientSimulation);
	void ItemEnabledModeChanged(EDFItemEnabledMode PreviousItemEnabledMode);
	void Lean(ELeanDirection DesiredLeanDir, bool bClientSimulation);
	void LeanToggle(ELeanDirection LeanDir);
	void LeaveProne(bool bClientSimulation);
	int32 NextShotID();
	void OnDeath(float KillingDamage, const struct FDamageEvent& DamageEvent, class APawn* InstigatingPawn, class AActor* DamageCauser);
	void OnRep_bAiming();
	void OnRep_bSprinting();
	void OnRep_EquippedItem(class ADFBaseItem* LastItem);
	void OnRep_Health(const float PreviousValue);
	void OnRep_IsProne();
	void OnRep_ItemEnabledMode(EDFItemEnabledMode PreviousItemEnabledMode);
	void OnRep_LastTakeHitInfo();
	void OnRep_ReplicatedLeanAmount(float LastReplicatedLeanAmount);
	void OnRep_ReplicatedStance();
	void OnRep_TeamNum(uint8 LastTeamNum);
	void OnRep_TeamState(class ADFTeamState* TeamStateBeforeUpdate);
	float PlayCharacterActionMontage(class UAnimMontage* ActionMontageToPlay);
	float PlayCharacterCockMontage(class UAnimMontage* CockMontageToPlay);
	float PlayCharacterDeathMontage(bool bDontPlayAndReturnDominantPlayLengthOnly);
	float PlayCharacterEndReloadMontage(class UAnimMontage* EndReloadMontageToPlay, bool bDryReload);
	float PlayCharacterEquipMontage(bool bDontPlayAndReturnDominantPlayLengthOnly);
	float PlayCharacterFireMontage(class UAnimMontage* FireMontageToPlay, bool bFireLast, bool bFireADS);
	float PlayCharacterMontage(class UAnimMontage* CharMontage, bool bForceDisableAutoBlendOut);
	float PlayCharacterPerspectiveAnimation(const struct FPerspectiveAnim& CharAnim, bool bForceDisableAutoBlendOut);
	float PlayCharacterReloadMontage(bool bDryReload);
	class UAudioComponent* PlayCharacterSound(const struct FPerspectiveSound& Sound);
	float PlayCharacterStartReloadMontage(class UAnimMontage* StartReloadMontageToPlay, bool bDryReload);
	float PlayCharacterThrowOverhandMontage(class UAnimMontage* ThrowOverhandMontageToPlay);
	float PlayCharacterThrowUnderhandMontage(class UAnimMontage* ThrowUnderhandMontageToPlay);
	float PlayCharacterUnEquipMontage(class UAnimMontage* UnEquipMontageToPlay);
	void ProneToggle();
	void ReceiveEquippedItemChanged(class ADFBaseItem* NewEquippedItem, class ADFBaseItem* PrevEquippedItem);
	void ReceiveHealthChanged(float NewHealthTotal, float PrevHealthTotal);
	void ReceiveOnEndAim();
	void ReceiveOnEndLean();
	void ReceiveOnEndProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
	void ReceiveOnEndSprint();
	void ReceiveOnEndVault();
	void ReceiveOnRepPlayerState();
	void ReceiveOnStartAim();
	void ReceiveOnStartLean();
	void ReceiveOnStartProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
	void ReceiveOnStartSprint();
	void ReceiveOnStartVault();
	void ReceivePawnTeamNumUpdated(uint8 LastTeamNum, uint8 NewTeamNum);
	void ReceivePawnTeamStateUpdated(class ADFTeamState* TeamStateBeforeUpdate, class ADFTeamState* NewTeamState, bool bNewTeamStateInit);
	void ReceivePlayHit(float DamageTaken, const struct FDamageEvent& DamageEvent, class APawn* PawnInstigator, class AActor* DamageCauser, bool bKilled);
	void ReceiveRestart();
	void Reload();
	void ServerDoVault(const struct FDFVaultTraceData& VaultStartParams);
	void ServerEquipItem(class ADFBaseItem* ItemToEquip);
	void ServerSuicide();
	void SetHealth(float InHealth);
	void SetItemEnabledMode(EDFItemEnabledMode ItemMode);
	void SetRagdollPhysics();
	void SpawnHitImpactFX(float DamageTaken, const struct FDamageEvent& DamageEvent, class APawn* PawnInstigator, class AActor* DamageCauser);
	void Sprint(bool bClientSimulation);
	void SprintToggle();
	void StartFire();
	void StopAllAnimMontages(bool bPerspectiveMeshOnly);
	void StopCharacterMontage(class UAnimMontage* CharMontage);
	void StopCharacterPerspectiveAnimation(const struct FPerspectiveAnim& CharAnim);
	void StopFire();
	void StopVaulting();
	void Suicide();
	void UnAim(bool bClientSimulation);
	void UnLean(ELeanDirection UnDesiredLeanDir, bool bClientSimulation);
	void UnSprint(bool bClientSimulation);
	void Vault();

	bool AllowsWeaponFire() const;
	bool CanAim() const;
	bool CanDie(float KillingDamage, const struct FDamageEvent& DamageEvent, class AController* Killer, class AActor* DamageCauser) const;
	bool CanGoProne() const;
	bool CanLean(ELeanDirection DesiredLeanDir) const;
	bool CanSprint() const;
	bool CanVault() const;
	struct FRotator GetAimOffsets() const;
	class UAnimSequenceBase* GetAnimToUseFromPerspectiveAnimPair(const struct FPerspectiveAnim& AnimationPair) const;
	EVisibilityBasedAnimTickOption GetCharacterAnimTickOptionToUse(bool bVisibleMesh) const;
	bool GetCharacterDeathMontageToUse(class UAnimMontage** OutCharDeathMontage) const;
	class USkeletalMeshComponent* GetCharacterMeshToUse(bool bIgnoreLocalControlOnServer) const;
	bool GetDamageMultiplierByBoneName(const class FName& BoneName, float* DamageMultiplier) const;
	class ADFBaseItem* GetEquippedItem() const;
	class UDFInventoryComponent* GetInventory() const;
	class FName GetItemAttachPoint() const;
	EDFItemEnabledMode GetItemEnabledMode() const;
	class UAnimMontage* GetMontageToUseFromPerspectiveAnimPair(const struct FPerspectiveAnim& AnimationPair) const;
	class ADFBaseItem* GetRelevantEquippedItem() const;
	bool IsAlive() const;
	bool IsEquipped() const;
	bool IsFiring() const;
	bool IsLeaning() const;
	bool IsPerspectiveMesh(const class USkeletalMeshComponent* MeshCompToCheck) const;
	bool IsPlayer() const;
	bool IsPrefiring() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DFBaseCharacter">();
	}
	static class ADFBaseCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADFBaseCharacter>();
	}
};
#pragma pack(pop)
static_assert(alignof(ADFBaseCharacter) == 0x000010, "Wrong alignment on ADFBaseCharacter");
static_assert(sizeof(ADFBaseCharacter) == 0x000910, "Wrong size on ADFBaseCharacter");
static_assert(offsetof(ADFBaseCharacter, RemoteViewYaw) == 0x0004C0, "Member 'ADFBaseCharacter::RemoteViewYaw' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, DefaultPawnAnimCollection) == 0x0004D0, "Member 'ADFBaseCharacter::DefaultPawnAnimCollection' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, DefaultPawnSoundCollection) == 0x000600, "Member 'ADFBaseCharacter::DefaultPawnSoundCollection' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, EquippedItem) == 0x000610, "Member 'ADFBaseCharacter::EquippedItem' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, LastEquippedItem) == 0x000618, "Member 'ADFBaseCharacter::LastEquippedItem' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, OnEquippedItemChanged) == 0x000620, "Member 'ADFBaseCharacter::OnEquippedItemChanged' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, ItemAttachPoint) == 0x000630, "Member 'ADFBaseCharacter::ItemAttachPoint' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, Inventory) == 0x000638, "Member 'ADFBaseCharacter::Inventory' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, DefaultLoadout) == 0x000640, "Member 'ADFBaseCharacter::DefaultLoadout' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, ItemEnabledMode) == 0x000648, "Member 'ADFBaseCharacter::ItemEnabledMode' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, ShotIDCounter) == 0x00064C, "Member 'ADFBaseCharacter::ShotIDCounter' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, OnHealthChanged) == 0x000658, "Member 'ADFBaseCharacter::OnHealthChanged' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, Health) == 0x000668, "Member 'ADFBaseCharacter::Health' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, RagdollLifeSpan) == 0x000680, "Member 'ADFBaseCharacter::RagdollLifeSpan' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, OnCharacterDeath) == 0x000688, "Member 'ADFBaseCharacter::OnCharacterDeath' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, MaxHealth) == 0x000698, "Member 'ADFBaseCharacter::MaxHealth' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, LastTakeHitInfo) == 0x0006A0, "Member 'ADFBaseCharacter::LastTakeHitInfo' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, BoneDamageMultipliers) == 0x0007C8, "Member 'ADFBaseCharacter::BoneDamageMultipliers' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, OnSprintTransition) == 0x000820, "Member 'ADFBaseCharacter::OnSprintTransition' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, OnAimTransition) == 0x000830, "Member 'ADFBaseCharacter::OnAimTransition' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, OnLeanTransition) == 0x000840, "Member 'ADFBaseCharacter::OnLeanTransition' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, OnVaultTransition) == 0x000850, "Member 'ADFBaseCharacter::OnVaultTransition' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, ReplicatedStance) == 0x000860, "Member 'ADFBaseCharacter::ReplicatedStance' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, PreviousStance) == 0x000861, "Member 'ADFBaseCharacter::PreviousStance' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, PendingVaultTraceResult) == 0x000864, "Member 'ADFBaseCharacter::PendingVaultTraceResult' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, VaultParams) == 0x000880, "Member 'ADFBaseCharacter::VaultParams' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, ReplicatedLeanAmount) == 0x000898, "Member 'ADFBaseCharacter::ReplicatedLeanAmount' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, LeanHandler) == 0x0008A0, "Member 'ADFBaseCharacter::LeanHandler' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, DFCharacterMovement) == 0x0008A8, "Member 'ADFBaseCharacter::DFCharacterMovement' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, TargetEyeHeight) == 0x0008B0, "Member 'ADFBaseCharacter::TargetEyeHeight' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, CrouchedTransitionInterpSpeed) == 0x0008B8, "Member 'ADFBaseCharacter::CrouchedTransitionInterpSpeed' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, ProneTransitionInterpSpeed) == 0x0008C0, "Member 'ADFBaseCharacter::ProneTransitionInterpSpeed' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, ProneEyeHeight) == 0x0008C4, "Member 'ADFBaseCharacter::ProneEyeHeight' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, TeamNum) == 0x0008C8, "Member 'ADFBaseCharacter::TeamNum' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, TeamState) == 0x0008D0, "Member 'ADFBaseCharacter::TeamState' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, PrevTeamState) == 0x0008D8, "Member 'ADFBaseCharacter::PrevTeamState' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, OnPawnTeamNumUpdated) == 0x0008E8, "Member 'ADFBaseCharacter::OnPawnTeamNumUpdated' has a wrong offset!");
static_assert(offsetof(ADFBaseCharacter, OnPawnTeamStateUpdated) == 0x0008F8, "Member 'ADFBaseCharacter::OnPawnTeamStateUpdated' has a wrong offset!");

// Class DonkehFramework.DFBaseGameMode
// 0x0110 (0x0418 - 0x0308)
class ADFBaseGameMode : public AGameMode
{
public:
	class ADFGameSession*                         DFGameSession;                                     // 0x0308(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_310[0x8];                                      // 0x0310(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ADFTeamState>               TeamStateClass;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AAIController>              AIControllerClass;                                 // 0x0320(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<uint8>                                 WinningTeams;                                      // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           TimerHandle_DefaultTimer;                          // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         WarmupTime;                                        // 0x0340(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RoundTimeLimit;                                    // 0x0344(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RoundScoreLimit;                                   // 0x0348(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TimeBetweenMatches;                                // 0x034C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bBalanceTeams : 1;                                 // 0x0350(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BalanceTimerInterval;                              // 0x0354(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         AutoAssignHumanTeam;                               // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bBotAutofill : 1;                                  // 0x0359(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, Config, GlobalConfig, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   GameDisplayName;                                   // 0x0360(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         NumTeams;                                          // 0x0378(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAllowUnassignedTeams : 1;                         // 0x037C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowPlayerNameChanges : 1;                       // 0x037C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowPlayerNameChangesUnderNullOSS : 1;           // 0x037C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowPlayerNameChangesUnderSteamOSS : 1;          // 0x037C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
