#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DonkehFramework

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum DonkehFramework.EFireMode
// NumValues: 0x0004
enum class EFireMode : uint8
{
	Semi                                     = 0,
	Auto                                     = 1,
	Burst                                    = 2,
	EFireMode_MAX                            = 3,
};

// Enum DonkehFramework.EDFVoteStatus
// NumValues: 0x0006
enum class EDFVoteStatus : uint8
{
	Inactive                                 = 0,
	InProgress                               = 1,
	Passed                                   = 2,
	FailedNotEnoughVotes                     = 3,
	FailedInsufficientVoteRatio              = 4,
	EDFVoteStatus_MAX                        = 5,
};

// Enum DonkehFramework.EDFPlayerWhitelistType
// NumValues: 0x0004
enum class EDFPlayerWhitelistType : uint8
{
	None                                     = 0,
	Manual                                   = 1,
	Token                                    = 2,
	EDFPlayerWhitelistType_MAX               = 3,
};

// Enum DonkehFramework.EDFItemEnabledMode
// NumValues: 0x0004
enum class EDFItemEnabledMode : uint8
{
	Enabled                                  = 0,
	Disabled                                 = 1,
	Hidden                                   = 2,
	EDFItemEnabledMode_MAX                   = 3,
};

// Enum DonkehFramework.ESessionSearchPresenceType
// NumValues: 0x0004
enum class ESessionSearchPresenceType : uint8
{
	AllServers                               = 0,
	ListenServersOnly                        = 1,
	DedicatedServersOnly                     = 2,
	ESessionSearchPresenceType_MAX           = 3,
};

// Enum DonkehFramework.ECharacterStance
// NumValues: 0x0006
enum class ECharacterStance : uint8
{
	None                                     = 0,
	Stand                                    = 1,
	Crouch                                   = 2,
	Prone                                    = 3,
	Custom                                   = 4,
	ECharacterStance_MAX                     = 5,
};

// Enum DonkehFramework.EDFCharacterCustomMovementMode
// NumValues: 0x0003
enum class EDFCharacterCustomMovementMode : uint8
{
	None                                     = 0,
	Vaulting                                 = 1,
	MAX                                      = 2,
};

// Enum DonkehFramework.EPlayerVoiceState
// NumValues: 0x0004
enum class EPlayerVoiceState : uint8
{
	NotTalking                               = 0,
	Talking                                  = 1,
	Muted                                    = 2,
	EPlayerVoiceState_MAX                    = 3,
};

// Enum DonkehFramework.EPlayerKind
// NumValues: 0x0004
enum class EPlayerKind : uint8
{
	Human                                    = 0,
	Bot                                      = 1,
	Either                                   = 2,
	EPlayerKind_MAX                          = 3,
};

// Enum DonkehFramework.ELogVerbosityBP
// NumValues: 0x0006
enum class ELogVerbosityBP : uint8
{
	Error                                    = 2,
	Warning                                  = 3,
	Log                                      = 5,
	Verbose                                  = 6,
	VeryVerbose                              = 7,
	MAX                                      = 0,
};

// Enum DonkehFramework.EGunReloadState
// NumValues: 0x0008
enum class EGunReloadState : uint8
{
	NotReloading                             = 0,
	PartialReloadStart                       = 1,
	FullReloadStart                          = 2,
	PartialReload                            = 3,
	FullReload                               = 4,
	PartialReloadEnd                         = 5,
	FullReloadEnd                            = 6,
	EGunReloadState_MAX                      = 7,
};

// Enum DonkehFramework.EAmmoClipReloadBehavior
// NumValues: 0x0004
enum class EAmmoClipReloadBehavior : uint8
{
	DiscardOnEmpty                           = 0,
	DiscardOnReload                          = 1,
	NoDiscard                                = 2,
	EAmmoClipReloadBehavior_MAX              = 3,
};

// Enum DonkehFramework.ECardinalDirection
// NumValues: 0x0005
enum class ECardinalDirection : uint8
{
	North                                    = 0,
	South                                    = 1,
	East                                     = 2,
	West                                     = 3,
	ECardinalDirection_MAX                   = 4,
};

// Enum DonkehFramework.EVaultBehavior
// NumValues: 0x0006
enum class EVaultBehavior : uint8
{
	None                                     = 0,
	VaultOver                                = 1,
	SprintVaultOver                          = 2,
	ClimbOnto                                = 3,
	SprintClimbOnto                          = 4,
	EVaultBehavior_MAX                       = 5,
};

// Enum DonkehFramework.ELeanDirection
// NumValues: 0x0004
enum class ELeanDirection : uint8
{
	None                                     = 0,
	Left                                     = 1,
	Right                                    = 2,
	ELeanDirection_MAX                       = 3,
};

// Enum DonkehFramework.ESpecificItemType
// NumValues: 0x001D
enum class ESpecificItemType : uint8
{
	None                                     = 0,
	Rifle                                    = 10,
	MachineGun                               = 11,
	GrenadeLauncher                          = 12,
	RocketLauncher                           = 13,
	SniperRifle                              = 14,
	SubmachineGun                            = 30,
	Pistol                                   = 31,
	FragGrenade                              = 50,
	SmokeGrenade                             = 51,
	Melee                                    = 80,
	Bandage                                  = 110,
	AmmoBag                                  = 120,
	MedicBag                                 = 121,
	Binoculars                               = 150,
	Radio                                    = 151,
	Shovel                                   = 152,
	SpecialItem1                             = 210,
	SpecialItem2                             = 211,
	SpecialItem3                             = 212,
	SpecialItem4                             = 212,
	SpecialItem5                             = 212,
	CustomItem1                              = 220,
	CustomItem2                              = 221,
	CustomItem3                              = 222,
	CustomItem4                              = 223,
	CustomItem5                              = 224,
	Undefined                                = 255,
	ESpecificItemType_MAX                    = 256,
};

// Enum DonkehFramework.EItemType
// NumValues: 0x0007
enum class EItemType : uint8
{
	Melee                                    = 0,
	Other                                    = 1,
	Pistol                                   = 2,
	Throwable                                = 3,
	Rifle                                    = 4,
	Equipment                                = 5,
	EItemType_MAX                            = 6,
};

// Enum DonkehFramework.EDFVotingChannel
// NumValues: 0x0002
enum class EDFVotingChannel : uint8
{
	All                                      = 0,
	EDFVotingChannel_MAX                     = 1,
};

// ScriptStruct DonkehFramework.DFPlayerVoteSelection
// 0x0008 (0x0008 - 0x0000)
struct FDFPlayerVoteSelection final
{
public:
	int32                                         SelectionIdx;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VoteCount;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDFPlayerVoteSelection) == 0x000004, "Wrong alignment on FDFPlayerVoteSelection");
static_assert(sizeof(FDFPlayerVoteSelection) == 0x000008, "Wrong size on FDFPlayerVoteSelection");
static_assert(offsetof(FDFPlayerVoteSelection, SelectionIdx) == 0x000000, "Member 'FDFPlayerVoteSelection::SelectionIdx' has a wrong offset!");
static_assert(offsetof(FDFPlayerVoteSelection, VoteCount) == 0x000004, "Member 'FDFPlayerVoteSelection::VoteCount' has a wrong offset!");

// ScriptStruct DonkehFramework.DFVoteIssueDefinition
// 0x0010 (0x0010 - 0x0000)
struct FDFVoteIssueDefinition final
{
public:
	TSubclassOf<class UDFVoteIssue>               IssueClass;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOnlyAdminsCanInitiateVote : 1;                    // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowAdminTargets : 1;                            // 0x0008(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDFVoteIssueDefinition) == 0x000008, "Wrong alignment on FDFVoteIssueDefinition");
static_assert(sizeof(FDFVoteIssueDefinition) == 0x000010, "Wrong size on FDFVoteIssueDefinition");
static_assert(offsetof(FDFVoteIssueDefinition, IssueClass) == 0x000000, "Member 'FDFVoteIssueDefinition::IssueClass' has a wrong offset!");

// ScriptStruct DonkehFramework.DFVoteIssueContext
// 0x0018 (0x0018 - 0x0000)
struct FDFVoteIssueContext final
{
public:
	class APlayerState*                           TargetPlayer;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDFVoteIssueContext) == 0x000008, "Wrong alignment on FDFVoteIssueContext");
static_assert(sizeof(FDFVoteIssueContext) == 0x000018, "Wrong size on FDFVoteIssueContext");
static_assert(offsetof(FDFVoteIssueContext, TargetPlayer) == 0x000000, "Member 'FDFVoteIssueContext::TargetPlayer' has a wrong offset!");

// ScriptStruct DonkehFramework.DFGenericObject
// 0x001C (0x0028 - 0x000C)
struct FDFGenericObject final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Object;                                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bPendingRemoval : 1;                               // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPredictivelyRemoved : 1;                          // 0x0020(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDFGenericObject) == 0x000008, "Wrong alignment on FDFGenericObject");
static_assert(sizeof(FDFGenericObject) == 0x000028, "Wrong size on FDFGenericObject");
static_assert(offsetof(FDFGenericObject, Object) == 0x000010, "Member 'FDFGenericObject::Object' has a wrong offset!");

// ScriptStruct DonkehFramework.DFGenericObjectContainer
// 0x0078 (0x0180 - 0x0108)
struct FDFGenericObjectContainer final : public FFastArraySerializer
{
public:
	TArray<struct FDFGenericObject>               GenericObjects;                                    // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 RequiredClass;                                     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_128[0x58];                                     // 0x0128(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDFGenericObjectContainer) == 0x000008, "Wrong alignment on FDFGenericObjectContainer");
static_assert(sizeof(FDFGenericObjectContainer) == 0x000180, "Wrong size on FDFGenericObjectContainer");
static_assert(offsetof(FDFGenericObjectContainer, GenericObjects) == 0x000108, "Member 'FDFGenericObjectContainer::GenericObjects' has a wrong offset!");
static_assert(offsetof(FDFGenericObjectContainer, RequiredClass) == 0x000120, "Member 'FDFGenericObjectContainer::RequiredClass' has a wrong offset!");

// ScriptStruct DonkehFramework.DFActiveVoteInfo
// 0x0048 (0x0048 - 0x0000)
struct FDFActiveVoteInfo final
{
public:
	TSubclassOf<class UDFVoteIssue>               IssueClass;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDFVoteIssueContext                    IssueContext;                                      // 0x0008(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	float                                         VoteEndTime;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           OwningPlayer;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDFVoteStatus                                 Status;                                            // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDFPlayerVoteSelection>         Votes;                                             // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDFActiveVoteInfo) == 0x000008, "Wrong alignment on FDFActiveVoteInfo");
static_assert(sizeof(FDFActiveVoteInfo) == 0x000048, "Wrong size on FDFActiveVoteInfo");
static_assert(offsetof(FDFActiveVoteInfo, IssueClass) == 0x000000, "Member 'FDFActiveVoteInfo::IssueClass' has a wrong offset!");
static_assert(offsetof(FDFActiveVoteInfo, IssueContext) == 0x000008, "Member 'FDFActiveVoteInfo::IssueContext' has a wrong offset!");
static_assert(offsetof(FDFActiveVoteInfo, VoteEndTime) == 0x000020, "Member 'FDFActiveVoteInfo::VoteEndTime' has a wrong offset!");
static_assert(offsetof(FDFActiveVoteInfo, OwningPlayer) == 0x000028, "Member 'FDFActiveVoteInfo::OwningPlayer' has a wrong offset!");
static_assert(offsetof(FDFActiveVoteInfo, Status) == 0x000030, "Member 'FDFActiveVoteInfo::Status' has a wrong offset!");
static_assert(offsetof(FDFActiveVoteInfo, Votes) == 0x000038, "Member 'FDFActiveVoteInfo::Votes' has a wrong offset!");

// ScriptStruct DonkehFramework.DFPropertyAssetBundles
// 0x0001 (0x0001 - 0x0000)
struct FDFPropertyAssetBundles final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDFPropertyAssetBundles) == 0x000001, "Wrong alignment on FDFPropertyAssetBundles");
static_assert(sizeof(FDFPropertyAssetBundles) == 0x000001, "Wrong size on FDFPropertyAssetBundles");

// ScriptStruct DonkehFramework.DFVaultTargetParams
// 0x0010 (0x0010 - 0x0000)
struct FDFVaultTargetParams final
{
public:
	EVaultBehavior                                DesiredBehavior;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantize10                  Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDFVaultTargetParams) == 0x000004, "Wrong alignment on FDFVaultTargetParams");
static_assert(sizeof(FDFVaultTargetParams) == 0x000010, "Wrong size on FDFVaultTargetParams");
static_assert(offsetof(FDFVaultTargetParams, DesiredBehavior) == 0x000000, "Member 'FDFVaultTargetParams::DesiredBehavior' has a wrong offset!");
static_assert(offsetof(FDFVaultTargetParams, Location) == 0x000004, "Member 'FDFVaultTargetParams::Location' has a wrong offset!");

// ScriptStruct DonkehFramework.DFVaultTraceData
// 0x0018 (0x0018 - 0x0000)
struct FDFVaultTraceData
{
public:
	struct FDFVaultTargetParams                   TargetParams;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	EVaultBehavior                                Behavior;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Height;                                            // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDFVaultTraceData) == 0x000004, "Wrong alignment on FDFVaultTraceData");
static_assert(sizeof(FDFVaultTraceData) == 0x000018, "Wrong size on FDFVaultTraceData");
static_assert(offsetof(FDFVaultTraceData, TargetParams) == 0x000000, "Member 'FDFVaultTraceData::TargetParams' has a wrong offset!");
static_assert(offsetof(FDFVaultTraceData, Behavior) == 0x000010, "Member 'FDFVaultTraceData::Behavior' has a wrong offset!");
static_assert(offsetof(FDFVaultTraceData, Height) == 0x000014, "Member 'FDFVaultTraceData::Height' has a wrong offset!");

// ScriptStruct DonkehFramework.DFVaultTraceResult
// 0x0004 (0x001C - 0x0018)
struct FDFVaultTraceResult final : public FDFVaultTraceData
{
public:
	bool                                          bSuccess;                                          // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDFVaultTraceResult) == 0x000004, "Wrong alignment on FDFVaultTraceResult");
static_assert(sizeof(FDFVaultTraceResult) == 0x00001C, "Wrong size on FDFVaultTraceResult");
static_assert(offsetof(FDFVaultTraceResult, bSuccess) == 0x000018, "Member 'FDFVaultTraceResult::bSuccess' has a wrong offset!");

// ScriptStruct DonkehFramework.SpawnPointDef
// 0x0050 (0x0050 - 0x0000)
struct FSpawnPointDef final
{
public:
	int32                                         SpawnID;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnTransform;                                    // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                SpawnContextObject;                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSpawnPointDef) == 0x000010, "Wrong alignment on FSpawnPointDef");
static_assert(sizeof(FSpawnPointDef) == 0x000050, "Wrong size on FSpawnPointDef");
static_assert(offsetof(FSpawnPointDef, SpawnID) == 0x000000, "Member 'FSpawnPointDef::SpawnID' has a wrong offset!");
static_assert(offsetof(FSpawnPointDef, SpawnTransform) == 0x000010, "Member 'FSpawnPointDef::SpawnTransform' has a wrong offset!");
static_assert(offsetof(FSpawnPointDef, SpawnContextObject) == 0x000040, "Member 'FSpawnPointDef::SpawnContextObject' has a wrong offset!");

// ScriptStruct DonkehFramework.PlayerChatMsg
// 0x0030 (0x0030 - 0x0000)
struct FPlayerChatMsg final
{
public:
	class APlayerState*                           SenderPS;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SenderName;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         MsgTeamId;                                         // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MsgContent;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPlayerChatMsg) == 0x000008, "Wrong alignment on FPlayerChatMsg");
static_assert(sizeof(FPlayerChatMsg) == 0x000030, "Wrong size on FPlayerChatMsg");
static_assert(offsetof(FPlayerChatMsg, SenderPS) == 0x000000, "Member 'FPlayerChatMsg::SenderPS' has a wrong offset!");
static_assert(offsetof(FPlayerChatMsg, SenderName) == 0x000008, "Member 'FPlayerChatMsg::SenderName' has a wrong offset!");
static_assert(offsetof(FPlayerChatMsg, MsgTeamId) == 0x000018, "Member 'FPlayerChatMsg::MsgTeamId' has a wrong offset!");
static_assert(offsetof(FPlayerChatMsg, MsgContent) == 0x000020, "Member 'FPlayerChatMsg::MsgContent' has a wrong offset!");

// ScriptStruct DonkehFramework.AssetDescriptor
// 0x0020 (0x0020 - 0x0000)
struct FAssetDescriptor final
{
public:
	class FName                                   AssetName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayText;                                       // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAssetDescriptor) == 0x000008, "Wrong alignment on FAssetDescriptor");
static_assert(sizeof(FAssetDescriptor) == 0x000020, "Wrong size on FAssetDescriptor");
static_assert(offsetof(FAssetDescriptor, AssetName) == 0x000000, "Member 'FAssetDescriptor::AssetName' has a wrong offset!");
static_assert(offsetof(FAssetDescriptor, DisplayText) == 0x000008, "Member 'FAssetDescriptor::DisplayText' has a wrong offset!");

// ScriptStruct DonkehFramework.DFCharacterVariationDataHandle
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FDFCharacterVariationDataHandle final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDFCharacterVariationDataHandle) == 0x000008, "Wrong alignment on FDFCharacterVariationDataHandle");
static_assert(sizeof(FDFCharacterVariationDataHandle) == 0x000018, "Wrong size on FDFCharacterVariationDataHandle");

// ScriptStruct DonkehFramework.DFCharacterVariationDataSource
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FDFCharacterVariationDataSource
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDFCharacterVariationDataSource) == 0x000008, "Wrong alignment on FDFCharacterVariationDataSource");
static_assert(sizeof(FDFCharacterVariationDataSource) == 0x000008, "Wrong size on FDFCharacterVariationDataSource");

// ScriptStruct DonkehFramework.DFCharacterVariationDataSource_TableRow
// 0x0018 (0x0020 - 0x0008)
struct FDFCharacterVariationDataSource_TableRow final : public FDFCharacterVariationDataSource
{
public:
	struct FDataTableRowHandle                    RowHandle;                                         // 0x0008(0x0010)(NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bValidRowHandle;                                   // 0x0018(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDFCharacterVariationDataSource_TableRow) == 0x000008, "Wrong alignment on FDFCharacterVariationDataSource_TableRow");
static_assert(sizeof(FDFCharacterVariationDataSource_TableRow) == 0x000020, "Wrong size on FDFCharacterVariationDataSource_TableRow");
static_assert(offsetof(FDFCharacterVariationDataSource_TableRow, RowHandle) == 0x000008, "Member 'FDFCharacterVariationDataSource_TableRow::RowHandle' has a wrong offset!");
static_assert(offsetof(FDFCharacterVariationDataSource_TableRow, bValidRowHandle) == 0x000018, "Member 'FDFCharacterVariationDataSource_TableRow::bValidRowHandle' has a wrong offset!");

// ScriptStruct DonkehFramework.DFCharacterVariation
// 0x0030 (0x0030 - 0x0000)
struct FDFCharacterVariation final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           Mesh;                                              // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDFCharacterVariation) == 0x000008, "Wrong alignment on FDFCharacterVariation");
static_assert(sizeof(FDFCharacterVariation) == 0x000030, "Wrong size on FDFCharacterVariation");
static_assert(offsetof(FDFCharacterVariation, Mesh) == 0x000008, "Member 'FDFCharacterVariation::Mesh' has a wrong offset!");

// ScriptStruct DonkehFramework.DFCharacterVariationData
// 0x0060 (0x0068 - 0x0008)
struct FDFCharacterVariationData : public FTableRowBase
{
public:
	struct FDFCharacterVariation                  Variation;                                         // 0x0008(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFCharacterVariation                  VariationFPP;                                      // 0x0038(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDFCharacterVariationData) == 0x000008, "Wrong alignment on FDFCharacterVariationData");
static_assert(sizeof(FDFCharacterVariationData) == 0x000068, "Wrong size on FDFCharacterVariationData");
static_assert(offsetof(FDFCharacterVariationData, Variation) == 0x000008, "Member 'FDFCharacterVariationData::Variation' has a wrong offset!");
static_assert(offsetof(FDFCharacterVariationData, VariationFPP) == 0x000038, "Member 'FDFCharacterVariationData::VariationFPP' has a wrong offset!");

// ScriptStruct DonkehFramework.PerspectiveSound
// 0x0010 (0x0010 - 0x0000)
struct FPerspectiveSound final
{
public:
	class USoundBase*                             Sound1P;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             Sound3P;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPerspectiveSound) == 0x000008, "Wrong alignment on FPerspectiveSound");
static_assert(sizeof(FPerspectiveSound) == 0x000010, "Wrong size on FPerspectiveSound");
static_assert(offsetof(FPerspectiveSound, Sound1P) == 0x000000, "Member 'FPerspectiveSound::Sound1P' has a wrong offset!");
static_assert(offsetof(FPerspectiveSound, Sound3P) == 0x000008, "Member 'FPerspectiveSound::Sound3P' has a wrong offset!");

// ScriptStruct DonkehFramework.WeaponSoundCollection
// 0x0080 (0x0080 - 0x0000)
struct FWeaponSoundCollection final
{
public:
	struct FPerspectiveSound                      EquipSound;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveSound                      UnEquipSound;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveSound                      FireSound;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveSound                      FireLastSound;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveSound                      DryFireSound;                                      // 0x0040(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveSound                      ReloadSound;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveSound                      ReloadFullSound;                                   // 0x0060(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveSound                      FireModeSound;                                     // 0x0070(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWeaponSoundCollection) == 0x000008, "Wrong alignment on FWeaponSoundCollection");
static_assert(sizeof(FWeaponSoundCollection) == 0x000080, "Wrong size on FWeaponSoundCollection");
static_assert(offsetof(FWeaponSoundCollection, EquipSound) == 0x000000, "Member 'FWeaponSoundCollection::EquipSound' has a wrong offset!");
static_assert(offsetof(FWeaponSoundCollection, UnEquipSound) == 0x000010, "Member 'FWeaponSoundCollection::UnEquipSound' has a wrong offset!");
static_assert(offsetof(FWeaponSoundCollection, FireSound) == 0x000020, "Member 'FWeaponSoundCollection::FireSound' has a wrong offset!");
static_assert(offsetof(FWeaponSoundCollection, FireLastSound) == 0x000030, "Member 'FWeaponSoundCollection::FireLastSound' has a wrong offset!");
static_assert(offsetof(FWeaponSoundCollection, DryFireSound) == 0x000040, "Member 'FWeaponSoundCollection::DryFireSound' has a wrong offset!");
static_assert(offsetof(FWeaponSoundCollection, ReloadSound) == 0x000050, "Member 'FWeaponSoundCollection::ReloadSound' has a wrong offset!");
static_assert(offsetof(FWeaponSoundCollection, ReloadFullSound) == 0x000060, "Member 'FWeaponSoundCollection::ReloadFullSound' has a wrong offset!");
static_assert(offsetof(FWeaponSoundCollection, FireModeSound) == 0x000070, "Member 'FWeaponSoundCollection::FireModeSound' has a wrong offset!");

// ScriptStruct DonkehFramework.CharacterSoundCollection
// 0x0010 (0x0010 - 0x0000)
struct FCharacterSoundCollection final
{
public:
	struct FPerspectiveSound                      DeathSound;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCharacterSoundCollection) == 0x000008, "Wrong alignment on FCharacterSoundCollection");
static_assert(sizeof(FCharacterSoundCollection) == 0x000010, "Wrong size on FCharacterSoundCollection");
static_assert(offsetof(FCharacterSoundCollection, DeathSound) == 0x000000, "Member 'FCharacterSoundCollection::DeathSound' has a wrong offset!");

// ScriptStruct DonkehFramework.IntrinsicWeaponAnimSubset
// 0x0028 (0x0028 - 0x0000)
struct FIntrinsicWeaponAnimSubset final
{
public:
	class UAnimMontage*                           Equip;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           UnEquip;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Fire;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Reload;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           ReloadEmpty;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FIntrinsicWeaponAnimSubset) == 0x000008, "Wrong alignment on FIntrinsicWeaponAnimSubset");
static_assert(sizeof(FIntrinsicWeaponAnimSubset) == 0x000028, "Wrong size on FIntrinsicWeaponAnimSubset");
static_assert(offsetof(FIntrinsicWeaponAnimSubset, Equip) == 0x000000, "Member 'FIntrinsicWeaponAnimSubset::Equip' has a wrong offset!");
static_assert(offsetof(FIntrinsicWeaponAnimSubset, UnEquip) == 0x000008, "Member 'FIntrinsicWeaponAnimSubset::UnEquip' has a wrong offset!");
static_assert(offsetof(FIntrinsicWeaponAnimSubset, Fire) == 0x000010, "Member 'FIntrinsicWeaponAnimSubset::Fire' has a wrong offset!");
static_assert(offsetof(FIntrinsicWeaponAnimSubset, Reload) == 0x000018, "Member 'FIntrinsicWeaponAnimSubset::Reload' has a wrong offset!");
static_assert(offsetof(FIntrinsicWeaponAnimSubset, ReloadEmpty) == 0x000020, "Member 'FIntrinsicWeaponAnimSubset::ReloadEmpty' has a wrong offset!");

// ScriptStruct DonkehFramework.LocomotionWeaponAnimSubset
// 0x0018 (0x0018 - 0x0000)
struct FLocomotionWeaponAnimSubset final
{
public:
	class UAnimSequence*                          Idle;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          Move;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          Sprint;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLocomotionWeaponAnimSubset) == 0x000008, "Wrong alignment on FLocomotionWeaponAnimSubset");
static_assert(sizeof(FLocomotionWeaponAnimSubset) == 0x000018, "Wrong size on FLocomotionWeaponAnimSubset");
static_assert(offsetof(FLocomotionWeaponAnimSubset, Idle) == 0x000000, "Member 'FLocomotionWeaponAnimSubset::Idle' has a wrong offset!");
static_assert(offsetof(FLocomotionWeaponAnimSubset, Move) == 0x000008, "Member 'FLocomotionWeaponAnimSubset::Move' has a wrong offset!");
static_assert(offsetof(FLocomotionWeaponAnimSubset, Sprint) == 0x000010, "Member 'FLocomotionWeaponAnimSubset::Sprint' has a wrong offset!");

// ScriptStruct DonkehFramework.SingleActionWeaponAnimSubset
// 0x0008 (0x0008 - 0x0000)
struct FSingleActionWeaponAnimSubset final
{
public:
	class UAnimMontage*                           Action;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSingleActionWeaponAnimSubset) == 0x000008, "Wrong alignment on FSingleActionWeaponAnimSubset");
static_assert(sizeof(FSingleActionWeaponAnimSubset) == 0x000008, "Wrong size on FSingleActionWeaponAnimSubset");
static_assert(offsetof(FSingleActionWeaponAnimSubset, Action) == 0x000000, "Member 'FSingleActionWeaponAnimSubset::Action' has a wrong offset!");

// ScriptStruct DonkehFramework.SingleLoadWeaponAnimSubset
// 0x0010 (0x0010 - 0x0000)
struct FSingleLoadWeaponAnimSubset final
{
public:
	class UAnimMontage*                           StartReload;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           EndReload;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSingleLoadWeaponAnimSubset) == 0x000008, "Wrong alignment on FSingleLoadWeaponAnimSubset");
static_assert(sizeof(FSingleLoadWeaponAnimSubset) == 0x000010, "Wrong size on FSingleLoadWeaponAnimSubset");
static_assert(offsetof(FSingleLoadWeaponAnimSubset, StartReload) == 0x000000, "Member 'FSingleLoadWeaponAnimSubset::StartReload' has a wrong offset!");
static_assert(offsetof(FSingleLoadWeaponAnimSubset, EndReload) == 0x000008, "Member 'FSingleLoadWeaponAnimSubset::EndReload' has a wrong offset!");

// ScriptStruct DonkehFramework.ThrowableWeaponAnimSubset
// 0x0020 (0x0020 - 0x0000)
struct FThrowableWeaponAnimSubset final
{
public:
	class UAnimSequence*                          ReadyBasePose;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Cock;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           ThrowOverhand;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           ThrowUnderhand;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FThrowableWeaponAnimSubset) == 0x000008, "Wrong alignment on FThrowableWeaponAnimSubset");
static_assert(sizeof(FThrowableWeaponAnimSubset) == 0x000020, "Wrong size on FThrowableWeaponAnimSubset");
static_assert(offsetof(FThrowableWeaponAnimSubset, ReadyBasePose) == 0x000000, "Member 'FThrowableWeaponAnimSubset::ReadyBasePose' has a wrong offset!");
static_assert(offsetof(FThrowableWeaponAnimSubset, Cock) == 0x000008, "Member 'FThrowableWeaponAnimSubset::Cock' has a wrong offset!");
static_assert(offsetof(FThrowableWeaponAnimSubset, ThrowOverhand) == 0x000010, "Member 'FThrowableWeaponAnimSubset::ThrowOverhand' has a wrong offset!");
static_assert(offsetof(FThrowableWeaponAnimSubset, ThrowUnderhand) == 0x000018, "Member 'FThrowableWeaponAnimSubset::ThrowUnderhand' has a wrong offset!");

// ScriptStruct DonkehFramework.PerspectiveAnim
// 0x0010 (0x0010 - 0x0000)
struct FPerspectiveAnim final
{
public:
	class UAnimSequenceBase*                      Anim1P;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Anim3P;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPerspectiveAnim) == 0x000008, "Wrong alignment on FPerspectiveAnim");
static_assert(sizeof(FPerspectiveAnim) == 0x000010, "Wrong size on FPerspectiveAnim");
static_assert(offsetof(FPerspectiveAnim, Anim1P) == 0x000000, "Member 'FPerspectiveAnim::Anim1P' has a wrong offset!");
static_assert(offsetof(FPerspectiveAnim, Anim3P) == 0x000008, "Member 'FPerspectiveAnim::Anim3P' has a wrong offset!");

// ScriptStruct DonkehFramework.CharacterAnimCollection
// 0x0128 (0x0128 - 0x0000)
struct FCharacterAnimCollection final
{
public:
	class UAnimSequence*                          BasePose;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          BasePoseTPP;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          AimBasePose;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Death;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntrinsicWeaponAnimSubset             Intrinsic;                                         // 0x0020(0x0028)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FLocomotionWeaponAnimSubset            Locomotion;                                        // 0x0048(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSingleActionWeaponAnimSubset          SingleAction;                                      // 0x0060(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSingleLoadWeaponAnimSubset            SingleLoad;                                        // 0x0068(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FThrowableWeaponAnimSubset             Throwable;                                         // 0x0078(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       DeathAnim;                                         // 0x0098(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       EquipAnim;                                         // 0x00A8(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       UnEquipAnim;                                       // 0x00B8(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       FireAnim;                                          // 0x00C8(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       ActionAnim;                                        // 0x00D8(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       ReloadAnim;                                        // 0x00E8(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       ReloadFullAnim;                                    // 0x00F8(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       StartReloadAnim;                                   // 0x0108(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       EndReloadAnim;                                     // 0x0118(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCharacterAnimCollection) == 0x000008, "Wrong alignment on FCharacterAnimCollection");
static_assert(sizeof(FCharacterAnimCollection) == 0x000128, "Wrong size on FCharacterAnimCollection");
static_assert(offsetof(FCharacterAnimCollection, BasePose) == 0x000000, "Member 'FCharacterAnimCollection::BasePose' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, BasePoseTPP) == 0x000008, "Member 'FCharacterAnimCollection::BasePoseTPP' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, AimBasePose) == 0x000010, "Member 'FCharacterAnimCollection::AimBasePose' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, Death) == 0x000018, "Member 'FCharacterAnimCollection::Death' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, Intrinsic) == 0x000020, "Member 'FCharacterAnimCollection::Intrinsic' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, Locomotion) == 0x000048, "Member 'FCharacterAnimCollection::Locomotion' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, SingleAction) == 0x000060, "Member 'FCharacterAnimCollection::SingleAction' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, SingleLoad) == 0x000068, "Member 'FCharacterAnimCollection::SingleLoad' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, Throwable) == 0x000078, "Member 'FCharacterAnimCollection::Throwable' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, DeathAnim) == 0x000098, "Member 'FCharacterAnimCollection::DeathAnim' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, EquipAnim) == 0x0000A8, "Member 'FCharacterAnimCollection::EquipAnim' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, UnEquipAnim) == 0x0000B8, "Member 'FCharacterAnimCollection::UnEquipAnim' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, FireAnim) == 0x0000C8, "Member 'FCharacterAnimCollection::FireAnim' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, ActionAnim) == 0x0000D8, "Member 'FCharacterAnimCollection::ActionAnim' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, ReloadAnim) == 0x0000E8, "Member 'FCharacterAnimCollection::ReloadAnim' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, ReloadFullAnim) == 0x0000F8, "Member 'FCharacterAnimCollection::ReloadFullAnim' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, StartReloadAnim) == 0x000108, "Member 'FCharacterAnimCollection::StartReloadAnim' has a wrong offset!");
static_assert(offsetof(FCharacterAnimCollection, EndReloadAnim) == 0x000118, "Member 'FCharacterAnimCollection::EndReloadAnim' has a wrong offset!");

// ScriptStruct DonkehFramework.WeaponAnimCollection
// 0x00F0 (0x00F0 - 0x0000)
struct FWeaponAnimCollection final
{
public:
	class UAnimSequence*                          BasePose;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          EmptyBasePose;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntrinsicWeaponAnimSubset             Intrinsic;                                         // 0x0010(0x0028)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSingleActionWeaponAnimSubset          SingleAction;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSingleLoadWeaponAnimSubset            SingleLoad;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FThrowableWeaponAnimSubset             Throwable;                                         // 0x0050(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       EquipAnim;                                         // 0x0070(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       UnEquipAnim;                                       // 0x0080(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       FireAnim;                                          // 0x0090(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       ActionAnim;                                        // 0x00A0(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       ReloadAnim;                                        // 0x00B0(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       ReloadFullAnim;                                    // 0x00C0(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       StartReloadAnim;                                   // 0x00D0(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveAnim                       EndReloadAnim;                                     // 0x00E0(0x0010)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWeaponAnimCollection) == 0x000008, "Wrong alignment on FWeaponAnimCollection");
static_assert(sizeof(FWeaponAnimCollection) == 0x0000F0, "Wrong size on FWeaponAnimCollection");
static_assert(offsetof(FWeaponAnimCollection, BasePose) == 0x000000, "Member 'FWeaponAnimCollection::BasePose' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, EmptyBasePose) == 0x000008, "Member 'FWeaponAnimCollection::EmptyBasePose' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, Intrinsic) == 0x000010, "Member 'FWeaponAnimCollection::Intrinsic' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, SingleAction) == 0x000038, "Member 'FWeaponAnimCollection::SingleAction' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, SingleLoad) == 0x000040, "Member 'FWeaponAnimCollection::SingleLoad' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, Throwable) == 0x000050, "Member 'FWeaponAnimCollection::Throwable' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, EquipAnim) == 0x000070, "Member 'FWeaponAnimCollection::EquipAnim' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, UnEquipAnim) == 0x000080, "Member 'FWeaponAnimCollection::UnEquipAnim' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, FireAnim) == 0x000090, "Member 'FWeaponAnimCollection::FireAnim' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, ActionAnim) == 0x0000A0, "Member 'FWeaponAnimCollection::ActionAnim' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, ReloadAnim) == 0x0000B0, "Member 'FWeaponAnimCollection::ReloadAnim' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, ReloadFullAnim) == 0x0000C0, "Member 'FWeaponAnimCollection::ReloadFullAnim' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, StartReloadAnim) == 0x0000D0, "Member 'FWeaponAnimCollection::StartReloadAnim' has a wrong offset!");
static_assert(offsetof(FWeaponAnimCollection, EndReloadAnim) == 0x0000E0, "Member 'FWeaponAnimCollection::EndReloadAnim' has a wrong offset!");

// ScriptStruct DonkehFramework.PerspectiveStaticMesh
// 0x0010 (0x0010 - 0x0000)
struct FPerspectiveStaticMesh final
{
public:
	class UStaticMesh*                            Mesh1P;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            Mesh3P;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPerspectiveStaticMesh) == 0x000008, "Wrong alignment on FPerspectiveStaticMesh");
static_assert(sizeof(FPerspectiveStaticMesh) == 0x000010, "Wrong size on FPerspectiveStaticMesh");
static_assert(offsetof(FPerspectiveStaticMesh, Mesh1P) == 0x000000, "Member 'FPerspectiveStaticMesh::Mesh1P' has a wrong offset!");
static_assert(offsetof(FPerspectiveStaticMesh, Mesh3P) == 0x000008, "Member 'FPerspectiveStaticMesh::Mesh3P' has a wrong offset!");

// ScriptStruct DonkehFramework.PerspectiveSkeletalMesh
// 0x0010 (0x0010 - 0x0000)
struct FPerspectiveSkeletalMesh final
{
public:
	class USkeletalMesh*                          Mesh1P;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          Mesh3P;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPerspectiveSkeletalMesh) == 0x000008, "Wrong alignment on FPerspectiveSkeletalMesh");
static_assert(sizeof(FPerspectiveSkeletalMesh) == 0x000010, "Wrong size on FPerspectiveSkeletalMesh");
static_assert(offsetof(FPerspectiveSkeletalMesh, Mesh1P) == 0x000000, "Member 'FPerspectiveSkeletalMesh::Mesh1P' has a wrong offset!");
static_assert(offsetof(FPerspectiveSkeletalMesh, Mesh3P) == 0x000008, "Member 'FPerspectiveSkeletalMesh::Mesh3P' has a wrong offset!");

// ScriptStruct DonkehFramework.PerspectiveAnimSequence
// 0x0010 (0x0010 - 0x0000)
struct FPerspectiveAnimSequence final
{
public:
	class UAnimSequence*                          Anim1P;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          Anim3P;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPerspectiveAnimSequence) == 0x000008, "Wrong alignment on FPerspectiveAnimSequence");
static_assert(sizeof(FPerspectiveAnimSequence) == 0x000010, "Wrong size on FPerspectiveAnimSequence");
static_assert(offsetof(FPerspectiveAnimSequence, Anim1P) == 0x000000, "Member 'FPerspectiveAnimSequence::Anim1P' has a wrong offset!");
static_assert(offsetof(FPerspectiveAnimSequence, Anim3P) == 0x000008, "Member 'FPerspectiveAnimSequence::Anim3P' has a wrong offset!");

// ScriptStruct DonkehFramework.WeaponAnimMontage
// 0x0010 (0x0010 - 0x0000)
struct FWeaponAnimMontage final
{
public:
	class UAnimMontage*                           CharAnim;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           WeapAnim;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWeaponAnimMontage) == 0x000008, "Wrong alignment on FWeaponAnimMontage");
static_assert(sizeof(FWeaponAnimMontage) == 0x000010, "Wrong size on FWeaponAnimMontage");
static_assert(offsetof(FWeaponAnimMontage, CharAnim) == 0x000000, "Member 'FWeaponAnimMontage::CharAnim' has a wrong offset!");
static_assert(offsetof(FWeaponAnimMontage, WeapAnim) == 0x000008, "Member 'FWeaponAnimMontage::WeapAnim' has a wrong offset!");

// ScriptStruct DonkehFramework.WeaponAnimSequence
// 0x0010 (0x0010 - 0x0000)
struct FWeaponAnimSequence final
{
public:
	class UAnimSequence*                          CharAnim;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          WeapAnim;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWeaponAnimSequence) == 0x000008, "Wrong alignment on FWeaponAnimSequence");
static_assert(sizeof(FWeaponAnimSequence) == 0x000010, "Wrong size on FWeaponAnimSequence");
