#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FServerBadgeUIDefinition

#include "Basic.hpp"

#include "EServerBadgeType_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct FServerBadgeUIDefinition.FServerBadgeUIDefinition
// 0x0098 (0x0098 - 0x0000)
struct FFServerBadgeUIDefinition final
{
public:
	EServerBadgeType                              Type_11_EDB490C54973A52E253141B62C748510;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Icon_3_FCCFEB524CD1FF61B4B6B8AB1739316E;           // 0x0008(0x0088)(Edit, BlueprintVisible)
	int32                                         OrderingIdx_8_900B3535409A63FA032C5D866D3A48AF;    // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFServerBadgeUIDefinition) == 0x000008, "Wrong alignment on FFServerBadgeUIDefinition");
static_assert(sizeof(FFServerBadgeUIDefinition) == 0x000098, "Wrong size on FFServerBadgeUIDefinition");
static_assert(offsetof(FFServerBadgeUIDefinition, Type_11_EDB490C54973A52E253141B62C748510) == 0x000000, "Member 'FFServerBadgeUIDefinition::Type_11_EDB490C54973A52E253141B62C748510' has a wrong offset!");
static_assert(offsetof(FFServerBadgeUIDefinition, Icon_3_FCCFEB524CD1FF61B4B6B8AB1739316E) == 0x000008, "Member 'FFServerBadgeUIDefinition::Icon_3_FCCFEB524CD1FF61B4B6B8AB1739316E' has a wrong offset!");
static_assert(offsetof(FFServerBadgeUIDefinition, OrderingIdx_8_900B3535409A63FA032C5D866D3A48AF) == 0x000090, "Member 'FFServerBadgeUIDefinition::OrderingIdx_8_900B3535409A63FA032C5D866D3A48AF' has a wrong offset!");

}

