#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HDMain

#include "Basic.hpp"

#include "DonkehFramework_structs.hpp"
#include "Engine_structs.hpp"
#include "HDMain_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function HDMain.HDServerListFilterRule.MatchesServer
// 0x0010 (0x0010 - 0x0000)
struct HDServerListFilterRule_MatchesServer final
{
public:
	const class UHDServerListItemData*            ListItem;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HDServerListFilterRule_MatchesServer) == 0x000008, "Wrong alignment on HDServerListFilterRule_MatchesServer");
static_assert(sizeof(HDServerListFilterRule_MatchesServer) == 0x000010, "Wrong size on HDServerListFilterRule_MatchesServer");
static_assert(offsetof(HDServerListFilterRule_MatchesServer, ListItem) == 0x000000, "Member 'HDServerListFilterRule_MatchesServer::ListItem' has a wrong offset!");
static_assert(offsetof(HDServerListFilterRule_MatchesServer, ReturnValue) == 0x000008, "Member 'HDServerListFilterRule_MatchesServer::ReturnValue' has a wrong offset!");

// Function HDMain.DeployMenu_PlatoonSquadListBase.DeconstructSquad
// 0x0010 (0x0010 - 0x0000)
struct DeployMenu_PlatoonSquadListBase_DeconstructSquad final
{
public:
	class USquadListEntry*                        RemovedSquadData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RemovedSquadIdx;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DeployMenu_PlatoonSquadListBase_DeconstructSquad) == 0x000008, "Wrong alignment on DeployMenu_PlatoonSquadListBase_DeconstructSquad");
static_assert(sizeof(DeployMenu_PlatoonSquadListBase_DeconstructSquad) == 0x000010, "Wrong size on DeployMenu_PlatoonSquadListBase_DeconstructSquad");
static_assert(offsetof(DeployMenu_PlatoonSquadListBase_DeconstructSquad, RemovedSquadData) == 0x000000, "Member 'DeployMenu_PlatoonSquadListBase_DeconstructSquad::RemovedSquadData' has a wrong offset!");
static_assert(offsetof(DeployMenu_PlatoonSquadListBase_DeconstructSquad, RemovedSquadIdx) == 0x000008, "Member 'DeployMenu_PlatoonSquadListBase_DeconstructSquad::RemovedSquadIdx' has a wrong offset!");

// Function HDMain.DeployMenu_PlatoonSquadListBase.GenerateSquad
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_PlatoonSquadListBase_GenerateSquad final
{
public:
	class USquadListEntry*                        SquadData;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_PlatoonSquadListBase_GenerateSquad) == 0x000008, "Wrong alignment on DeployMenu_PlatoonSquadListBase_GenerateSquad");
static_assert(sizeof(DeployMenu_PlatoonSquadListBase_GenerateSquad) == 0x000008, "Wrong size on DeployMenu_PlatoonSquadListBase_GenerateSquad");
static_assert(offsetof(DeployMenu_PlatoonSquadListBase_GenerateSquad, SquadData) == 0x000000, "Member 'DeployMenu_PlatoonSquadListBase_GenerateSquad::SquadData' has a wrong offset!");

// Function HDMain.DeployMenu_PlatoonSquadListBase.SetupPlatoon
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_PlatoonSquadListBase_SetupPlatoon final
{
public:
	class UPlatoonListEntry*                      InPlatoonData;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_PlatoonSquadListBase_SetupPlatoon) == 0x000008, "Wrong alignment on DeployMenu_PlatoonSquadListBase_SetupPlatoon");
static_assert(sizeof(DeployMenu_PlatoonSquadListBase_SetupPlatoon) == 0x000008, "Wrong size on DeployMenu_PlatoonSquadListBase_SetupPlatoon");
static_assert(offsetof(DeployMenu_PlatoonSquadListBase_SetupPlatoon, InPlatoonData) == 0x000000, "Member 'DeployMenu_PlatoonSquadListBase_SetupPlatoon::InPlatoonData' has a wrong offset!");

// Function HDMain.DeployMenu_PlatoonSquadListBase.SquadAddedToPlatoon
// 0x0010 (0x0010 - 0x0000)
struct DeployMenu_PlatoonSquadListBase_SquadAddedToPlatoon final
{
public:
	class AHDPlatoonState*                        SourcePlatoon;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHDSquadState*                          NewSquad;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_PlatoonSquadListBase_SquadAddedToPlatoon) == 0x000008, "Wrong alignment on DeployMenu_PlatoonSquadListBase_SquadAddedToPlatoon");
static_assert(sizeof(DeployMenu_PlatoonSquadListBase_SquadAddedToPlatoon) == 0x000010, "Wrong size on DeployMenu_PlatoonSquadListBase_SquadAddedToPlatoon");
static_assert(offsetof(DeployMenu_PlatoonSquadListBase_SquadAddedToPlatoon, SourcePlatoon) == 0x000000, "Member 'DeployMenu_PlatoonSquadListBase_SquadAddedToPlatoon::SourcePlatoon' has a wrong offset!");
static_assert(offsetof(DeployMenu_PlatoonSquadListBase_SquadAddedToPlatoon, NewSquad) == 0x000008, "Member 'DeployMenu_PlatoonSquadListBase_SquadAddedToPlatoon::NewSquad' has a wrong offset!");

// Function HDMain.DeployMenu_PlatoonSquadListBase.SquadPreRemoveFromPlatoon
// 0x0010 (0x0010 - 0x0000)
struct DeployMenu_PlatoonSquadListBase_SquadPreRemoveFromPlatoon final
{
public:
	class AHDPlatoonState*                        SourcePlatoon;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHDSquadState*                          SquadToBeRemoved;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_PlatoonSquadListBase_SquadPreRemoveFromPlatoon) == 0x000008, "Wrong alignment on DeployMenu_PlatoonSquadListBase_SquadPreRemoveFromPlatoon");
static_assert(sizeof(DeployMenu_PlatoonSquadListBase_SquadPreRemoveFromPlatoon) == 0x000010, "Wrong size on DeployMenu_PlatoonSquadListBase_SquadPreRemoveFromPlatoon");
static_assert(offsetof(DeployMenu_PlatoonSquadListBase_SquadPreRemoveFromPlatoon, SourcePlatoon) == 0x000000, "Member 'DeployMenu_PlatoonSquadListBase_SquadPreRemoveFromPlatoon::SourcePlatoon' has a wrong offset!");
static_assert(offsetof(DeployMenu_PlatoonSquadListBase_SquadPreRemoveFromPlatoon, SquadToBeRemoved) == 0x000008, "Member 'DeployMenu_PlatoonSquadListBase_SquadPreRemoveFromPlatoon::SquadToBeRemoved' has a wrong offset!");

// Function HDMain.DeployMenu_PlatoonSquadListBase.GetPlatoonStateFromData
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_PlatoonSquadListBase_GetPlatoonStateFromData final
{
public:
	class AHDPlatoonState*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_PlatoonSquadListBase_GetPlatoonStateFromData) == 0x000008, "Wrong alignment on DeployMenu_PlatoonSquadListBase_GetPlatoonStateFromData");
static_assert(sizeof(DeployMenu_PlatoonSquadListBase_GetPlatoonStateFromData) == 0x000008, "Wrong size on DeployMenu_PlatoonSquadListBase_GetPlatoonStateFromData");
static_assert(offsetof(DeployMenu_PlatoonSquadListBase_GetPlatoonStateFromData, ReturnValue) == 0x000000, "Member 'DeployMenu_PlatoonSquadListBase_GetPlatoonStateFromData::ReturnValue' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.DeconstructSquadMember
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_SquadListBase_DeconstructSquadMember final
{
public:
	class USquadMemberInfo*                       RemovedMemberData;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_DeconstructSquadMember) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_DeconstructSquadMember");
static_assert(sizeof(DeployMenu_SquadListBase_DeconstructSquadMember) == 0x000008, "Wrong size on DeployMenu_SquadListBase_DeconstructSquadMember");
static_assert(offsetof(DeployMenu_SquadListBase_DeconstructSquadMember, RemovedMemberData) == 0x000000, "Member 'DeployMenu_SquadListBase_DeconstructSquadMember::RemovedMemberData' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.GenerateSquadMember
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_SquadListBase_GenerateSquadMember final
{
public:
	class USquadMemberInfo*                       MemberData;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_GenerateSquadMember) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_GenerateSquadMember");
static_assert(sizeof(DeployMenu_SquadListBase_GenerateSquadMember) == 0x000008, "Wrong size on DeployMenu_SquadListBase_GenerateSquadMember");
static_assert(offsetof(DeployMenu_SquadListBase_GenerateSquadMember, MemberData) == 0x000000, "Member 'DeployMenu_SquadListBase_GenerateSquadMember::MemberData' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.MemberAddedToSquad
// 0x0010 (0x0010 - 0x0000)
struct DeployMenu_SquadListBase_MemberAddedToSquad final
{
public:
	class AHDSquadState*                          SourceSquad;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHDPlayerState*                         NewMemberPS;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_MemberAddedToSquad) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_MemberAddedToSquad");
static_assert(sizeof(DeployMenu_SquadListBase_MemberAddedToSquad) == 0x000010, "Wrong size on DeployMenu_SquadListBase_MemberAddedToSquad");
static_assert(offsetof(DeployMenu_SquadListBase_MemberAddedToSquad, SourceSquad) == 0x000000, "Member 'DeployMenu_SquadListBase_MemberAddedToSquad::SourceSquad' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadListBase_MemberAddedToSquad, NewMemberPS) == 0x000008, "Member 'DeployMenu_SquadListBase_MemberAddedToSquad::NewMemberPS' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.MemberPreRemoveFromSquad
// 0x0010 (0x0010 - 0x0000)
struct DeployMenu_SquadListBase_MemberPreRemoveFromSquad final
{
public:
	class AHDSquadState*                          SourceSquad;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHDPlayerState*                         MemberPSToBeRemoved;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_MemberPreRemoveFromSquad) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_MemberPreRemoveFromSquad");
static_assert(sizeof(DeployMenu_SquadListBase_MemberPreRemoveFromSquad) == 0x000010, "Wrong size on DeployMenu_SquadListBase_MemberPreRemoveFromSquad");
static_assert(offsetof(DeployMenu_SquadListBase_MemberPreRemoveFromSquad, SourceSquad) == 0x000000, "Member 'DeployMenu_SquadListBase_MemberPreRemoveFromSquad::SourceSquad' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadListBase_MemberPreRemoveFromSquad, MemberPSToBeRemoved) == 0x000008, "Member 'DeployMenu_SquadListBase_MemberPreRemoveFromSquad::MemberPSToBeRemoved' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.MemberSquadInfoUpdated
// 0x0020 (0x0020 - 0x0000)
struct DeployMenu_SquadListBase_MemberSquadInfoUpdated final
{
public:
	class AHDSquadState*                          SourceSquad;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHDPlayerState*                         MemberPS;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHDSquadAssignmentInfo                 MemberSQInfo;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_MemberSquadInfoUpdated) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_MemberSquadInfoUpdated");
static_assert(sizeof(DeployMenu_SquadListBase_MemberSquadInfoUpdated) == 0x000020, "Wrong size on DeployMenu_SquadListBase_MemberSquadInfoUpdated");
static_assert(offsetof(DeployMenu_SquadListBase_MemberSquadInfoUpdated, SourceSquad) == 0x000000, "Member 'DeployMenu_SquadListBase_MemberSquadInfoUpdated::SourceSquad' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadListBase_MemberSquadInfoUpdated, MemberPS) == 0x000008, "Member 'DeployMenu_SquadListBase_MemberSquadInfoUpdated::MemberPS' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadListBase_MemberSquadInfoUpdated, MemberSQInfo) == 0x000010, "Member 'DeployMenu_SquadListBase_MemberSquadInfoUpdated::MemberSQInfo' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.OnSquadLeaderUpdated
// 0x0010 (0x0010 - 0x0000)
struct DeployMenu_SquadListBase_OnSquadLeaderUpdated final
{
public:
	class AHDPlayerState*                         NewLeaderPS;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHDPlayerState*                         PrevLeaderPS;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_OnSquadLeaderUpdated) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_OnSquadLeaderUpdated");
static_assert(sizeof(DeployMenu_SquadListBase_OnSquadLeaderUpdated) == 0x000010, "Wrong size on DeployMenu_SquadListBase_OnSquadLeaderUpdated");
static_assert(offsetof(DeployMenu_SquadListBase_OnSquadLeaderUpdated, NewLeaderPS) == 0x000000, "Member 'DeployMenu_SquadListBase_OnSquadLeaderUpdated::NewLeaderPS' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadListBase_OnSquadLeaderUpdated, PrevLeaderPS) == 0x000008, "Member 'DeployMenu_SquadListBase_OnSquadLeaderUpdated::PrevLeaderPS' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.OnSquadLockStateUpdated
// 0x0001 (0x0001 - 0x0000)
struct DeployMenu_SquadListBase_OnSquadLockStateUpdated final
{
public:
	bool                                          bNewLockedState;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_OnSquadLockStateUpdated) == 0x000001, "Wrong alignment on DeployMenu_SquadListBase_OnSquadLockStateUpdated");
static_assert(sizeof(DeployMenu_SquadListBase_OnSquadLockStateUpdated) == 0x000001, "Wrong size on DeployMenu_SquadListBase_OnSquadLockStateUpdated");
static_assert(offsetof(DeployMenu_SquadListBase_OnSquadLockStateUpdated, bNewLockedState) == 0x000000, "Member 'DeployMenu_SquadListBase_OnSquadLockStateUpdated::bNewLockedState' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.OnSquadNameUpdated
// 0x0030 (0x0030 - 0x0000)
struct DeployMenu_SquadListBase_OnSquadNameUpdated final
{
public:
	class FText                                   NewSquadName;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   PreviousSquadName;                                 // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_OnSquadNameUpdated) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_OnSquadNameUpdated");
static_assert(sizeof(DeployMenu_SquadListBase_OnSquadNameUpdated) == 0x000030, "Wrong size on DeployMenu_SquadListBase_OnSquadNameUpdated");
static_assert(offsetof(DeployMenu_SquadListBase_OnSquadNameUpdated, NewSquadName) == 0x000000, "Member 'DeployMenu_SquadListBase_OnSquadNameUpdated::NewSquadName' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadListBase_OnSquadNameUpdated, PreviousSquadName) == 0x000018, "Member 'DeployMenu_SquadListBase_OnSquadNameUpdated::PreviousSquadName' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.SetupSquad
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_SquadListBase_SetupSquad final
{
public:
	class USquadListEntry*                        InSquadData;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_SetupSquad) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_SetupSquad");
static_assert(sizeof(DeployMenu_SquadListBase_SetupSquad) == 0x000008, "Wrong size on DeployMenu_SquadListBase_SetupSquad");
static_assert(offsetof(DeployMenu_SquadListBase_SetupSquad, InSquadData) == 0x000000, "Member 'DeployMenu_SquadListBase_SetupSquad::InSquadData' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.SquadLeaderChanged
// 0x0018 (0x0018 - 0x0000)
struct DeployMenu_SquadListBase_SquadLeaderChanged final
{
public:
	class AHDSquadState*                          SourceSquad;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHDPlayerState*                         NewLeaderPS;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHDPlayerState*                         PrevLeaderPS;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_SquadLeaderChanged) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_SquadLeaderChanged");
static_assert(sizeof(DeployMenu_SquadListBase_SquadLeaderChanged) == 0x000018, "Wrong size on DeployMenu_SquadListBase_SquadLeaderChanged");
static_assert(offsetof(DeployMenu_SquadListBase_SquadLeaderChanged, SourceSquad) == 0x000000, "Member 'DeployMenu_SquadListBase_SquadLeaderChanged::SourceSquad' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadListBase_SquadLeaderChanged, NewLeaderPS) == 0x000008, "Member 'DeployMenu_SquadListBase_SquadLeaderChanged::NewLeaderPS' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadListBase_SquadLeaderChanged, PrevLeaderPS) == 0x000010, "Member 'DeployMenu_SquadListBase_SquadLeaderChanged::PrevLeaderPS' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.SquadLockStateUpdated
// 0x0010 (0x0010 - 0x0000)
struct DeployMenu_SquadListBase_SquadLockStateUpdated final
{
public:
	class AHDSquadState*                          SourceSquad;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewLocked;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DeployMenu_SquadListBase_SquadLockStateUpdated) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_SquadLockStateUpdated");
static_assert(sizeof(DeployMenu_SquadListBase_SquadLockStateUpdated) == 0x000010, "Wrong size on DeployMenu_SquadListBase_SquadLockStateUpdated");
static_assert(offsetof(DeployMenu_SquadListBase_SquadLockStateUpdated, SourceSquad) == 0x000000, "Member 'DeployMenu_SquadListBase_SquadLockStateUpdated::SourceSquad' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadListBase_SquadLockStateUpdated, bNewLocked) == 0x000008, "Member 'DeployMenu_SquadListBase_SquadLockStateUpdated::bNewLocked' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.SquadNameChanged
// 0x0038 (0x0038 - 0x0000)
struct DeployMenu_SquadListBase_SquadNameChanged final
{
public:
	class AHDSquadState*                          SourceSquad;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   NewName;                                           // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   PrevName;                                          // 0x0020(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_SquadNameChanged) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_SquadNameChanged");
static_assert(sizeof(DeployMenu_SquadListBase_SquadNameChanged) == 0x000038, "Wrong size on DeployMenu_SquadListBase_SquadNameChanged");
static_assert(offsetof(DeployMenu_SquadListBase_SquadNameChanged, SourceSquad) == 0x000000, "Member 'DeployMenu_SquadListBase_SquadNameChanged::SourceSquad' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadListBase_SquadNameChanged, NewName) == 0x000008, "Member 'DeployMenu_SquadListBase_SquadNameChanged::NewName' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadListBase_SquadNameChanged, PrevName) == 0x000020, "Member 'DeployMenu_SquadListBase_SquadNameChanged::PrevName' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.GetParentPlatoonStateFromData
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_SquadListBase_GetParentPlatoonStateFromData final
{
public:
	class AHDPlatoonState*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_GetParentPlatoonStateFromData) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_GetParentPlatoonStateFromData");
static_assert(sizeof(DeployMenu_SquadListBase_GetParentPlatoonStateFromData) == 0x000008, "Wrong size on DeployMenu_SquadListBase_GetParentPlatoonStateFromData");
static_assert(offsetof(DeployMenu_SquadListBase_GetParentPlatoonStateFromData, ReturnValue) == 0x000000, "Member 'DeployMenu_SquadListBase_GetParentPlatoonStateFromData::ReturnValue' has a wrong offset!");

// Function HDMain.DeployMenu_SquadListBase.GetSquadStateFromData
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_SquadListBase_GetSquadStateFromData final
{
public:
	class AHDSquadState*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadListBase_GetSquadStateFromData) == 0x000008, "Wrong alignment on DeployMenu_SquadListBase_GetSquadStateFromData");
static_assert(sizeof(DeployMenu_SquadListBase_GetSquadStateFromData) == 0x000008, "Wrong size on DeployMenu_SquadListBase_GetSquadStateFromData");
static_assert(offsetof(DeployMenu_SquadListBase_GetSquadStateFromData, ReturnValue) == 0x000000, "Member 'DeployMenu_SquadListBase_GetSquadStateFromData::ReturnValue' has a wrong offset!");

// Function HDMain.DeployMenu_SquadMemberListingBase.MemberPlayerNameChanged
// 0x0018 (0x0018 - 0x0000)
struct DeployMenu_SquadMemberListingBase_MemberPlayerNameChanged final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewPlayerName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadMemberListingBase_MemberPlayerNameChanged) == 0x000008, "Wrong alignment on DeployMenu_SquadMemberListingBase_MemberPlayerNameChanged");
static_assert(sizeof(DeployMenu_SquadMemberListingBase_MemberPlayerNameChanged) == 0x000018, "Wrong size on DeployMenu_SquadMemberListingBase_MemberPlayerNameChanged");
static_assert(offsetof(DeployMenu_SquadMemberListingBase_MemberPlayerNameChanged, PlayerState) == 0x000000, "Member 'DeployMenu_SquadMemberListingBase_MemberPlayerNameChanged::PlayerState' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadMemberListingBase_MemberPlayerNameChanged, NewPlayerName) == 0x000008, "Member 'DeployMenu_SquadMemberListingBase_MemberPlayerNameChanged::NewPlayerName' has a wrong offset!");

// Function HDMain.DeployMenu_SquadMemberListingBase.OnMemberPlayerNameUpdated
// 0x0010 (0x0010 - 0x0000)
struct DeployMenu_SquadMemberListingBase_OnMemberPlayerNameUpdated final
{
public:
	class FString                                 NewPlayerName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadMemberListingBase_OnMemberPlayerNameUpdated) == 0x000008, "Wrong alignment on DeployMenu_SquadMemberListingBase_OnMemberPlayerNameUpdated");
static_assert(sizeof(DeployMenu_SquadMemberListingBase_OnMemberPlayerNameUpdated) == 0x000010, "Wrong size on DeployMenu_SquadMemberListingBase_OnMemberPlayerNameUpdated");
static_assert(offsetof(DeployMenu_SquadMemberListingBase_OnMemberPlayerNameUpdated, NewPlayerName) == 0x000000, "Member 'DeployMenu_SquadMemberListingBase_OnMemberPlayerNameUpdated::NewPlayerName' has a wrong offset!");

// Function HDMain.DeployMenu_SquadMemberListingBase.SetupMember
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_SquadMemberListingBase_SetupMember final
{
public:
	class USquadMemberInfo*                       InMemberData;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadMemberListingBase_SetupMember) == 0x000008, "Wrong alignment on DeployMenu_SquadMemberListingBase_SetupMember");
static_assert(sizeof(DeployMenu_SquadMemberListingBase_SetupMember) == 0x000008, "Wrong size on DeployMenu_SquadMemberListingBase_SetupMember");
static_assert(offsetof(DeployMenu_SquadMemberListingBase_SetupMember, InMemberData) == 0x000000, "Member 'DeployMenu_SquadMemberListingBase_SetupMember::InMemberData' has a wrong offset!");

// Function HDMain.DeployMenu_SquadMemberListingBase.GetParentPlatoonStateFromData
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_SquadMemberListingBase_GetParentPlatoonStateFromData final
{
public:
	class AHDPlatoonState*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadMemberListingBase_GetParentPlatoonStateFromData) == 0x000008, "Wrong alignment on DeployMenu_SquadMemberListingBase_GetParentPlatoonStateFromData");
static_assert(sizeof(DeployMenu_SquadMemberListingBase_GetParentPlatoonStateFromData) == 0x000008, "Wrong size on DeployMenu_SquadMemberListingBase_GetParentPlatoonStateFromData");
static_assert(offsetof(DeployMenu_SquadMemberListingBase_GetParentPlatoonStateFromData, ReturnValue) == 0x000000, "Member 'DeployMenu_SquadMemberListingBase_GetParentPlatoonStateFromData::ReturnValue' has a wrong offset!");

// Function HDMain.DeployMenu_SquadMemberListingBase.GetParentSquadStateFromData
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_SquadMemberListingBase_GetParentSquadStateFromData final
{
public:
	class AHDSquadState*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadMemberListingBase_GetParentSquadStateFromData) == 0x000008, "Wrong alignment on DeployMenu_SquadMemberListingBase_GetParentSquadStateFromData");
static_assert(sizeof(DeployMenu_SquadMemberListingBase_GetParentSquadStateFromData) == 0x000008, "Wrong size on DeployMenu_SquadMemberListingBase_GetParentSquadStateFromData");
static_assert(offsetof(DeployMenu_SquadMemberListingBase_GetParentSquadStateFromData, ReturnValue) == 0x000000, "Member 'DeployMenu_SquadMemberListingBase_GetParentSquadStateFromData::ReturnValue' has a wrong offset!");

// Function HDMain.DeployMenu_SquadMemberListingBase.GetPlayerStateFromData
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_SquadMemberListingBase_GetPlayerStateFromData final
{
public:
	class AHDPlayerState*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadMemberListingBase_GetPlayerStateFromData) == 0x000008, "Wrong alignment on DeployMenu_SquadMemberListingBase_GetPlayerStateFromData");
static_assert(sizeof(DeployMenu_SquadMemberListingBase_GetPlayerStateFromData) == 0x000008, "Wrong size on DeployMenu_SquadMemberListingBase_GetPlayerStateFromData");
static_assert(offsetof(DeployMenu_SquadMemberListingBase_GetPlayerStateFromData, ReturnValue) == 0x000000, "Member 'DeployMenu_SquadMemberListingBase_GetPlayerStateFromData::ReturnValue' has a wrong offset!");

// Function HDMain.HDScoreboardListingRowBase.Init
// 0x0018 (0x0018 - 0x0000)
struct HDScoreboardListingRowBase_Init final
{
public:
	class UHDScoreboardBase*                      InParentMenu;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADFBasePlayerState*                     InPlayerState;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInRefreshListingOnTick;                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HDScoreboardListingRowBase_Init) == 0x000008, "Wrong alignment on HDScoreboardListingRowBase_Init");
static_assert(sizeof(HDScoreboardListingRowBase_Init) == 0x000018, "Wrong size on HDScoreboardListingRowBase_Init");
static_assert(offsetof(HDScoreboardListingRowBase_Init, InParentMenu) == 0x000000, "Member 'HDScoreboardListingRowBase_Init::InParentMenu' has a wrong offset!");
static_assert(offsetof(HDScoreboardListingRowBase_Init, InPlayerState) == 0x000008, "Member 'HDScoreboardListingRowBase_Init::InPlayerState' has a wrong offset!");
static_assert(offsetof(HDScoreboardListingRowBase_Init, bInRefreshListingOnTick) == 0x000010, "Member 'HDScoreboardListingRowBase_Init::bInRefreshListingOnTick' has a wrong offset!");

// Function HDMain.HDScoreboardListingRowBase.ReceivePlayerVoiceStateChanged
// 0x0001 (0x0001 - 0x0000)
struct HDScoreboardListingRowBase_ReceivePlayerVoiceStateChanged final
{
public:
	EPlayerVoiceState                             NewVoiceState;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDScoreboardListingRowBase_ReceivePlayerVoiceStateChanged) == 0x000001, "Wrong alignment on HDScoreboardListingRowBase_ReceivePlayerVoiceStateChanged");
static_assert(sizeof(HDScoreboardListingRowBase_ReceivePlayerVoiceStateChanged) == 0x000001, "Wrong size on HDScoreboardListingRowBase_ReceivePlayerVoiceStateChanged");
static_assert(offsetof(HDScoreboardListingRowBase_ReceivePlayerVoiceStateChanged, NewVoiceState) == 0x000000, "Member 'HDScoreboardListingRowBase_ReceivePlayerVoiceStateChanged::NewVoiceState' has a wrong offset!");

// Function HDMain.HDScoreboardListingRowBase.SetVoiceStateIcon
// 0x0008 (0x0008 - 0x0000)
struct HDScoreboardListingRowBase_SetVoiceStateIcon final
{
public:
	class UTexture2D*                             NewIcon;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDScoreboardListingRowBase_SetVoiceStateIcon) == 0x000008, "Wrong alignment on HDScoreboardListingRowBase_SetVoiceStateIcon");
static_assert(sizeof(HDScoreboardListingRowBase_SetVoiceStateIcon) == 0x000008, "Wrong size on HDScoreboardListingRowBase_SetVoiceStateIcon");
static_assert(offsetof(HDScoreboardListingRowBase_SetVoiceStateIcon, NewIcon) == 0x000000, "Member 'HDScoreboardListingRowBase_SetVoiceStateIcon::NewIcon' has a wrong offset!");

// Function HDMain.HDScoreboardListingRowBase.GetCurrentPing
// 0x0004 (0x0004 - 0x0000)
struct HDScoreboardListingRowBase_GetCurrentPing final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDScoreboardListingRowBase_GetCurrentPing) == 0x000004, "Wrong alignment on HDScoreboardListingRowBase_GetCurrentPing");
static_assert(sizeof(HDScoreboardListingRowBase_GetCurrentPing) == 0x000004, "Wrong size on HDScoreboardListingRowBase_GetCurrentPing");
static_assert(offsetof(HDScoreboardListingRowBase_GetCurrentPing, ReturnValue) == 0x000000, "Member 'HDScoreboardListingRowBase_GetCurrentPing::ReturnValue' has a wrong offset!");

// Function HDMain.HDScoreboardListingRowBase.GetIconForVoiceState
// 0x0030 (0x0030 - 0x0000)
struct HDScoreboardListingRowBase_GetIconForVoiceState final
{
public:
	EPlayerVoiceState                             VoiceState;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDScoreboardListingRowBase_GetIconForVoiceState) == 0x000008, "Wrong alignment on HDScoreboardListingRowBase_GetIconForVoiceState");
static_assert(sizeof(HDScoreboardListingRowBase_GetIconForVoiceState) == 0x000030, "Wrong size on HDScoreboardListingRowBase_GetIconForVoiceState");
static_assert(offsetof(HDScoreboardListingRowBase_GetIconForVoiceState, VoiceState) == 0x000000, "Member 'HDScoreboardListingRowBase_GetIconForVoiceState::VoiceState' has a wrong offset!");
static_assert(offsetof(HDScoreboardListingRowBase_GetIconForVoiceState, ReturnValue) == 0x000008, "Member 'HDScoreboardListingRowBase_GetIconForVoiceState::ReturnValue' has a wrong offset!");

// Function HDMain.HDScoreboardListingRowBase.HasInitialized
// 0x0001 (0x0001 - 0x0000)
struct HDScoreboardListingRowBase_HasInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDScoreboardListingRowBase_HasInitialized) == 0x000001, "Wrong alignment on HDScoreboardListingRowBase_HasInitialized");
static_assert(sizeof(HDScoreboardListingRowBase_HasInitialized) == 0x000001, "Wrong size on HDScoreboardListingRowBase_HasInitialized");
static_assert(offsetof(HDScoreboardListingRowBase_HasInitialized, ReturnValue) == 0x000000, "Member 'HDScoreboardListingRowBase_HasInitialized::ReturnValue' has a wrong offset!");

// Function HDMain.DeployMenu_SquadSelectionWidgetBase.DeconstructPlatoon
// 0x0010 (0x0010 - 0x0000)
struct DeployMenu_SquadSelectionWidgetBase_DeconstructPlatoon final
{
public:
	class UPlatoonListEntry*                      RemovedPlatoonData;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RemovedPlatoonIdx;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DeployMenu_SquadSelectionWidgetBase_DeconstructPlatoon) == 0x000008, "Wrong alignment on DeployMenu_SquadSelectionWidgetBase_DeconstructPlatoon");
static_assert(sizeof(DeployMenu_SquadSelectionWidgetBase_DeconstructPlatoon) == 0x000010, "Wrong size on DeployMenu_SquadSelectionWidgetBase_DeconstructPlatoon");
static_assert(offsetof(DeployMenu_SquadSelectionWidgetBase_DeconstructPlatoon, RemovedPlatoonData) == 0x000000, "Member 'DeployMenu_SquadSelectionWidgetBase_DeconstructPlatoon::RemovedPlatoonData' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadSelectionWidgetBase_DeconstructPlatoon, RemovedPlatoonIdx) == 0x000008, "Member 'DeployMenu_SquadSelectionWidgetBase_DeconstructPlatoon::RemovedPlatoonIdx' has a wrong offset!");

// Function HDMain.DeployMenu_SquadSelectionWidgetBase.GeneratePlatoon
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_SquadSelectionWidgetBase_GeneratePlatoon final
{
public:
	class UPlatoonListEntry*                      PlatoonData;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadSelectionWidgetBase_GeneratePlatoon) == 0x000008, "Wrong alignment on DeployMenu_SquadSelectionWidgetBase_GeneratePlatoon");
static_assert(sizeof(DeployMenu_SquadSelectionWidgetBase_GeneratePlatoon) == 0x000008, "Wrong size on DeployMenu_SquadSelectionWidgetBase_GeneratePlatoon");
static_assert(offsetof(DeployMenu_SquadSelectionWidgetBase_GeneratePlatoon, PlatoonData) == 0x000000, "Member 'DeployMenu_SquadSelectionWidgetBase_GeneratePlatoon::PlatoonData' has a wrong offset!");

// Function HDMain.DeployMenu_SquadSelectionWidgetBase.PlatoonAddedToTeam
// 0x0010 (0x0010 - 0x0000)
struct DeployMenu_SquadSelectionWidgetBase_PlatoonAddedToTeam final
{
public:
	class AHDTeamState*                           SourceTeam;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHDPlatoonState*                        NewPlatoon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadSelectionWidgetBase_PlatoonAddedToTeam) == 0x000008, "Wrong alignment on DeployMenu_SquadSelectionWidgetBase_PlatoonAddedToTeam");
static_assert(sizeof(DeployMenu_SquadSelectionWidgetBase_PlatoonAddedToTeam) == 0x000010, "Wrong size on DeployMenu_SquadSelectionWidgetBase_PlatoonAddedToTeam");
static_assert(offsetof(DeployMenu_SquadSelectionWidgetBase_PlatoonAddedToTeam, SourceTeam) == 0x000000, "Member 'DeployMenu_SquadSelectionWidgetBase_PlatoonAddedToTeam::SourceTeam' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadSelectionWidgetBase_PlatoonAddedToTeam, NewPlatoon) == 0x000008, "Member 'DeployMenu_SquadSelectionWidgetBase_PlatoonAddedToTeam::NewPlatoon' has a wrong offset!");

// Function HDMain.DeployMenu_SquadSelectionWidgetBase.PlatoonPreRemoveFromTeam
// 0x0010 (0x0010 - 0x0000)
struct DeployMenu_SquadSelectionWidgetBase_PlatoonPreRemoveFromTeam final
{
public:
	class AHDTeamState*                           SourceTeam;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHDPlatoonState*                        PlatoonToBeRemoved;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadSelectionWidgetBase_PlatoonPreRemoveFromTeam) == 0x000008, "Wrong alignment on DeployMenu_SquadSelectionWidgetBase_PlatoonPreRemoveFromTeam");
static_assert(sizeof(DeployMenu_SquadSelectionWidgetBase_PlatoonPreRemoveFromTeam) == 0x000010, "Wrong size on DeployMenu_SquadSelectionWidgetBase_PlatoonPreRemoveFromTeam");
static_assert(offsetof(DeployMenu_SquadSelectionWidgetBase_PlatoonPreRemoveFromTeam, SourceTeam) == 0x000000, "Member 'DeployMenu_SquadSelectionWidgetBase_PlatoonPreRemoveFromTeam::SourceTeam' has a wrong offset!");
static_assert(offsetof(DeployMenu_SquadSelectionWidgetBase_PlatoonPreRemoveFromTeam, PlatoonToBeRemoved) == 0x000008, "Member 'DeployMenu_SquadSelectionWidgetBase_PlatoonPreRemoveFromTeam::PlatoonToBeRemoved' has a wrong offset!");

// Function HDMain.DeployMenu_SquadSelectionWidgetBase.SetupSquadSelection
// 0x0008 (0x0008 - 0x0000)
struct DeployMenu_SquadSelectionWidgetBase_SetupSquadSelection final
{
public:
	class AHDTeamState*                           InPlatoonTeamState;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeployMenu_SquadSelectionWidgetBase_SetupSquadSelection) == 0x000008, "Wrong alignment on DeployMenu_SquadSelectionWidgetBase_SetupSquadSelection");
static_assert(sizeof(DeployMenu_SquadSelectionWidgetBase_SetupSquadSelection) == 0x000008, "Wrong size on DeployMenu_SquadSelectionWidgetBase_SetupSquadSelection");
static_assert(offsetof(DeployMenu_SquadSelectionWidgetBase_SetupSquadSelection, InPlatoonTeamState) == 0x000000, "Member 'DeployMenu_SquadSelectionWidgetBase_SetupSquadSelection::InPlatoonTeamState' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.EstablishNewControlPoint
// 0x0001 (0x0001 - 0x0000)
struct HDAICaptureHandler_EstablishNewControlPoint final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDAICaptureHandler_EstablishNewControlPoint) == 0x000001, "Wrong alignment on HDAICaptureHandler_EstablishNewControlPoint");
static_assert(sizeof(HDAICaptureHandler_EstablishNewControlPoint) == 0x000001, "Wrong size on HDAICaptureHandler_EstablishNewControlPoint");
static_assert(offsetof(HDAICaptureHandler_EstablishNewControlPoint, ReturnValue) == 0x000000, "Member 'HDAICaptureHandler_EstablishNewControlPoint::ReturnValue' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.GetCurrentCPLocation
// 0x000C (0x000C - 0x0000)
struct HDAICaptureHandler_GetCurrentCPLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDAICaptureHandler_GetCurrentCPLocation) == 0x000004, "Wrong alignment on HDAICaptureHandler_GetCurrentCPLocation");
static_assert(sizeof(HDAICaptureHandler_GetCurrentCPLocation) == 0x00000C, "Wrong size on HDAICaptureHandler_GetCurrentCPLocation");
static_assert(offsetof(HDAICaptureHandler_GetCurrentCPLocation, ReturnValue) == 0x000000, "Member 'HDAICaptureHandler_GetCurrentCPLocation::ReturnValue' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.GetTotalNumberOfCapturePoints
// 0x0004 (0x0004 - 0x0000)
struct HDAICaptureHandler_GetTotalNumberOfCapturePoints final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDAICaptureHandler_GetTotalNumberOfCapturePoints) == 0x000004, "Wrong alignment on HDAICaptureHandler_GetTotalNumberOfCapturePoints");
static_assert(sizeof(HDAICaptureHandler_GetTotalNumberOfCapturePoints) == 0x000004, "Wrong size on HDAICaptureHandler_GetTotalNumberOfCapturePoints");
static_assert(offsetof(HDAICaptureHandler_GetTotalNumberOfCapturePoints, ReturnValue) == 0x000000, "Member 'HDAICaptureHandler_GetTotalNumberOfCapturePoints::ReturnValue' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.SetCurrentCaptureMode
// 0x0001 (0x0001 - 0x0000)
struct HDAICaptureHandler_SetCurrentCaptureMode final
{
public:
	EHDAICaptureMode                              NewCaptureMode;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDAICaptureHandler_SetCurrentCaptureMode) == 0x000001, "Wrong alignment on HDAICaptureHandler_SetCurrentCaptureMode");
static_assert(sizeof(HDAICaptureHandler_SetCurrentCaptureMode) == 0x000001, "Wrong size on HDAICaptureHandler_SetCurrentCaptureMode");
static_assert(offsetof(HDAICaptureHandler_SetCurrentCaptureMode, NewCaptureMode) == 0x000000, "Member 'HDAICaptureHandler_SetCurrentCaptureMode::NewCaptureMode' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.SetCurrentCP
// 0x0008 (0x0008 - 0x0000)
struct HDAICaptureHandler_SetCurrentCP final
{
public:
	class AHDBaseCapturePoint*                    InCurrentCP;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDAICaptureHandler_SetCurrentCP) == 0x000008, "Wrong alignment on HDAICaptureHandler_SetCurrentCP");
static_assert(sizeof(HDAICaptureHandler_SetCurrentCP) == 0x000008, "Wrong size on HDAICaptureHandler_SetCurrentCP");
static_assert(offsetof(HDAICaptureHandler_SetCurrentCP, InCurrentCP) == 0x000000, "Member 'HDAICaptureHandler_SetCurrentCP::InCurrentCP' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.FindAvailableControlPointsOfType
// 0x0018 (0x0018 - 0x0000)
struct HDAICaptureHandler_FindAvailableControlPointsOfType final
{
public:
	EHDAICaptureMode                              InCaptureMode;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHDBaseCapturePoint*>            ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDAICaptureHandler_FindAvailableControlPointsOfType) == 0x000008, "Wrong alignment on HDAICaptureHandler_FindAvailableControlPointsOfType");
static_assert(sizeof(HDAICaptureHandler_FindAvailableControlPointsOfType) == 0x000018, "Wrong size on HDAICaptureHandler_FindAvailableControlPointsOfType");
static_assert(offsetof(HDAICaptureHandler_FindAvailableControlPointsOfType, InCaptureMode) == 0x000000, "Member 'HDAICaptureHandler_FindAvailableControlPointsOfType::InCaptureMode' has a wrong offset!");
static_assert(offsetof(HDAICaptureHandler_FindAvailableControlPointsOfType, ReturnValue) == 0x000008, "Member 'HDAICaptureHandler_FindAvailableControlPointsOfType::ReturnValue' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.FindAvailableControlPointsOfTypeV1
// 0x0018 (0x0018 - 0x0000)
struct HDAICaptureHandler_FindAvailableControlPointsOfTypeV1 final
{
public:
	EHDAICaptureMode                              InCaptureMode;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHDBaseCapturePoint*>            ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDAICaptureHandler_FindAvailableControlPointsOfTypeV1) == 0x000008, "Wrong alignment on HDAICaptureHandler_FindAvailableControlPointsOfTypeV1");
static_assert(sizeof(HDAICaptureHandler_FindAvailableControlPointsOfTypeV1) == 0x000018, "Wrong size on HDAICaptureHandler_FindAvailableControlPointsOfTypeV1");
static_assert(offsetof(HDAICaptureHandler_FindAvailableControlPointsOfTypeV1, InCaptureMode) == 0x000000, "Member 'HDAICaptureHandler_FindAvailableControlPointsOfTypeV1::InCaptureMode' has a wrong offset!");
static_assert(offsetof(HDAICaptureHandler_FindAvailableControlPointsOfTypeV1, ReturnValue) == 0x000008, "Member 'HDAICaptureHandler_FindAvailableControlPointsOfTypeV1::ReturnValue' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.FindAvailableControlPointsOfTypeV2
// 0x0018 (0x0018 - 0x0000)
struct HDAICaptureHandler_FindAvailableControlPointsOfTypeV2 final
{
public:
	EHDAICaptureMode                              InCaptureMode;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHDBaseCapturePoint*>            ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDAICaptureHandler_FindAvailableControlPointsOfTypeV2) == 0x000008, "Wrong alignment on HDAICaptureHandler_FindAvailableControlPointsOfTypeV2");
static_assert(sizeof(HDAICaptureHandler_FindAvailableControlPointsOfTypeV2) == 0x000018, "Wrong size on HDAICaptureHandler_FindAvailableControlPointsOfTypeV2");
static_assert(offsetof(HDAICaptureHandler_FindAvailableControlPointsOfTypeV2, InCaptureMode) == 0x000000, "Member 'HDAICaptureHandler_FindAvailableControlPointsOfTypeV2::InCaptureMode' has a wrong offset!");
static_assert(offsetof(HDAICaptureHandler_FindAvailableControlPointsOfTypeV2, ReturnValue) == 0x000008, "Member 'HDAICaptureHandler_FindAvailableControlPointsOfTypeV2::ReturnValue' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.FindAvailableControlPointsOfTypeV3
// 0x0018 (0x0018 - 0x0000)
struct HDAICaptureHandler_FindAvailableControlPointsOfTypeV3 final
{
public:
	EHDAICaptureMode                              InCaptureMode;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHDBaseCapturePoint*>            ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDAICaptureHandler_FindAvailableControlPointsOfTypeV3) == 0x000008, "Wrong alignment on HDAICaptureHandler_FindAvailableControlPointsOfTypeV3");
static_assert(sizeof(HDAICaptureHandler_FindAvailableControlPointsOfTypeV3) == 0x000018, "Wrong size on HDAICaptureHandler_FindAvailableControlPointsOfTypeV3");
static_assert(offsetof(HDAICaptureHandler_FindAvailableControlPointsOfTypeV3, InCaptureMode) == 0x000000, "Member 'HDAICaptureHandler_FindAvailableControlPointsOfTypeV3::InCaptureMode' has a wrong offset!");
static_assert(offsetof(HDAICaptureHandler_FindAvailableControlPointsOfTypeV3, ReturnValue) == 0x000008, "Member 'HDAICaptureHandler_FindAvailableControlPointsOfTypeV3::ReturnValue' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.FindControlPointClosestToPawn
// 0x0018 (0x0018 - 0x0000)
struct HDAICaptureHandler_FindControlPointClosestToPawn final
{
public:
	TArray<class AHDBaseCapturePoint*>            CPs;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHDBaseCapturePoint*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDAICaptureHandler_FindControlPointClosestToPawn) == 0x000008, "Wrong alignment on HDAICaptureHandler_FindControlPointClosestToPawn");
static_assert(sizeof(HDAICaptureHandler_FindControlPointClosestToPawn) == 0x000018, "Wrong size on HDAICaptureHandler_FindControlPointClosestToPawn");
static_assert(offsetof(HDAICaptureHandler_FindControlPointClosestToPawn, CPs) == 0x000000, "Member 'HDAICaptureHandler_FindControlPointClosestToPawn::CPs' has a wrong offset!");
static_assert(offsetof(HDAICaptureHandler_FindControlPointClosestToPawn, ReturnValue) == 0x000010, "Member 'HDAICaptureHandler_FindControlPointClosestToPawn::ReturnValue' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.FindControlPointRandom
// 0x0018 (0x0018 - 0x0000)
struct HDAICaptureHandler_FindControlPointRandom final
{
public:
	TArray<class AHDBaseCapturePoint*>            CPs;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHDBaseCapturePoint*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDAICaptureHandler_FindControlPointRandom) == 0x000008, "Wrong alignment on HDAICaptureHandler_FindControlPointRandom");
static_assert(sizeof(HDAICaptureHandler_FindControlPointRandom) == 0x000018, "Wrong size on HDAICaptureHandler_FindControlPointRandom");
static_assert(offsetof(HDAICaptureHandler_FindControlPointRandom, CPs) == 0x000000, "Member 'HDAICaptureHandler_FindControlPointRandom::CPs' has a wrong offset!");
static_assert(offsetof(HDAICaptureHandler_FindControlPointRandom, ReturnValue) == 0x000010, "Member 'HDAICaptureHandler_FindControlPointRandom::ReturnValue' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.FindControlPointToCapture
// 0x0010 (0x0010 - 0x0000)
struct HDAICaptureHandler_FindControlPointToCapture final
{
public:
	class AHDBaseCapturePoint*                    OutFoundCP;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HDAICaptureHandler_FindControlPointToCapture) == 0x000008, "Wrong alignment on HDAICaptureHandler_FindControlPointToCapture");
static_assert(sizeof(HDAICaptureHandler_FindControlPointToCapture) == 0x000010, "Wrong size on HDAICaptureHandler_FindControlPointToCapture");
static_assert(offsetof(HDAICaptureHandler_FindControlPointToCapture, OutFoundCP) == 0x000000, "Member 'HDAICaptureHandler_FindControlPointToCapture::OutFoundCP' has a wrong offset!");
static_assert(offsetof(HDAICaptureHandler_FindControlPointToCapture, ReturnValue) == 0x000008, "Member 'HDAICaptureHandler_FindControlPointToCapture::ReturnValue' has a wrong offset!");

// Function HDMain.HDAICaptureHandler.GetStartSpotClosestToControlPoint
// 0x0010 (0x0010 - 0x0000)
struct HDAICaptureHandler_GetStartSpotClosestToControlPoint final
{
public:
	class AActor*                                 InCapturePoint;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HDAICaptureHandler_GetStartSpotClosestToControlPoint) == 0x000008, "Wrong alignment on HDAICaptureHandler_GetStartSpotClosestToControlPoint");
static_assert(sizeof(HDAICaptureHandler_GetStartSpotClosestToControlPoint) == 0x000010, "Wrong size on HDAICaptureHandler_GetStartSpotClosestToControlPoint");
