#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TinkerUI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "SlateCore_classes.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class TinkerUI.TBButton
// 0x0038 (0x0460 - 0x0428)
class UTBButton final : public UButton
{
public:
	FMulticastInlineDelegateProperty_             OnDoubleClicked;                                   // 0x0428(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_438[0x10];                                     // 0x0438(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         BitPad_448_0 : 2;                                  // 0x0448(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bStopDoubleClickPropagation : 1;                   // 0x0448(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_449[0x17];                                     // 0x0449(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIsFocusable(bool bInIsFocusable);
	void SetIsInteractionEnabled(bool bInIsInteractionEnabled);
	void StopDoubleClickPropagation();

	bool GetIsFocusable() const;
	bool IsInteractionEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TBButton">();
	}
	static class UTBButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTBButton>();
	}
};
static_assert(alignof(UTBButton) == 0x000008, "Wrong alignment on UTBButton");
static_assert(sizeof(UTBButton) == 0x000460, "Wrong size on UTBButton");
static_assert(offsetof(UTBButton, OnDoubleClicked) == 0x000428, "Member 'UTBButton::OnDoubleClicked' has a wrong offset!");

// Class TinkerUI.TBListView
// 0x0010 (0x0378 - 0x0368)
class UTBListView final : public UListView
{
public:
	FMulticastInlineDelegateProperty_             BP_OnPreviewItemCreated;                           // 0x0368(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TBListView">();
	}
	static class UTBListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTBListView>();
	}
};
static_assert(alignof(UTBListView) == 0x000008, "Wrong alignment on UTBListView");
static_assert(sizeof(UTBListView) == 0x000378, "Wrong size on UTBListView");
static_assert(offsetof(UTBListView, BP_OnPreviewItemCreated) == 0x000368, "Member 'UTBListView::BP_OnPreviewItemCreated' has a wrong offset!");

// Class TinkerUI.TBSlider
// 0x0010 (0x0508 - 0x04F8)
class UTBSlider final : public USlider
{
public:
	struct FLinearColor                           SliderFgBarColor;                                  // 0x04F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetMouseUsesStep(bool bInValue);
	void SetSliderFgBarColor(const struct FLinearColor& InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TBSlider">();
	}
	static class UTBSlider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTBSlider>();
	}
};
static_assert(alignof(UTBSlider) == 0x000008, "Wrong alignment on UTBSlider");
static_assert(sizeof(UTBSlider) == 0x000508, "Wrong size on UTBSlider");
static_assert(offsetof(UTBSlider, SliderFgBarColor) == 0x0004F8, "Member 'UTBSlider::SliderFgBarColor' has a wrong offset!");

// Class TinkerUI.TBSliderWidgetStyle
// 0x0340 (0x0370 - 0x0030)
class UTBSliderWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FSliderStyle                           SliderStyle;                                       // 0x0030(0x0340)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TBSliderWidgetStyle">();
	}
	static class UTBSliderWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTBSliderWidgetStyle>();
	}
};
static_assert(alignof(UTBSliderWidgetStyle) == 0x000008, "Wrong alignment on UTBSliderWidgetStyle");
static_assert(sizeof(UTBSliderWidgetStyle) == 0x000370, "Wrong size on UTBSliderWidgetStyle");
static_assert(offsetof(UTBSliderWidgetStyle, SliderStyle) == 0x000030, "Member 'UTBSliderWidgetStyle::SliderStyle' has a wrong offset!");

}

