#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TinkerLoadingScreen

#include "Basic.hpp"

#include "TinkerLoadingScreen_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class TinkerLoadingScreen.LoadingScreenSettings
// 0x0078 (0x00B0 - 0x0038)
class ULoadingScreenSettings final : public UDeveloperSettings
{
public:
	uint8                                         bUseStartupScreen : 1;                             // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLoadingScreenDescription              StartupScreen;                                     // 0x0040(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FLoadingScreenDescription              DefaultScreen;                                     // 0x0078(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LoadingScreenSettings">();
	}
	static class ULoadingScreenSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingScreenSettings>();
	}
};
static_assert(alignof(ULoadingScreenSettings) == 0x000008, "Wrong alignment on ULoadingScreenSettings");
static_assert(sizeof(ULoadingScreenSettings) == 0x0000B0, "Wrong size on ULoadingScreenSettings");
static_assert(offsetof(ULoadingScreenSettings, StartupScreen) == 0x000040, "Member 'ULoadingScreenSettings::StartupScreen' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, DefaultScreen) == 0x000078, "Member 'ULoadingScreenSettings::DefaultScreen' has a wrong offset!");

// Class TinkerLoadingScreen.LoadingScreenWidgetInterface
// 0x0000 (0x0028 - 0x0028)
class ILoadingScreenWidgetInterface final : public IInterface
{
public:
	void SetLevelLoadData(const struct FLoadScreenLevelData& LevelData);
	void SetLoadingScreenDescription(const struct FLoadingScreenDescription& Description);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LoadingScreenWidgetInterface">();
	}
	static class ILoadingScreenWidgetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILoadingScreenWidgetInterface>();
	}
};
static_assert(alignof(ILoadingScreenWidgetInterface) == 0x000008, "Wrong alignment on ILoadingScreenWidgetInterface");
static_assert(sizeof(ILoadingScreenWidgetInterface) == 0x000028, "Wrong size on ILoadingScreenWidgetInterface");

}

