#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tinkerbox

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Tinkerbox.TBGameInstance.LoadMainMenu
// 0x0001 (0x0001 - 0x0000)
struct TBGameInstance_LoadMainMenu final
{
public:
	bool                                          bExclusive;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameInstance_LoadMainMenu) == 0x000001, "Wrong alignment on TBGameInstance_LoadMainMenu");
static_assert(sizeof(TBGameInstance_LoadMainMenu) == 0x000001, "Wrong size on TBGameInstance_LoadMainMenu");
static_assert(offsetof(TBGameInstance_LoadMainMenu, bExclusive) == 0x000000, "Member 'TBGameInstance_LoadMainMenu::bExclusive' has a wrong offset!");

// Function Tinkerbox.TBGameInstance.GetCurrentSessionHostAddressStr
// 0x0018 (0x0018 - 0x0000)
struct TBGameInstance_GetCurrentSessionHostAddressStr final
{
public:
	class FString                                 OutHostAddrStr;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreferSteamP2PAddr;                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAppendPort;                                       // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TBGameInstance_GetCurrentSessionHostAddressStr) == 0x000008, "Wrong alignment on TBGameInstance_GetCurrentSessionHostAddressStr");
static_assert(sizeof(TBGameInstance_GetCurrentSessionHostAddressStr) == 0x000018, "Wrong size on TBGameInstance_GetCurrentSessionHostAddressStr");
static_assert(offsetof(TBGameInstance_GetCurrentSessionHostAddressStr, OutHostAddrStr) == 0x000000, "Member 'TBGameInstance_GetCurrentSessionHostAddressStr::OutHostAddrStr' has a wrong offset!");
static_assert(offsetof(TBGameInstance_GetCurrentSessionHostAddressStr, bPreferSteamP2PAddr) == 0x000010, "Member 'TBGameInstance_GetCurrentSessionHostAddressStr::bPreferSteamP2PAddr' has a wrong offset!");
static_assert(offsetof(TBGameInstance_GetCurrentSessionHostAddressStr, bAppendPort) == 0x000011, "Member 'TBGameInstance_GetCurrentSessionHostAddressStr::bAppendPort' has a wrong offset!");
static_assert(offsetof(TBGameInstance_GetCurrentSessionHostAddressStr, ReturnValue) == 0x000012, "Member 'TBGameInstance_GetCurrentSessionHostAddressStr::ReturnValue' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.EnableHeadphoneMode
// 0x0001 (0x0001 - 0x0000)
struct TBGameUserSettings_EnableHeadphoneMode final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_EnableHeadphoneMode) == 0x000001, "Wrong alignment on TBGameUserSettings_EnableHeadphoneMode");
static_assert(sizeof(TBGameUserSettings_EnableHeadphoneMode) == 0x000001, "Wrong size on TBGameUserSettings_EnableHeadphoneMode");
static_assert(offsetof(TBGameUserSettings_EnableHeadphoneMode, bEnabled) == 0x000000, "Member 'TBGameUserSettings_EnableHeadphoneMode::bEnabled' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.FirstRunHardwareBenchmark
// 0x0010 (0x0010 - 0x0000)
struct TBGameUserSettings_FirstRunHardwareBenchmark final
{
public:
	int32                                         WorkScale;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CPUMultiplier;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GPUMultiplier;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TBGameUserSettings_FirstRunHardwareBenchmark) == 0x000004, "Wrong alignment on TBGameUserSettings_FirstRunHardwareBenchmark");
static_assert(sizeof(TBGameUserSettings_FirstRunHardwareBenchmark) == 0x000010, "Wrong size on TBGameUserSettings_FirstRunHardwareBenchmark");
static_assert(offsetof(TBGameUserSettings_FirstRunHardwareBenchmark, WorkScale) == 0x000000, "Member 'TBGameUserSettings_FirstRunHardwareBenchmark::WorkScale' has a wrong offset!");
static_assert(offsetof(TBGameUserSettings_FirstRunHardwareBenchmark, CPUMultiplier) == 0x000004, "Member 'TBGameUserSettings_FirstRunHardwareBenchmark::CPUMultiplier' has a wrong offset!");
static_assert(offsetof(TBGameUserSettings_FirstRunHardwareBenchmark, GPUMultiplier) == 0x000008, "Member 'TBGameUserSettings_FirstRunHardwareBenchmark::GPUMultiplier' has a wrong offset!");
static_assert(offsetof(TBGameUserSettings_FirstRunHardwareBenchmark, ReturnValue) == 0x00000C, "Member 'TBGameUserSettings_FirstRunHardwareBenchmark::ReturnValue' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.IsPlayerChangingKeyBindings
// 0x0001 (0x0001 - 0x0000)
struct TBGameUserSettings_IsPlayerChangingKeyBindings final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_IsPlayerChangingKeyBindings) == 0x000001, "Wrong alignment on TBGameUserSettings_IsPlayerChangingKeyBindings");
static_assert(sizeof(TBGameUserSettings_IsPlayerChangingKeyBindings) == 0x000001, "Wrong size on TBGameUserSettings_IsPlayerChangingKeyBindings");
static_assert(offsetof(TBGameUserSettings_IsPlayerChangingKeyBindings, ReturnValue) == 0x000000, "Member 'TBGameUserSettings_IsPlayerChangingKeyBindings::ReturnValue' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetAimDownSightsKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetAimDownSightsKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetAimDownSightsKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetAimDownSightsKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetAimDownSightsKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetAimDownSightsKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetAimDownSightsKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetAimDownSightsKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetAimDownSightsToggleKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetAimDownSightsToggleKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetAimDownSightsToggleKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetAimDownSightsToggleKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetAimDownSightsToggleKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetAimDownSightsToggleKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetAimDownSightsToggleKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetAimDownSightsToggleKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetAllowSoundInBackground
// 0x0001 (0x0001 - 0x0000)
struct TBGameUserSettings_SetAllowSoundInBackground final
{
public:
	bool                                          bAllow;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetAllowSoundInBackground) == 0x000001, "Wrong alignment on TBGameUserSettings_SetAllowSoundInBackground");
static_assert(sizeof(TBGameUserSettings_SetAllowSoundInBackground) == 0x000001, "Wrong size on TBGameUserSettings_SetAllowSoundInBackground");
static_assert(offsetof(TBGameUserSettings_SetAllowSoundInBackground, bAllow) == 0x000000, "Member 'TBGameUserSettings_SetAllowSoundInBackground::bAllow' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetCameraToggleKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetCameraToggleKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetCameraToggleKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetCameraToggleKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetCameraToggleKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetCameraToggleKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetCameraToggleKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetCameraToggleKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetChatHistoryKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetChatHistoryKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetChatHistoryKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetChatHistoryKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetChatHistoryKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetChatHistoryKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetChatHistoryKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetChatHistoryKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetConsoleKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetConsoleKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetConsoleKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetConsoleKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetConsoleKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetConsoleKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetConsoleKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetConsoleKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetCrouchKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetCrouchKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetCrouchKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetCrouchKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetCrouchKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetCrouchKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetCrouchKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetCrouchKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetCrouchToggleKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetCrouchToggleKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetCrouchToggleKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetCrouchToggleKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetCrouchToggleKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetCrouchToggleKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetCrouchToggleKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetCrouchToggleKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetCycleWeaponSightsKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetCycleWeaponSightsKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetCycleWeaponSightsKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetCycleWeaponSightsKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetCycleWeaponSightsKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetCycleWeaponSightsKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetCycleWeaponSightsKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetCycleWeaponSightsKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetDeployMenuKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetDeployMenuKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetDeployMenuKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetDeployMenuKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetDeployMenuKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetDeployMenuKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetDeployMenuKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetDeployMenuKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetDialogueVolumeLevel
// 0x0004 (0x0004 - 0x0000)
struct TBGameUserSettings_SetDialogueVolumeLevel final
{
public:
	float                                         DialogueVolume;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetDialogueVolumeLevel) == 0x000004, "Wrong alignment on TBGameUserSettings_SetDialogueVolumeLevel");
static_assert(sizeof(TBGameUserSettings_SetDialogueVolumeLevel) == 0x000004, "Wrong size on TBGameUserSettings_SetDialogueVolumeLevel");
static_assert(offsetof(TBGameUserSettings_SetDialogueVolumeLevel, DialogueVolume) == 0x000000, "Member 'TBGameUserSettings_SetDialogueVolumeLevel::DialogueVolume' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetDialogueVolumeLevelNormalized
// 0x0004 (0x0004 - 0x0000)
struct TBGameUserSettings_SetDialogueVolumeLevelNormalized final
{
public:
	float                                         NormDialogueVolume;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetDialogueVolumeLevelNormalized) == 0x000004, "Wrong alignment on TBGameUserSettings_SetDialogueVolumeLevelNormalized");
static_assert(sizeof(TBGameUserSettings_SetDialogueVolumeLevelNormalized) == 0x000004, "Wrong size on TBGameUserSettings_SetDialogueVolumeLevelNormalized");
static_assert(offsetof(TBGameUserSettings_SetDialogueVolumeLevelNormalized, NormDialogueVolume) == 0x000000, "Member 'TBGameUserSettings_SetDialogueVolumeLevelNormalized::NormDialogueVolume' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetDisplayGamma
// 0x0004 (0x0004 - 0x0000)
struct TBGameUserSettings_SetDisplayGamma final
{
public:
	float                                         NewGamma;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetDisplayGamma) == 0x000004, "Wrong alignment on TBGameUserSettings_SetDisplayGamma");
static_assert(sizeof(TBGameUserSettings_SetDisplayGamma) == 0x000004, "Wrong size on TBGameUserSettings_SetDisplayGamma");
static_assert(offsetof(TBGameUserSettings_SetDisplayGamma, NewGamma) == 0x000000, "Member 'TBGameUserSettings_SetDisplayGamma::NewGamma' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetFieldOfView
// 0x0004 (0x0004 - 0x0000)
struct TBGameUserSettings_SetFieldOfView final
{
public:
	float                                         NewFOV;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetFieldOfView) == 0x000004, "Wrong alignment on TBGameUserSettings_SetFieldOfView");
static_assert(sizeof(TBGameUserSettings_SetFieldOfView) == 0x000004, "Wrong size on TBGameUserSettings_SetFieldOfView");
static_assert(offsetof(TBGameUserSettings_SetFieldOfView, NewFOV) == 0x000000, "Member 'TBGameUserSettings_SetFieldOfView::NewFOV' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetFireKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetFireKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetFireKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetFireKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetFireKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetFireKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetFireKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetFireKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetInvertMousePitch
// 0x0001 (0x0001 - 0x0000)
struct TBGameUserSettings_SetInvertMousePitch final
{
public:
	bool                                          bInvertPitch;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetInvertMousePitch) == 0x000001, "Wrong alignment on TBGameUserSettings_SetInvertMousePitch");
static_assert(sizeof(TBGameUserSettings_SetInvertMousePitch) == 0x000001, "Wrong size on TBGameUserSettings_SetInvertMousePitch");
static_assert(offsetof(TBGameUserSettings_SetInvertMousePitch, bInvertPitch) == 0x000000, "Member 'TBGameUserSettings_SetInvertMousePitch::bInvertPitch' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetJumpKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetJumpKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetJumpKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetJumpKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetJumpKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetJumpKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetJumpKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetJumpKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetJumpVaultKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetJumpVaultKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetJumpVaultKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetJumpVaultKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetJumpVaultKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetJumpVaultKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetJumpVaultKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetJumpVaultKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetLeanLeftKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetLeanLeftKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetLeanLeftKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetLeanLeftKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetLeanLeftKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetLeanLeftKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetLeanLeftKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetLeanLeftKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetLeanLeftToggleKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetLeanLeftToggleKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetLeanLeftToggleKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetLeanLeftToggleKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetLeanLeftToggleKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetLeanLeftToggleKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetLeanLeftToggleKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetLeanLeftToggleKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetLeanRightKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetLeanRightKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetLeanRightKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetLeanRightKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetLeanRightKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetLeanRightKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetLeanRightKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetLeanRightKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetLeanRightToggleKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetLeanRightToggleKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetLeanRightToggleKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetLeanRightToggleKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetLeanRightToggleKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetLeanRightToggleKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetLeanRightToggleKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetLeanRightToggleKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetMasterVolumeLevel
// 0x0004 (0x0004 - 0x0000)
struct TBGameUserSettings_SetMasterVolumeLevel final
{
public:
	float                                         MasterVolume;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetMasterVolumeLevel) == 0x000004, "Wrong alignment on TBGameUserSettings_SetMasterVolumeLevel");
static_assert(sizeof(TBGameUserSettings_SetMasterVolumeLevel) == 0x000004, "Wrong size on TBGameUserSettings_SetMasterVolumeLevel");
static_assert(offsetof(TBGameUserSettings_SetMasterVolumeLevel, MasterVolume) == 0x000000, "Member 'TBGameUserSettings_SetMasterVolumeLevel::MasterVolume' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetMasterVolumeLevelNormalized
// 0x0004 (0x0004 - 0x0000)
struct TBGameUserSettings_SetMasterVolumeLevelNormalized final
{
public:
	float                                         NormMasterVolume;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetMasterVolumeLevelNormalized) == 0x000004, "Wrong alignment on TBGameUserSettings_SetMasterVolumeLevelNormalized");
static_assert(sizeof(TBGameUserSettings_SetMasterVolumeLevelNormalized) == 0x000004, "Wrong size on TBGameUserSettings_SetMasterVolumeLevelNormalized");
static_assert(offsetof(TBGameUserSettings_SetMasterVolumeLevelNormalized, NormMasterVolume) == 0x000000, "Member 'TBGameUserSettings_SetMasterVolumeLevelNormalized::NormMasterVolume' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetMotionBlurEnabled
// 0x0001 (0x0001 - 0x0000)
struct TBGameUserSettings_SetMotionBlurEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetMotionBlurEnabled) == 0x000001, "Wrong alignment on TBGameUserSettings_SetMotionBlurEnabled");
static_assert(sizeof(TBGameUserSettings_SetMotionBlurEnabled) == 0x000001, "Wrong size on TBGameUserSettings_SetMotionBlurEnabled");
static_assert(offsetof(TBGameUserSettings_SetMotionBlurEnabled, bEnabled) == 0x000000, "Member 'TBGameUserSettings_SetMotionBlurEnabled::bEnabled' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetMouseSensitivity
// 0x0008 (0x0008 - 0x0000)
struct TBGameUserSettings_SetMouseSensitivity final
{
public:
	float                                         SensitivityX;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SensitivityY;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetMouseSensitivity) == 0x000004, "Wrong alignment on TBGameUserSettings_SetMouseSensitivity");
static_assert(sizeof(TBGameUserSettings_SetMouseSensitivity) == 0x000008, "Wrong size on TBGameUserSettings_SetMouseSensitivity");
static_assert(offsetof(TBGameUserSettings_SetMouseSensitivity, SensitivityX) == 0x000000, "Member 'TBGameUserSettings_SetMouseSensitivity::SensitivityX' has a wrong offset!");
static_assert(offsetof(TBGameUserSettings_SetMouseSensitivity, SensitivityY) == 0x000004, "Member 'TBGameUserSettings_SetMouseSensitivity::SensitivityY' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetMouseSensitivityNormalized
// 0x0008 (0x0008 - 0x0000)
struct TBGameUserSettings_SetMouseSensitivityNormalized final
{
public:
	float                                         NormSensitivityX;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormSensitivityY;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetMouseSensitivityNormalized) == 0x000004, "Wrong alignment on TBGameUserSettings_SetMouseSensitivityNormalized");
static_assert(sizeof(TBGameUserSettings_SetMouseSensitivityNormalized) == 0x000008, "Wrong size on TBGameUserSettings_SetMouseSensitivityNormalized");
static_assert(offsetof(TBGameUserSettings_SetMouseSensitivityNormalized, NormSensitivityX) == 0x000000, "Member 'TBGameUserSettings_SetMouseSensitivityNormalized::NormSensitivityX' has a wrong offset!");
static_assert(offsetof(TBGameUserSettings_SetMouseSensitivityNormalized, NormSensitivityY) == 0x000004, "Member 'TBGameUserSettings_SetMouseSensitivityNormalized::NormSensitivityY' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetMoveBackwardKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetMoveBackwardKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetMoveBackwardKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetMoveBackwardKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetMoveBackwardKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetMoveBackwardKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetMoveBackwardKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetMoveBackwardKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetMoveForwardKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetMoveForwardKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetMoveForwardKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetMoveForwardKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetMoveForwardKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetMoveForwardKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetMoveForwardKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetMoveForwardKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetMoveLeftKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetMoveLeftKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetMoveLeftKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetMoveLeftKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetMoveLeftKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetMoveLeftKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetMoveLeftKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetMoveLeftKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetMoveRightKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetMoveRightKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetMoveRightKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetMoveRightKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetMoveRightKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetMoveRightKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetMoveRightKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetMoveRightKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetMusicVolumeLevel
// 0x0004 (0x0004 - 0x0000)
struct TBGameUserSettings_SetMusicVolumeLevel final
{
public:
	float                                         MusicVolume;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetMusicVolumeLevel) == 0x000004, "Wrong alignment on TBGameUserSettings_SetMusicVolumeLevel");
static_assert(sizeof(TBGameUserSettings_SetMusicVolumeLevel) == 0x000004, "Wrong size on TBGameUserSettings_SetMusicVolumeLevel");
static_assert(offsetof(TBGameUserSettings_SetMusicVolumeLevel, MusicVolume) == 0x000000, "Member 'TBGameUserSettings_SetMusicVolumeLevel::MusicVolume' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetMusicVolumeLevelNormalized
// 0x0004 (0x0004 - 0x0000)
struct TBGameUserSettings_SetMusicVolumeLevelNormalized final
{
public:
	float                                         NormMusicVolume;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetMusicVolumeLevelNormalized) == 0x000004, "Wrong alignment on TBGameUserSettings_SetMusicVolumeLevelNormalized");
static_assert(sizeof(TBGameUserSettings_SetMusicVolumeLevelNormalized) == 0x000004, "Wrong size on TBGameUserSettings_SetMusicVolumeLevelNormalized");
static_assert(offsetof(TBGameUserSettings_SetMusicVolumeLevelNormalized, NormMusicVolume) == 0x000000, "Member 'TBGameUserSettings_SetMusicVolumeLevelNormalized::NormMusicVolume' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetNextItemKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetNextItemKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetNextItemKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetNextItemKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetNextItemKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetNextItemKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetNextItemKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetNextItemKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetPlayerIsChangingKeyBindings
// 0x0001 (0x0001 - 0x0000)
struct TBGameUserSettings_SetPlayerIsChangingKeyBindings final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetPlayerIsChangingKeyBindings) == 0x000001, "Wrong alignment on TBGameUserSettings_SetPlayerIsChangingKeyBindings");
static_assert(sizeof(TBGameUserSettings_SetPlayerIsChangingKeyBindings) == 0x000001, "Wrong size on TBGameUserSettings_SetPlayerIsChangingKeyBindings");
static_assert(offsetof(TBGameUserSettings_SetPlayerIsChangingKeyBindings, NewValue) == 0x000000, "Member 'TBGameUserSettings_SetPlayerIsChangingKeyBindings::NewValue' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetPointAimToggleKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetPointAimToggleKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetPointAimToggleKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetPointAimToggleKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetPointAimToggleKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetPointAimToggleKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetPointAimToggleKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetPointAimToggleKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetPreviousItemKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetPreviousItemKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetPreviousItemKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetPreviousItemKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetPreviousItemKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetPreviousItemKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetPreviousItemKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetPreviousItemKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetProneKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetProneKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetProneKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetProneKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetProneKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetProneKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetProneKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetProneKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetPushToTalkCommandKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetPushToTalkCommandKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetPushToTalkCommandKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetPushToTalkCommandKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetPushToTalkCommandKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetPushToTalkCommandKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetPushToTalkCommandKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetPushToTalkCommandKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetPushToTalkLocalKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetPushToTalkLocalKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetPushToTalkLocalKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetPushToTalkLocalKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetPushToTalkLocalKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetPushToTalkLocalKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetPushToTalkLocalKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetPushToTalkLocalKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetPushToTalkSquadKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetPushToTalkSquadKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetPushToTalkSquadKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetPushToTalkSquadKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetPushToTalkSquadKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetPushToTalkSquadKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetPushToTalkSquadKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetPushToTalkSquadKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetRadialMenuKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetRadialMenuKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetRadialMenuKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetRadialMenuKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetRadialMenuKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetRadialMenuKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetRadialMenuKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetRadialMenuKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetReloadKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetReloadKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetReloadKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetReloadKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetReloadKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetReloadKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetReloadKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetReloadKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetSayAllKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetSayAllKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetSayAllKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetSayAllKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetSayAllKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetSayAllKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetSayAllKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetSayAllKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetSaySquadKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetSaySquadKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetSaySquadKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetSaySquadKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetSaySquadKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetSaySquadKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetSaySquadKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetSaySquadKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetSayTeamKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetSayTeamKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetSayTeamKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetSayTeamKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetSayTeamKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetSayTeamKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetSayTeamKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetSayTeamKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetShowScoreboardKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetShowScoreboardKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetShowScoreboardKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetShowScoreboardKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetShowScoreboardKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetShowScoreboardKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetShowScoreboardKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetShowScoreboardKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetSmoothFrameRateEnabled
// 0x0001 (0x0001 - 0x0000)
struct TBGameUserSettings_SetSmoothFrameRateEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetSmoothFrameRateEnabled) == 0x000001, "Wrong alignment on TBGameUserSettings_SetSmoothFrameRateEnabled");
static_assert(sizeof(TBGameUserSettings_SetSmoothFrameRateEnabled) == 0x000001, "Wrong size on TBGameUserSettings_SetSmoothFrameRateEnabled");
static_assert(offsetof(TBGameUserSettings_SetSmoothFrameRateEnabled, bEnabled) == 0x000000, "Member 'TBGameUserSettings_SetSmoothFrameRateEnabled::bEnabled' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetSmoothMouseEnabled
// 0x0001 (0x0001 - 0x0000)
struct TBGameUserSettings_SetSmoothMouseEnabled final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetSmoothMouseEnabled) == 0x000001, "Wrong alignment on TBGameUserSettings_SetSmoothMouseEnabled");
static_assert(sizeof(TBGameUserSettings_SetSmoothMouseEnabled) == 0x000001, "Wrong size on TBGameUserSettings_SetSmoothMouseEnabled");
static_assert(offsetof(TBGameUserSettings_SetSmoothMouseEnabled, bEnable) == 0x000000, "Member 'TBGameUserSettings_SetSmoothMouseEnabled::bEnable' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetSoundEffectsVolumeLevel
// 0x0004 (0x0004 - 0x0000)
struct TBGameUserSettings_SetSoundEffectsVolumeLevel final
{
public:
	float                                         SFXVolume;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetSoundEffectsVolumeLevel) == 0x000004, "Wrong alignment on TBGameUserSettings_SetSoundEffectsVolumeLevel");
static_assert(sizeof(TBGameUserSettings_SetSoundEffectsVolumeLevel) == 0x000004, "Wrong size on TBGameUserSettings_SetSoundEffectsVolumeLevel");
static_assert(offsetof(TBGameUserSettings_SetSoundEffectsVolumeLevel, SFXVolume) == 0x000000, "Member 'TBGameUserSettings_SetSoundEffectsVolumeLevel::SFXVolume' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetSoundEffectsVolumeLevelNormalized
// 0x0004 (0x0004 - 0x0000)
struct TBGameUserSettings_SetSoundEffectsVolumeLevelNormalized final
{
public:
	float                                         NormSFXVolume;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetSoundEffectsVolumeLevelNormalized) == 0x000004, "Wrong alignment on TBGameUserSettings_SetSoundEffectsVolumeLevelNormalized");
static_assert(sizeof(TBGameUserSettings_SetSoundEffectsVolumeLevelNormalized) == 0x000004, "Wrong size on TBGameUserSettings_SetSoundEffectsVolumeLevelNormalized");
static_assert(offsetof(TBGameUserSettings_SetSoundEffectsVolumeLevelNormalized, NormSFXVolume) == 0x000000, "Member 'TBGameUserSettings_SetSoundEffectsVolumeLevelNormalized::NormSFXVolume' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetSprintKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetSprintKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetSprintKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetSprintKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetSprintKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetSprintKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetSprintKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetSprintKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetSprintToggleKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetSprintToggleKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetSprintToggleKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetSprintToggleKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetSprintToggleKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetSprintToggleKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetSprintToggleKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetSprintToggleKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetSwitchFireModeKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetSwitchFireModeKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetSwitchFireModeKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetSwitchFireModeKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetSwitchFireModeKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetSwitchFireModeKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetSwitchFireModeKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetSwitchFireModeKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetSwitchFireModeOnReselect
// 0x0001 (0x0001 - 0x0000)
struct TBGameUserSettings_SetSwitchFireModeOnReselect final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetSwitchFireModeOnReselect) == 0x000001, "Wrong alignment on TBGameUserSettings_SetSwitchFireModeOnReselect");
static_assert(sizeof(TBGameUserSettings_SetSwitchFireModeOnReselect) == 0x000001, "Wrong size on TBGameUserSettings_SetSwitchFireModeOnReselect");
static_assert(offsetof(TBGameUserSettings_SetSwitchFireModeOnReselect, bEnable) == 0x000000, "Member 'TBGameUserSettings_SetSwitchFireModeOnReselect::bEnable' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetUseKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetUseKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetUseKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetUseKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetUseKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetUseKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetUseKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetUseKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetVaultKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetVaultKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetVaultKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetVaultKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetVaultKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetVaultKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetVaultKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetVaultKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetVoiceVolumeLevel
// 0x0004 (0x0004 - 0x0000)
struct TBGameUserSettings_SetVoiceVolumeLevel final
{
public:
	float                                         VoiceVolume;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetVoiceVolumeLevel) == 0x000004, "Wrong alignment on TBGameUserSettings_SetVoiceVolumeLevel");
static_assert(sizeof(TBGameUserSettings_SetVoiceVolumeLevel) == 0x000004, "Wrong size on TBGameUserSettings_SetVoiceVolumeLevel");
static_assert(offsetof(TBGameUserSettings_SetVoiceVolumeLevel, VoiceVolume) == 0x000000, "Member 'TBGameUserSettings_SetVoiceVolumeLevel::VoiceVolume' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetVoiceVolumeLevelNormalized
// 0x0004 (0x0004 - 0x0000)
struct TBGameUserSettings_SetVoiceVolumeLevelNormalized final
{
public:
	float                                         NormVoiceVolume;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetVoiceVolumeLevelNormalized) == 0x000004, "Wrong alignment on TBGameUserSettings_SetVoiceVolumeLevelNormalized");
static_assert(sizeof(TBGameUserSettings_SetVoiceVolumeLevelNormalized) == 0x000004, "Wrong size on TBGameUserSettings_SetVoiceVolumeLevelNormalized");
static_assert(offsetof(TBGameUserSettings_SetVoiceVolumeLevelNormalized, NormVoiceVolume) == 0x000000, "Member 'TBGameUserSettings_SetVoiceVolumeLevelNormalized::NormVoiceVolume' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetVoteNoKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetVoteNoKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetVoteNoKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetVoteNoKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetVoteNoKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetVoteNoKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetVoteNoKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetVoteNoKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetVoteYesKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetVoteYesKeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetVoteYesKeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetVoteYesKeyBinding");
static_assert(sizeof(TBGameUserSettings_SetVoteYesKeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetVoteYesKeyBinding");
static_assert(offsetof(TBGameUserSettings_SetVoteYesKeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetVoteYesKeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetWeaponSlot0KeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetWeaponSlot0KeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetWeaponSlot0KeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetWeaponSlot0KeyBinding");
static_assert(sizeof(TBGameUserSettings_SetWeaponSlot0KeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetWeaponSlot0KeyBinding");
static_assert(offsetof(TBGameUserSettings_SetWeaponSlot0KeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetWeaponSlot0KeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetWeaponSlot1KeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetWeaponSlot1KeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetWeaponSlot1KeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetWeaponSlot1KeyBinding");
static_assert(sizeof(TBGameUserSettings_SetWeaponSlot1KeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetWeaponSlot1KeyBinding");
static_assert(offsetof(TBGameUserSettings_SetWeaponSlot1KeyBinding, NewKey) == 0x000000, "Member 'TBGameUserSettings_SetWeaponSlot1KeyBinding::NewKey' has a wrong offset!");

// Function Tinkerbox.TBGameUserSettings.SetWeaponSlot2KeyBinding
// 0x0020 (0x0020 - 0x0000)
struct TBGameUserSettings_SetWeaponSlot2KeyBinding final
{
public:
	struct FInputChord                            NewKey;                                            // 0x0000(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TBGameUserSettings_SetWeaponSlot2KeyBinding) == 0x000008, "Wrong alignment on TBGameUserSettings_SetWeaponSlot2KeyBinding");
static_assert(sizeof(TBGameUserSettings_SetWeaponSlot2KeyBinding) == 0x000020, "Wrong size on TBGameUserSettings_SetWeaponSlot2KeyBinding");
