#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleAnimationBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "PhysXVehicles_structs.hpp"
#include "PhysXVehicles_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass VehicleAnimationBlueprint.VehicleAnimationBlueprint_C
// 0x2F10 (0x3890 - 0x0980)
class UVehicleAnimationBlueprint_C final : public UVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0980(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0988(0x0030)()
	struct FAnimNode_WheelHandler                 AnimGraphNode_WheelHandler;                        // 0x09B8(0x00E0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0A98(0x0020)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x0AB8(0x0010)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_19;                         // 0x0AC8(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_18;                         // 0x0BB8(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_17;                         // 0x0CA8(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_16;                         // 0x0D98(0x00F0)()
	uint8                                         Pad_E88[0x8];                                      // 0x0E88(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_15;                           // 0x0E90(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_14;                           // 0x1040(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_13;                           // 0x11F0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_12;                           // 0x13A0(0x01B0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_15;                         // 0x1550(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_14;                         // 0x1640(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_13;                         // 0x1730(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_12;                         // 0x1820(0x00F0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_11;                           // 0x1910(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_10;                           // 0x1AC0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_9;                            // 0x1C70(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_8;                            // 0x1E20(0x01B0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_11;                         // 0x1FD0(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_10;                         // 0x20C0(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_9;                          // 0x21B0(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_8;                          // 0x22A0(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_7;                          // 0x2390(0x00F0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_7;                            // 0x2480(0x01B0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_6;                          // 0x2630(0x00F0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_6;                            // 0x2720(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_5;                            // 0x28D0(0x01B0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_5;                          // 0x2A80(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_4;                          // 0x2B70(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3;                          // 0x2C60(0x00F0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_4;                            // 0x2D50(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_3;                            // 0x2F00(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2;                            // 0x30B0(0x01B0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2;                          // 0x3260(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x3350(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x3440(0x00F0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x3530(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x36E0(0x01B0)()

public:
	void ExecuteUbergraph_VehicleAnimationBlueprint(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VehicleAnimationBlueprint_C">();
	}
	static class UVehicleAnimationBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleAnimationBlueprint_C>();
	}
};
static_assert(alignof(UVehicleAnimationBlueprint_C) == 0x000010, "Wrong alignment on UVehicleAnimationBlueprint_C");
static_assert(sizeof(UVehicleAnimationBlueprint_C) == 0x003890, "Wrong size on UVehicleAnimationBlueprint_C");
static_assert(offsetof(UVehicleAnimationBlueprint_C, UberGraphFrame) == 0x000980, "Member 'UVehicleAnimationBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_Root) == 0x000988, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_WheelHandler) == 0x0009B8, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_WheelHandler' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000A98, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_MeshRefPose) == 0x000AB8, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_MeshRefPose' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_19) == 0x000AC8, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_19' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_18) == 0x000BB8, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_18' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_17) == 0x000CA8, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_17' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_16) == 0x000D98, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_16' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_15) == 0x000E90, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_15' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_14) == 0x001040, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_14' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_13) == 0x0011F0, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_13' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_12) == 0x0013A0, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_12' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_15) == 0x001550, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_15' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_14) == 0x001640, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_14' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_13) == 0x001730, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_13' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_12) == 0x001820, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_12' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_11) == 0x001910, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_11' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_10) == 0x001AC0, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_10' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_9) == 0x001C70, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_9' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_8) == 0x001E20, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_8' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_11) == 0x001FD0, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_11' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_10) == 0x0020C0, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_10' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_9) == 0x0021B0, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_9' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_8) == 0x0022A0, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_8' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_7) == 0x002390, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_7' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_7) == 0x002480, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_7' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_6) == 0x002630, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_6' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_6) == 0x002720, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_6' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_5) == 0x0028D0, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_5' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_5) == 0x002A80, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_5' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_4) == 0x002B70, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_4' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_3) == 0x002C60, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_3' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_4) == 0x002D50, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_4' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_3) == 0x002F00, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_3' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_2) == 0x0030B0, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_2' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_2) == 0x003260, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_2' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone_1) == 0x003350, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone_1' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_CopyBone) == 0x003440, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt_1) == 0x003530, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(UVehicleAnimationBlueprint_C, AnimGraphNode_LookAt) == 0x0036E0, "Member 'UVehicleAnimationBlueprint_C::AnimGraphNode_LookAt' has a wrong offset!");

}

