#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModifierSetting_ComboBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FModifierTextStyle_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModifierSetting_ComboBox.WBP_ModifierSetting_ComboBox_C
// 0x00F0 (0x0320 - 0x0230)
class UWBP_ModifierSetting_ComboBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxString*                        ModifierComboBox;                                  // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModifierSettingBox_C*              ModifierSetting;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SettingText;                                       // 0x0248(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FFModifierTextStyle                    SettingTextStyle;                                  // 0x0260(0x0078)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FMargin                                SettingComboBoxPadding;                            // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	TArray<class FString>                         DefaultOptions;                                    // 0x02E8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         DefaultSelectedOptionIdx;                          // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSelectionChanged;                                // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnOpening;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnSelectionChanged__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void OnOpening__DelegateSignature();
	void ExecuteUbergraph_WBP_ModifierSetting_ComboBox(int32 EntryPoint);
	void OnInitialized();
	void BndEvt__ModifierComboBox_K2Node_ComponentBoundEvent_1_OnOpeningEvent__DelegateSignature();
	void BndEvt__ModifierComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void PreConstruct(bool IsDesignTime);
	void SetSettingText(const class FText& InSettingText);
	void GetSettingText(class FText* SettingText_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModifierSetting_ComboBox_C">();
	}
	static class UWBP_ModifierSetting_ComboBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModifierSetting_ComboBox_C>();
	}
};
static_assert(alignof(UWBP_ModifierSetting_ComboBox_C) == 0x000008, "Wrong alignment on UWBP_ModifierSetting_ComboBox_C");
static_assert(sizeof(UWBP_ModifierSetting_ComboBox_C) == 0x000320, "Wrong size on UWBP_ModifierSetting_ComboBox_C");
static_assert(offsetof(UWBP_ModifierSetting_ComboBox_C, UberGraphFrame) == 0x000230, "Member 'UWBP_ModifierSetting_ComboBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_ComboBox_C, ModifierComboBox) == 0x000238, "Member 'UWBP_ModifierSetting_ComboBox_C::ModifierComboBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_ComboBox_C, ModifierSetting) == 0x000240, "Member 'UWBP_ModifierSetting_ComboBox_C::ModifierSetting' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_ComboBox_C, SettingText) == 0x000248, "Member 'UWBP_ModifierSetting_ComboBox_C::SettingText' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_ComboBox_C, SettingTextStyle) == 0x000260, "Member 'UWBP_ModifierSetting_ComboBox_C::SettingTextStyle' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_ComboBox_C, SettingComboBoxPadding) == 0x0002D8, "Member 'UWBP_ModifierSetting_ComboBox_C::SettingComboBoxPadding' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_ComboBox_C, DefaultOptions) == 0x0002E8, "Member 'UWBP_ModifierSetting_ComboBox_C::DefaultOptions' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_ComboBox_C, DefaultSelectedOptionIdx) == 0x0002F8, "Member 'UWBP_ModifierSetting_ComboBox_C::DefaultSelectedOptionIdx' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_ComboBox_C, OnSelectionChanged) == 0x000300, "Member 'UWBP_ModifierSetting_ComboBox_C::OnSelectionChanged' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_ComboBox_C, OnOpening) == 0x000310, "Member 'UWBP_ModifierSetting_ComboBox_C::OnOpening' has a wrong offset!");

}

