#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerListEntryColumn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerListEntryColumn.WBP_ServerListEntryColumn_C
// 0x0118 (0x0348 - 0x0230)
class UWBP_ServerListEntryColumn_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               ItemSBox;                                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemSubText;                                       // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemText;                                          // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0250(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         TextMinDesiredWidth;                               // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         TextMaxStartLength;                                // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         TextMaxEndLength;                                  // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         TextFont;                                          // 0x0278(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   SubText;                                           // 0x02C8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         SubTextMinDesiredWidth;                            // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         SubTextMaxStartLength;                             // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         SubTextMaxEndLength;                               // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         ItemMinDesiredWidth;                               // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         ItemMaxDesiredWidth;                               // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         SubTextFont;                                       // 0x02F8(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ServerListEntryColumn(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetItemText(const class FText& InText);
	void SetItemSubText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerListEntryColumn_C">();
	}
	static class UWBP_ServerListEntryColumn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerListEntryColumn_C>();
	}
};
static_assert(alignof(UWBP_ServerListEntryColumn_C) == 0x000008, "Wrong alignment on UWBP_ServerListEntryColumn_C");
static_assert(sizeof(UWBP_ServerListEntryColumn_C) == 0x000348, "Wrong size on UWBP_ServerListEntryColumn_C");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, UberGraphFrame) == 0x000230, "Member 'UWBP_ServerListEntryColumn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, ItemSBox) == 0x000238, "Member 'UWBP_ServerListEntryColumn_C::ItemSBox' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, ItemSubText) == 0x000240, "Member 'UWBP_ServerListEntryColumn_C::ItemSubText' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, ItemText) == 0x000248, "Member 'UWBP_ServerListEntryColumn_C::ItemText' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, Text) == 0x000250, "Member 'UWBP_ServerListEntryColumn_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, TextMinDesiredWidth) == 0x000268, "Member 'UWBP_ServerListEntryColumn_C::TextMinDesiredWidth' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, TextMaxStartLength) == 0x00026C, "Member 'UWBP_ServerListEntryColumn_C::TextMaxStartLength' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, TextMaxEndLength) == 0x000270, "Member 'UWBP_ServerListEntryColumn_C::TextMaxEndLength' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, TextFont) == 0x000278, "Member 'UWBP_ServerListEntryColumn_C::TextFont' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, SubText) == 0x0002C8, "Member 'UWBP_ServerListEntryColumn_C::SubText' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, SubTextMinDesiredWidth) == 0x0002E0, "Member 'UWBP_ServerListEntryColumn_C::SubTextMinDesiredWidth' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, SubTextMaxStartLength) == 0x0002E4, "Member 'UWBP_ServerListEntryColumn_C::SubTextMaxStartLength' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, SubTextMaxEndLength) == 0x0002E8, "Member 'UWBP_ServerListEntryColumn_C::SubTextMaxEndLength' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, ItemMinDesiredWidth) == 0x0002EC, "Member 'UWBP_ServerListEntryColumn_C::ItemMinDesiredWidth' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, ItemMaxDesiredWidth) == 0x0002F0, "Member 'UWBP_ServerListEntryColumn_C::ItemMaxDesiredWidth' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntryColumn_C, SubTextFont) == 0x0002F8, "Member 'UWBP_ServerListEntryColumn_C::SubTextFont' has a wrong offset!");

}

