#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUDElement_TextChat_OutputListing

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUDElement_TextChat_OutputListing.WBP_HUDElement_TextChat_OutputListing_C.ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing
// 0x0138 (0x0138 - 0x0000)
struct WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0090(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0100(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHDTextChatMsgInfo*                     K2Node_CustomEvent_Msg;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing) == 0x000008, "Wrong alignment on WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing");
static_assert(sizeof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing) == 0x000138, "Wrong size on WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, EntryPoint) == 0x000000, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, CallFunc_Replace_ReturnValue) == 0x000018, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, CallFunc_GetPlayerName_ReturnValue) == 0x000040, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000090, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, K2Node_MakeArray_Array) == 0x0000F0, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, CallFunc_Format_ReturnValue) == 0x000100, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000118, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000120, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, CallFunc_IsValid_ReturnValue_1) == 0x000128, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing, K2Node_CustomEvent_Msg) == 0x000130, "Member 'WBP_HUDElement_TextChat_OutputListing_C_ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing::K2Node_CustomEvent_Msg' has a wrong offset!");

// Function WBP_HUDElement_TextChat_OutputListing.WBP_HUDElement_TextChat_OutputListing_C.SetupListing
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUDElement_TextChat_OutputListing_C_SetupListing final
{
public:
	class UHDTextChatMsgInfo*                     Msg;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDElement_TextChat_OutputListing_C_SetupListing) == 0x000008, "Wrong alignment on WBP_HUDElement_TextChat_OutputListing_C_SetupListing");
static_assert(sizeof(WBP_HUDElement_TextChat_OutputListing_C_SetupListing) == 0x000008, "Wrong size on WBP_HUDElement_TextChat_OutputListing_C_SetupListing");
static_assert(offsetof(WBP_HUDElement_TextChat_OutputListing_C_SetupListing, Msg) == 0x000000, "Member 'WBP_HUDElement_TextChat_OutputListing_C_SetupListing::Msg' has a wrong offset!");

}

