#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameModifierSettingsSection

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_GameModifierSettingsSection.WBP_GameModifierSettingsSection_C.ExecuteUbergraph_WBP_GameModifierSettingsSection
// 0x0060 (0x0060 - 0x0000)
struct WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0030(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0048(0x0018)()
};
static_assert(alignof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection) == 0x000008, "Wrong alignment on WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection");
static_assert(sizeof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection) == 0x000060, "Wrong size on WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, EntryPoint) == 0x000000, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, Temp_text_Variable) == 0x000008, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, Temp_bool_Variable) == 0x000020, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, Temp_byte_Variable) == 0x000021, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, Temp_byte_Variable_1) == 0x000022, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, K2Node_Event_IsDesignTime) == 0x000023, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, CallFunc_Not_PreBool_ReturnValue) == 0x000024, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, CallFunc_TextIsEmpty_ReturnValue) == 0x000025, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, K2Node_ComponentBoundEvent_bIsChecked) == 0x000026, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, Temp_bool_Variable_1) == 0x000027, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, K2Node_Select_Default) == 0x000028, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, K2Node_Select_Default_1) == 0x000030, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection, CallFunc_TextToUpper_ReturnValue) == 0x000048, "Member 'WBP_GameModifierSettingsSection_C_ExecuteUbergraph_WBP_GameModifierSettingsSection::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WBP_GameModifierSettingsSection.WBP_GameModifierSettingsSection_C.BndEvt__SectionActiveToggleChkBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameModifierSettingsSection_C_BndEvt__SectionActiveToggleChkBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_GameModifierSettingsSection_C_BndEvt__SectionActiveToggleChkBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_GameModifierSettingsSection_C_BndEvt__SectionActiveToggleChkBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_GameModifierSettingsSection_C_BndEvt__SectionActiveToggleChkBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_GameModifierSettingsSection_C_BndEvt__SectionActiveToggleChkBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_BndEvt__SectionActiveToggleChkBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_GameModifierSettingsSection_C_BndEvt__SectionActiveToggleChkBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_GameModifierSettingsSection.WBP_GameModifierSettingsSection_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameModifierSettingsSection_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_GameModifierSettingsSection_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GameModifierSettingsSection_C_PreConstruct");
static_assert(sizeof(WBP_GameModifierSettingsSection_C_PreConstruct) == 0x000001, "Wrong size on WBP_GameModifierSettingsSection_C_PreConstruct");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GameModifierSettingsSection_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GameModifierSettingsSection.WBP_GameModifierSettingsSection_C.SetTitleText
// 0x0030 (0x0030 - 0x0000)
struct WBP_GameModifierSettingsSection_C_SetTitleText final
{
public:
	class FText                                   InTitleText;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(WBP_GameModifierSettingsSection_C_SetTitleText) == 0x000008, "Wrong alignment on WBP_GameModifierSettingsSection_C_SetTitleText");
static_assert(sizeof(WBP_GameModifierSettingsSection_C_SetTitleText) == 0x000030, "Wrong size on WBP_GameModifierSettingsSection_C_SetTitleText");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_SetTitleText, InTitleText) == 0x000000, "Member 'WBP_GameModifierSettingsSection_C_SetTitleText::InTitleText' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_SetTitleText, CallFunc_TextToUpper_ReturnValue) == 0x000018, "Member 'WBP_GameModifierSettingsSection_C_SetTitleText::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WBP_GameModifierSettingsSection.WBP_GameModifierSettingsSection_C.SetExpansionState
// 0x0018 (0x0018 - 0x0000)
struct WBP_GameModifierSettingsSection_C_SetExpansionState final
{
public:
	bool                                          bExpanded_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameModifierSettingsSection_C_SetExpansionState) == 0x000004, "Wrong alignment on WBP_GameModifierSettingsSection_C_SetExpansionState");
static_assert(sizeof(WBP_GameModifierSettingsSection_C_SetExpansionState) == 0x000018, "Wrong size on WBP_GameModifierSettingsSection_C_SetExpansionState");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_SetExpansionState, bExpanded_0) == 0x000000, "Member 'WBP_GameModifierSettingsSection_C_SetExpansionState::bExpanded_0' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_SetExpansionState, Temp_float_Variable) == 0x000004, "Member 'WBP_GameModifierSettingsSection_C_SetExpansionState::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_SetExpansionState, Temp_float_Variable_1) == 0x000008, "Member 'WBP_GameModifierSettingsSection_C_SetExpansionState::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_SetExpansionState, Temp_bool_Variable) == 0x00000C, "Member 'WBP_GameModifierSettingsSection_C_SetExpansionState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_SetExpansionState, Temp_byte_Variable) == 0x00000D, "Member 'WBP_GameModifierSettingsSection_C_SetExpansionState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_SetExpansionState, Temp_byte_Variable_1) == 0x00000E, "Member 'WBP_GameModifierSettingsSection_C_SetExpansionState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_SetExpansionState, Temp_bool_Variable_1) == 0x00000F, "Member 'WBP_GameModifierSettingsSection_C_SetExpansionState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_SetExpansionState, K2Node_Select_Default) == 0x000010, "Member 'WBP_GameModifierSettingsSection_C_SetExpansionState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_SetExpansionState, K2Node_Select_Default_1) == 0x000014, "Member 'WBP_GameModifierSettingsSection_C_SetExpansionState::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_GameModifierSettingsSection.WBP_GameModifierSettingsSection_C.SetIsActive
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameModifierSettingsSection_C_SetIsActive final
{
public:
	bool                                          bActive_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_GameModifierSettingsSection_C_SetIsActive) == 0x000001, "Wrong alignment on WBP_GameModifierSettingsSection_C_SetIsActive");
static_assert(sizeof(WBP_GameModifierSettingsSection_C_SetIsActive) == 0x000001, "Wrong size on WBP_GameModifierSettingsSection_C_SetIsActive");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_SetIsActive, bActive_0) == 0x000000, "Member 'WBP_GameModifierSettingsSection_C_SetIsActive::bActive_0' has a wrong offset!");

// Function WBP_GameModifierSettingsSection.WBP_GameModifierSettingsSection_C.GetTitleText
// 0x0018 (0x0018 - 0x0000)
struct WBP_GameModifierSettingsSection_C_GetTitleText final
{
public:
	class FText                                   TitleText_0;                                       // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(WBP_GameModifierSettingsSection_C_GetTitleText) == 0x000008, "Wrong alignment on WBP_GameModifierSettingsSection_C_GetTitleText");
static_assert(sizeof(WBP_GameModifierSettingsSection_C_GetTitleText) == 0x000018, "Wrong size on WBP_GameModifierSettingsSection_C_GetTitleText");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_GetTitleText, TitleText_0) == 0x000000, "Member 'WBP_GameModifierSettingsSection_C_GetTitleText::TitleText_0' has a wrong offset!");

// Function WBP_GameModifierSettingsSection.WBP_GameModifierSettingsSection_C.IsExpanded
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameModifierSettingsSection_C_IsExpanded final
{
public:
	bool                                          bExpanded_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_GameModifierSettingsSection_C_IsExpanded) == 0x000001, "Wrong alignment on WBP_GameModifierSettingsSection_C_IsExpanded");
static_assert(sizeof(WBP_GameModifierSettingsSection_C_IsExpanded) == 0x000001, "Wrong size on WBP_GameModifierSettingsSection_C_IsExpanded");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_IsExpanded, bExpanded_0) == 0x000000, "Member 'WBP_GameModifierSettingsSection_C_IsExpanded::bExpanded_0' has a wrong offset!");

// Function WBP_GameModifierSettingsSection.WBP_GameModifierSettingsSection_C.IsActive
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameModifierSettingsSection_C_IsActive final
{
public:
	bool                                          bActive_0;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_GameModifierSettingsSection_C_IsActive) == 0x000001, "Wrong alignment on WBP_GameModifierSettingsSection_C_IsActive");
static_assert(sizeof(WBP_GameModifierSettingsSection_C_IsActive) == 0x000001, "Wrong size on WBP_GameModifierSettingsSection_C_IsActive");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_IsActive, bActive_0) == 0x000000, "Member 'WBP_GameModifierSettingsSection_C_IsActive::bActive_0' has a wrong offset!");

// Function WBP_GameModifierSettingsSection.WBP_GameModifierSettingsSection_C.InternalRecursiveSetContentIsEnabled
// 0x0030 (0x0030 - 0x0000)
struct WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled final
{
public:
	bool                                          bInIsEnabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CurWidget;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetContent_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue_1;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled) == 0x000008, "Wrong alignment on WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled");
static_assert(sizeof(WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled) == 0x000030, "Wrong size on WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled, bInIsEnabled) == 0x000000, "Member 'WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled::bInIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled, CurWidget) == 0x000008, "Member 'WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled::CurWidget' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled, CallFunc_GetParent_ReturnValue) == 0x000018, "Member 'WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled, CallFunc_GetContent_ReturnValue) == 0x000020, "Member 'WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled::CallFunc_GetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled, CallFunc_GetParent_ReturnValue_1) == 0x000028, "Member 'WBP_GameModifierSettingsSection_C_InternalRecursiveSetContentIsEnabled::CallFunc_GetParent_ReturnValue_1' has a wrong offset!");

}

