#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RadialMenuBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EJoystickTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RadialMenuBase.WBP_RadialMenuBase_C
// 0x0120 (0x0350 - 0x0230)
class UWBP_RadialMenuBase_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 RadialBackground;                                  // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RadiusDebug;                                       // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RootOverlay;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Segments;                                          // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     MaterialBase;                                      // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IndexRaw;                                          // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynaMat;                                           // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    Children;                                          // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          AllowResizing;                                     // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ItemOffsetRadius;                                  // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             SelectionChanged;                                  // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class APlayerController*                      InputController;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJoystickTypes                                JoystickToUse;                                     // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MouseDeadzone;                                     // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInDeadzone;                                       // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             EnteredDeadzone;                                   // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             ExitedDeadzone;                                    // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector2D                              CurrentInput;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JoystickDeadzone;                                  // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DefaultToMouseIfNoJoystick;                        // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultPlayerIndex;                                // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          UseDeadzoneEvents;                                 // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SelectionChangedSound;                             // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoCenterMouse;                                   // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                          AutoRotateForUp;                                   // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bUseCustomInput;                                   // 0x02F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F3[0x1];                                      // 0x02F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CustomInput;                                       // 0x02F4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomTexture;                                  // 0x02FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               RadialTexture;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomColors;                                   // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           InnterRingColor;                                   // 0x030C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OuterRingColor;                                    // 0x031C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RingMainColor;                                     // 0x032C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnhighlightColor;                                  // 0x033C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SelectionChanged__DelegateSignature(int32 NewSelection, int32 OldSelection);
	void EnteredDeadzone__DelegateSignature();
	void ExitedDeadzone__DelegateSignature();
	void ExecuteUbergraph_WBP_RadialMenuBase(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateMaterials();
	void InDeadzone(bool InDeadzone_0);
	void UpdateSegments(int32 Segments_0);
	void Construct();
	void SetInputDirection(const struct FVector2D& Direction);
	float GetSectionDegreeSize();
	void UpdateDirectionWithMouseCursor();
	void AddChildToRadialMenu(class UUserWidget* Content, bool* Success);
	void GetSelectedWidget(class UUserWidget** Output);
	void ClearChildren();
	void UpdateChildPosition(int32 Index_0);
	void UpdateAllChildrenPositions();
	void SetIndex(int32 Index_0);
	void GetChild(int32 Index_0, class UUserWidget** Output, bool* Success);
	void GetCurrentIndex(int32* Index_0, bool* Valid);
	void UpdateDirectionWithJoystick();
	void RegisterPlayerInput(class APlayerController* Controller, bool* Success);
	void UpdateInput();
	void AutoRegisterToInput();
	void FixMainRotation();
	struct FVector2D FixInputRotation(const struct FVector2D& Input);
	class FText DebugIndex();
	void RemoveChildWidgetFromRadialMenu(const class UUserWidget*& ItemToFind);
	void RemoveChildIndexFromRadialMenu(int32 IndexToRemove);
	void UpdateDirectionWithCustomInput();
	void SetCustomInput(const struct FVector2D& CustomInput_0);
	void GetCustomInput(struct FVector2D* Input, bool* Valid);
	void UpdateMaterialVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RadialMenuBase_C">();
	}
	static class UWBP_RadialMenuBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RadialMenuBase_C>();
	}
};
static_assert(alignof(UWBP_RadialMenuBase_C) == 0x000008, "Wrong alignment on UWBP_RadialMenuBase_C");
static_assert(sizeof(UWBP_RadialMenuBase_C) == 0x000350, "Wrong size on UWBP_RadialMenuBase_C");
static_assert(offsetof(UWBP_RadialMenuBase_C, UberGraphFrame) == 0x000230, "Member 'UWBP_RadialMenuBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, RadialBackground) == 0x000238, "Member 'UWBP_RadialMenuBase_C::RadialBackground' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, RadiusDebug) == 0x000240, "Member 'UWBP_RadialMenuBase_C::RadiusDebug' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, RootOverlay) == 0x000248, "Member 'UWBP_RadialMenuBase_C::RootOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, Segments) == 0x000250, "Member 'UWBP_RadialMenuBase_C::Segments' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, MaterialBase) == 0x000258, "Member 'UWBP_RadialMenuBase_C::MaterialBase' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, IndexRaw) == 0x000260, "Member 'UWBP_RadialMenuBase_C::IndexRaw' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, Index_0) == 0x000264, "Member 'UWBP_RadialMenuBase_C::Index_0' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, DynaMat) == 0x000268, "Member 'UWBP_RadialMenuBase_C::DynaMat' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, Children) == 0x000270, "Member 'UWBP_RadialMenuBase_C::Children' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, AllowResizing) == 0x000280, "Member 'UWBP_RadialMenuBase_C::AllowResizing' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, ItemOffsetRadius) == 0x000284, "Member 'UWBP_RadialMenuBase_C::ItemOffsetRadius' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, SelectionChanged) == 0x000288, "Member 'UWBP_RadialMenuBase_C::SelectionChanged' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, InputController) == 0x000298, "Member 'UWBP_RadialMenuBase_C::InputController' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, JoystickToUse) == 0x0002A0, "Member 'UWBP_RadialMenuBase_C::JoystickToUse' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, MouseDeadzone) == 0x0002A4, "Member 'UWBP_RadialMenuBase_C::MouseDeadzone' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, bInDeadzone) == 0x0002A8, "Member 'UWBP_RadialMenuBase_C::bInDeadzone' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, EnteredDeadzone) == 0x0002B0, "Member 'UWBP_RadialMenuBase_C::EnteredDeadzone' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, ExitedDeadzone) == 0x0002C0, "Member 'UWBP_RadialMenuBase_C::ExitedDeadzone' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, CurrentInput) == 0x0002D0, "Member 'UWBP_RadialMenuBase_C::CurrentInput' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, JoystickDeadzone) == 0x0002D8, "Member 'UWBP_RadialMenuBase_C::JoystickDeadzone' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, DefaultToMouseIfNoJoystick) == 0x0002DC, "Member 'UWBP_RadialMenuBase_C::DefaultToMouseIfNoJoystick' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, DefaultPlayerIndex) == 0x0002E0, "Member 'UWBP_RadialMenuBase_C::DefaultPlayerIndex' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, UseDeadzoneEvents) == 0x0002E4, "Member 'UWBP_RadialMenuBase_C::UseDeadzoneEvents' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, SelectionChangedSound) == 0x0002E8, "Member 'UWBP_RadialMenuBase_C::SelectionChangedSound' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, AutoCenterMouse) == 0x0002F0, "Member 'UWBP_RadialMenuBase_C::AutoCenterMouse' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, AutoRotateForUp) == 0x0002F1, "Member 'UWBP_RadialMenuBase_C::AutoRotateForUp' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, bUseCustomInput) == 0x0002F2, "Member 'UWBP_RadialMenuBase_C::bUseCustomInput' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, CustomInput) == 0x0002F4, "Member 'UWBP_RadialMenuBase_C::CustomInput' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, UseCustomTexture) == 0x0002FC, "Member 'UWBP_RadialMenuBase_C::UseCustomTexture' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, RadialTexture) == 0x000300, "Member 'UWBP_RadialMenuBase_C::RadialTexture' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, UseCustomColors) == 0x000308, "Member 'UWBP_RadialMenuBase_C::UseCustomColors' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, InnterRingColor) == 0x00030C, "Member 'UWBP_RadialMenuBase_C::InnterRingColor' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, OuterRingColor) == 0x00031C, "Member 'UWBP_RadialMenuBase_C::OuterRingColor' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, RingMainColor) == 0x00032C, "Member 'UWBP_RadialMenuBase_C::RingMainColor' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuBase_C, UnhighlightColor) == 0x00033C, "Member 'UWBP_RadialMenuBase_C::UnhighlightColor' has a wrong offset!");

}

