#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUDElement_TextChat

#include "Basic.hpp"

#include "HDMain_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUDElement_TextChat.WBP_HUDElement_TextChat_C
// 0x0078 (0x0320 - 0x02A8)
class UWBP_HUDElement_TextChat_C final : public UHDTextChatWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DisplayChatInputUI;                                // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DisplayChatHistoryUI;                              // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ChatBoxTitle;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ChatHistory;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ChatInput;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUDElement_TextChat_InputHandler_C* ChatInputHandler;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ChatMsgLogSBox;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NumFakeChatMsgs;                                   // 0x02E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxChatMsgs;                                       // 0x02EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                ChatMsgPadding;                                    // 0x02F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         ChatHistoryFadeOutDelay;                           // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bChatHistoryVisible;                               // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ChatHistoryTimeoutHandle;                          // 0x0308(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bWantsScrollToEnd;                                 // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ScrollToWidget;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HUDElement_TextChat(int32 EntryPoint);
	void BndEvt__ChatMsgLogSBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset);
	void SetChatHistoryIsVisible(bool bVisible);
	void ChatHistoryTimeout();
	void OnInitialized();
	void BndEvt__WBP_TextChat_Input_K2Node_ComponentBoundEvent_2_OnInputTextCommitted__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void StopTalking();
	void StartTalking(class UDFCommChannel* TalkChannel);
	void PreConstruct(bool IsDesignTime);
	void DisplayChatMessage(class UHDTextChatMsgInfo* NewChatMsg);
	void AddNewOutputListing(class UHDTextChatMsgInfo* ChatMsg, class UWidget** Listing);
	void GetChatHistoryIsVisible(bool* bVisible);
	void UpdateChatBoxTitleKeyText(struct FKey& Key);

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUDElement_TextChat_C">();
	}
	static class UWBP_HUDElement_TextChat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUDElement_TextChat_C>();
	}
};
static_assert(alignof(UWBP_HUDElement_TextChat_C) == 0x000008, "Wrong alignment on UWBP_HUDElement_TextChat_C");
static_assert(sizeof(UWBP_HUDElement_TextChat_C) == 0x000320, "Wrong size on UWBP_HUDElement_TextChat_C");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_HUDElement_TextChat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, DisplayChatInputUI) == 0x0002B0, "Member 'UWBP_HUDElement_TextChat_C::DisplayChatInputUI' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, DisplayChatHistoryUI) == 0x0002B8, "Member 'UWBP_HUDElement_TextChat_C::DisplayChatHistoryUI' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, ChatBoxTitle) == 0x0002C0, "Member 'UWBP_HUDElement_TextChat_C::ChatBoxTitle' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, ChatHistory) == 0x0002C8, "Member 'UWBP_HUDElement_TextChat_C::ChatHistory' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, ChatInput) == 0x0002D0, "Member 'UWBP_HUDElement_TextChat_C::ChatInput' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, ChatInputHandler) == 0x0002D8, "Member 'UWBP_HUDElement_TextChat_C::ChatInputHandler' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, ChatMsgLogSBox) == 0x0002E0, "Member 'UWBP_HUDElement_TextChat_C::ChatMsgLogSBox' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, NumFakeChatMsgs) == 0x0002E8, "Member 'UWBP_HUDElement_TextChat_C::NumFakeChatMsgs' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, MaxChatMsgs) == 0x0002EC, "Member 'UWBP_HUDElement_TextChat_C::MaxChatMsgs' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, ChatMsgPadding) == 0x0002F0, "Member 'UWBP_HUDElement_TextChat_C::ChatMsgPadding' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, ChatHistoryFadeOutDelay) == 0x000300, "Member 'UWBP_HUDElement_TextChat_C::ChatHistoryFadeOutDelay' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, bChatHistoryVisible) == 0x000304, "Member 'UWBP_HUDElement_TextChat_C::bChatHistoryVisible' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, ChatHistoryTimeoutHandle) == 0x000308, "Member 'UWBP_HUDElement_TextChat_C::ChatHistoryTimeoutHandle' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, bWantsScrollToEnd) == 0x000310, "Member 'UWBP_HUDElement_TextChat_C::bWantsScrollToEnd' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_C, ScrollToWidget) == 0x000318, "Member 'UWBP_HUDElement_TextChat_C::ScrollToWidget' has a wrong offset!");

}

