#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsMenuItem_InputKeySelector

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OptionsMenuItem_InputKeySelector.WBP_OptionsMenuItem_InputKeySelector_C
// 0x0090 (0x02C0 - 0x0230)
class UWBP_OptionsMenuItem_InputKeySelector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_InputKeySelector_C*                OptionIKS;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OptionText;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0248(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   TextDescription;                                   // 0x0260(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FName                                   InputName;                                         // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnKeySelected;                                     // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         InputScale;                                        // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   MappedKey;                                         // 0x0298(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnIsSelectingKeyChanged;                           // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);
	void OnIsSelectingKeyChanged__DelegateSignature();
	void ExecuteUbergraph_WBP_OptionsMenuItem_InputKeySelector(int32 EntryPoint);
	void BndEvt__OptionIKS_K2Node_ComponentBoundEvent_0_OnIsSelectingKeyChanged__DelegateSignature();
	void BndEvt__OptionIKS_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);
	void PreConstruct(bool IsDesignTime);
	void GetSelectedKey(struct FKey* SelectedKey);
	void SetSelectedKey(const struct FKey& SelectedKey);
	void ClearSelectedKey(class UWBP_OptionsMenuItem_InputKeySelector_C* IKS, const struct FKey& NewKey, bool bIsPlayerChangingKeyBindings);
	void IsSelectingKey(bool* IsSelecting);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OptionsMenuItem_InputKeySelector_C">();
	}
	static class UWBP_OptionsMenuItem_InputKeySelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OptionsMenuItem_InputKeySelector_C>();
	}
};
static_assert(alignof(UWBP_OptionsMenuItem_InputKeySelector_C) == 0x000008, "Wrong alignment on UWBP_OptionsMenuItem_InputKeySelector_C");
static_assert(sizeof(UWBP_OptionsMenuItem_InputKeySelector_C) == 0x0002C0, "Wrong size on UWBP_OptionsMenuItem_InputKeySelector_C");
static_assert(offsetof(UWBP_OptionsMenuItem_InputKeySelector_C, UberGraphFrame) == 0x000230, "Member 'UWBP_OptionsMenuItem_InputKeySelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_InputKeySelector_C, OptionIKS) == 0x000238, "Member 'UWBP_OptionsMenuItem_InputKeySelector_C::OptionIKS' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_InputKeySelector_C, OptionText) == 0x000240, "Member 'UWBP_OptionsMenuItem_InputKeySelector_C::OptionText' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_InputKeySelector_C, Text) == 0x000248, "Member 'UWBP_OptionsMenuItem_InputKeySelector_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_InputKeySelector_C, TextDescription) == 0x000260, "Member 'UWBP_OptionsMenuItem_InputKeySelector_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_InputKeySelector_C, InputName) == 0x000278, "Member 'UWBP_OptionsMenuItem_InputKeySelector_C::InputName' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_InputKeySelector_C, OnKeySelected) == 0x000280, "Member 'UWBP_OptionsMenuItem_InputKeySelector_C::OnKeySelected' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_InputKeySelector_C, InputScale) == 0x000290, "Member 'UWBP_OptionsMenuItem_InputKeySelector_C::InputScale' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_InputKeySelector_C, MappedKey) == 0x000298, "Member 'UWBP_OptionsMenuItem_InputKeySelector_C::MappedKey' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_InputKeySelector_C, OnIsSelectingKeyChanged) == 0x0002B0, "Member 'UWBP_OptionsMenuItem_InputKeySelector_C::OnIsSelectingKeyChanged' has a wrong offset!");

}

