#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsMenuItem_Arrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FOptionItemSelection_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "EArrowOptionsPreset_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C
// 0x00B0 (0x02E0 - 0x0230)
class UWBP_OptionsMenuItem_Arrow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                NextOptionBtn;                                     // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OptionText;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PrevOptionBtn;                                     // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SelectedOptionSizeBox;                             // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectedOptionText;                                // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0260(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<struct FFOptionItemSelection>          Options;                                           // 0x0278(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         SelectedOptionIndex;                               // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_19AB[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSelectionChanged;                                // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   TextDescription;                                   // 0x02A0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         TextWidth;                                         // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EArrowOptionsPreset                           OptionsPreset;                                     // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_19AC[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFOptionItemSelection>          ScalabilityOptions;                                // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelectionChangedByUser;                          // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnSelectionChanged__DelegateSignature(const class FString& SelectedItemValue, ESelectInfo SelectionType);
	void OnSelectionChangedByUser__DelegateSignature(const class FString& SelectedItemValue);
	void ExecuteUbergraph_WBP_OptionsMenuItem_Arrow(int32 EntryPoint);
	void OnItemSelectionChanged(const class FString& SelectedItemValue, ESelectInfo SelectionType);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__NextOptionBtn_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PrevOptionBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ClearOptions();
	void INTERNAL_SetSelectedOptionByIndex(int32 Param_Index, ESelectInfo SelectionType);
	void GetSelectedOptionValue(class FString* OptionValue);
	void GetOptionValueAtIndex(int32 Param_Index, class FString* OptionValue);
	void AddOption(struct FFOptionItemSelection& NewOption);
	void GetOptionCount(int32* OptionCount);
	void RemoveOptionAtIndex(int32 IndexToRemove, bool* bRemovalSuccess);
	void INTERNAL_ClearSelection(ESelectInfo DeselectionType);
	void ClearSelection();
	void SetSelectedOptionByIndex(int32 Param_Index);
	void FindOptionValueIndex(const class FString& OptionValue, int32* Param_Index);
	void PopulateOptionsByPreset(EArrowOptionsPreset Preset);
	void SetSelectedOptionByValue(const class FString& OptionValue);
	void SetSelectedOption(const class FText& OptionDisplayName);
	void FindOptionIndex(const class FText& OptionDisplayName, int32* Param_Index);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OptionsMenuItem_Arrow_C">();
	}
	static class UWBP_OptionsMenuItem_Arrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OptionsMenuItem_Arrow_C>();
	}
};
static_assert(alignof(UWBP_OptionsMenuItem_Arrow_C) == 0x000008, "Wrong alignment on UWBP_OptionsMenuItem_Arrow_C");
static_assert(sizeof(UWBP_OptionsMenuItem_Arrow_C) == 0x0002E0, "Wrong size on UWBP_OptionsMenuItem_Arrow_C");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, UberGraphFrame) == 0x000230, "Member 'UWBP_OptionsMenuItem_Arrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, NextOptionBtn) == 0x000238, "Member 'UWBP_OptionsMenuItem_Arrow_C::NextOptionBtn' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, OptionText) == 0x000240, "Member 'UWBP_OptionsMenuItem_Arrow_C::OptionText' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, PrevOptionBtn) == 0x000248, "Member 'UWBP_OptionsMenuItem_Arrow_C::PrevOptionBtn' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, SelectedOptionSizeBox) == 0x000250, "Member 'UWBP_OptionsMenuItem_Arrow_C::SelectedOptionSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, SelectedOptionText) == 0x000258, "Member 'UWBP_OptionsMenuItem_Arrow_C::SelectedOptionText' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, Text) == 0x000260, "Member 'UWBP_OptionsMenuItem_Arrow_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, Options) == 0x000278, "Member 'UWBP_OptionsMenuItem_Arrow_C::Options' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, SelectedOptionIndex) == 0x000288, "Member 'UWBP_OptionsMenuItem_Arrow_C::SelectedOptionIndex' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, OnSelectionChanged) == 0x000290, "Member 'UWBP_OptionsMenuItem_Arrow_C::OnSelectionChanged' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, TextDescription) == 0x0002A0, "Member 'UWBP_OptionsMenuItem_Arrow_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, TextWidth) == 0x0002B8, "Member 'UWBP_OptionsMenuItem_Arrow_C::TextWidth' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, OptionsPreset) == 0x0002BC, "Member 'UWBP_OptionsMenuItem_Arrow_C::OptionsPreset' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, ScalabilityOptions) == 0x0002C0, "Member 'UWBP_OptionsMenuItem_Arrow_C::ScalabilityOptions' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenuItem_Arrow_C, OnSelectionChangedByUser) == 0x0002D0, "Member 'UWBP_OptionsMenuItem_Arrow_C::OnSelectionChangedByUser' has a wrong offset!");

}

