#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsMenuItem_Slider

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.ValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_ValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_ValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_ValueChanged__DelegateSignature");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_ValueChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_OptionsMenuItem_Slider_C_ValueChanged__DelegateSignature");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_ValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_ValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.ExecuteUbergraph_WBP_OptionsMenuItem_Slider
// 0x0030 (0x0030 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider) == 0x000030, "Wrong size on WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider, EntryPoint) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider, CallFunc_FClamp_ReturnValue) == 0x000004, "Member 'WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider, K2Node_ComponentBoundEvent_Value) == 0x000008, "Member 'WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider, CallFunc_Percent_FloatFloat_ReturnValue) == 0x00000C, "Member 'WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider, CallFunc_GetValue_ReturnValue) == 0x000014, "Member 'WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider, K2Node_Event_IsDesignTime) == 0x000019, "Member 'WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000020, "Member 'WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1) == 0x000028, "Member 'WBP_OptionsMenuItem_Slider_C_ExecuteUbergraph_WBP_OptionsMenuItem_Slider::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.BndEvt__OptionSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_BndEvt__OptionSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_BndEvt__OptionSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_BndEvt__OptionSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_BndEvt__OptionSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_OptionsMenuItem_Slider_C_BndEvt__OptionSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_BndEvt__OptionSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_BndEvt__OptionSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_PreConstruct");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_PreConstruct) == 0x000001, "Wrong size on WBP_OptionsMenuItem_Slider_C_PreConstruct");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.GetValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_GetValue final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_GetValue) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_GetValue");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_GetValue) == 0x000008, "Wrong size on WBP_OptionsMenuItem_Slider_C_GetValue");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_GetValue, Value) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_GetValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_GetValue, CallFunc_GetValue_ReturnValue) == 0x000004, "Member 'WBP_OptionsMenuItem_Slider_C_GetValue::CallFunc_GetValue_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.SetValue
// 0x0004 (0x0004 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_SetValue final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_SetValue) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_SetValue");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_SetValue) == 0x000004, "Wrong size on WBP_OptionsMenuItem_Slider_C_SetValue");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetValue, InValue) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_SetValue::InValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.IsLocked
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_IsLocked final
{
public:
	bool                                          bOutLocked;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_IsLocked) == 0x000001, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_IsLocked");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_IsLocked) == 0x000001, "Wrong size on WBP_OptionsMenuItem_Slider_C_IsLocked");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_IsLocked, bOutLocked) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_IsLocked::bOutLocked' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.SetLocked
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_SetLocked final
{
public:
	bool                                          bInLocked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_SetLocked) == 0x000001, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_SetLocked");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_SetLocked) == 0x000001, "Wrong size on WBP_OptionsMenuItem_Slider_C_SetLocked");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetLocked, bInLocked) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_SetLocked::bInLocked' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.SetNormalizedValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_SetNormalizedValue final
{
public:
	float                                         InNormValue;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_SetNormalizedValue) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_SetNormalizedValue");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_SetNormalizedValue) == 0x000008, "Wrong size on WBP_OptionsMenuItem_Slider_C_SetNormalizedValue");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetNormalizedValue, InNormValue) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_SetNormalizedValue::InNormValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetNormalizedValue, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'WBP_OptionsMenuItem_Slider_C_SetNormalizedValue::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.GetNormalizedValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_GetNormalizedValue final
{
public:
	float                                         ValueNormalized;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNormalizedValue_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_GetNormalizedValue) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_GetNormalizedValue");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_GetNormalizedValue) == 0x000008, "Wrong size on WBP_OptionsMenuItem_Slider_C_GetNormalizedValue");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_GetNormalizedValue, ValueNormalized) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_GetNormalizedValue::ValueNormalized' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_GetNormalizedValue, CallFunc_GetNormalizedValue_ReturnValue) == 0x000004, "Member 'WBP_OptionsMenuItem_Slider_C_GetNormalizedValue::CallFunc_GetNormalizedValue_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.UpdateSliderText
// 0x0158 (0x0158 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_UpdateSliderText final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0048(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0088(0x0018)()
	class FText                                   CallFunc_Map_Find_Value;                           // 0x00A0(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00C0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0140(0x0018)()
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_UpdateSliderText");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText) == 0x000158, "Wrong size on WBP_OptionsMenuItem_Slider_C_UpdateSliderText");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText, NewValue) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_UpdateSliderText::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText, Temp_bool_Variable) == 0x000004, "Member 'WBP_OptionsMenuItem_Slider_C_UpdateSliderText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WBP_OptionsMenuItem_Slider_C_UpdateSliderText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000048, "Member 'WBP_OptionsMenuItem_Slider_C_UpdateSliderText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText, CallFunc_Conv_FloatToText_ReturnValue) == 0x000088, "Member 'WBP_OptionsMenuItem_Slider_C_UpdateSliderText::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText, CallFunc_Map_Find_Value) == 0x0000A0, "Member 'WBP_OptionsMenuItem_Slider_C_UpdateSliderText::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText, CallFunc_Map_Find_ReturnValue) == 0x0000B8, "Member 'WBP_OptionsMenuItem_Slider_C_UpdateSliderText::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText, CallFunc_TextToUpper_ReturnValue) == 0x0000C0, "Member 'WBP_OptionsMenuItem_Slider_C_UpdateSliderText::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText, K2Node_Select_Default) == 0x0000D8, "Member 'WBP_OptionsMenuItem_Slider_C_UpdateSliderText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000F0, "Member 'WBP_OptionsMenuItem_Slider_C_UpdateSliderText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText, K2Node_MakeArray_Array) == 0x000130, "Member 'WBP_OptionsMenuItem_Slider_C_UpdateSliderText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_UpdateSliderText, CallFunc_Format_ReturnValue) == 0x000140, "Member 'WBP_OptionsMenuItem_Slider_C_UpdateSliderText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.SetValueMin
// 0x0008 (0x0008 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_SetValueMin final
{
public:
	float                                         NewMin;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_SetValueMin) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_SetValueMin");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_SetValueMin) == 0x000008, "Wrong size on WBP_OptionsMenuItem_Slider_C_SetValueMin");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetValueMin, NewMin) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_SetValueMin::NewMin' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetValueMin, CallFunc_FMin_ReturnValue) == 0x000004, "Member 'WBP_OptionsMenuItem_Slider_C_SetValueMin::CallFunc_FMin_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.SetValueMax
// 0x0008 (0x0008 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_SetValueMax final
{
public:
	float                                         NewMax;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_SetValueMax) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_SetValueMax");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_SetValueMax) == 0x000008, "Wrong size on WBP_OptionsMenuItem_Slider_C_SetValueMax");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetValueMax, NewMax) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_SetValueMax::NewMax' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetValueMax, CallFunc_FMax_ReturnValue) == 0x000004, "Member 'WBP_OptionsMenuItem_Slider_C_SetValueMax::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.SetValueStepSize
// 0x0004 (0x0004 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_SetValueStepSize final
{
public:
	float                                         NewStepSize;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_SetValueStepSize) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_SetValueStepSize");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_SetValueStepSize) == 0x000004, "Wrong size on WBP_OptionsMenuItem_Slider_C_SetValueStepSize");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetValueStepSize, NewStepSize) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_SetValueStepSize::NewStepSize' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.SetMouseUsesStep
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_SetMouseUsesStep final
{
public:
	bool                                          bInMouseUsesStep;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_SetMouseUsesStep) == 0x000001, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_SetMouseUsesStep");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_SetMouseUsesStep) == 0x000001, "Wrong size on WBP_OptionsMenuItem_Slider_C_SetMouseUsesStep");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetMouseUsesStep, bInMouseUsesStep) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_SetMouseUsesStep::bInMouseUsesStep' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.DoesMouseUseStep
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_DoesMouseUseStep final
{
public:
	bool                                          bOutMouseUsesStep;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_DoesMouseUseStep) == 0x000001, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_DoesMouseUseStep");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_DoesMouseUseStep) == 0x000001, "Wrong size on WBP_OptionsMenuItem_Slider_C_DoesMouseUseStep");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_DoesMouseUseStep, bOutMouseUsesStep) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_DoesMouseUseStep::bOutMouseUsesStep' has a wrong offset!");

// Function WBP_OptionsMenuItem_Slider.WBP_OptionsMenuItem_Slider_C.SetValueInternal
// 0x0018 (0x0018 - 0x0000)
struct WBP_OptionsMenuItem_Slider_C_SetValueInternal final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDirectSet;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GridSnap_Float_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Slider_C_SetValueInternal) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Slider_C_SetValueInternal");
static_assert(sizeof(WBP_OptionsMenuItem_Slider_C_SetValueInternal) == 0x000018, "Wrong size on WBP_OptionsMenuItem_Slider_C_SetValueInternal");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetValueInternal, InValue) == 0x000000, "Member 'WBP_OptionsMenuItem_Slider_C_SetValueInternal::InValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetValueInternal, bDirectSet) == 0x000004, "Member 'WBP_OptionsMenuItem_Slider_C_SetValueInternal::bDirectSet' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Slider_C_SetValueInternal, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_OptionsMenuItem_Slider_C_SetValueInternal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
