#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionMenu_JoinGame

#include "Basic.hpp"

#include "HDMain_structs.hpp"
#include "FSubMenuOption_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FServerSortPreference_structs.hpp"
#include "FServerBadgeUIDefinition_structs.hpp"


namespace SDK::Params
{

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.ExecuteUbergraph_WBP_OptionMenu_JoinGame
// 0x0190 (0x0190 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DE7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_2;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DE8[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHDServerListItemData*                  K2Node_DynamicCast_AsHDServer_List_Item_Data;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DE9[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_2;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_JoinServerListEntry_C*             K2Node_DynamicCast_AsWBP_Join_Server_List_Entry;   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DEA[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemMinHeight_MinHeight;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFServerBadgeUIDefinition>      CallFunc_ParseServerBadgesFromTable_SortedBadgeDefs; // 0x0058(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DEB[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_JoinServerListEntry_C*             K2Node_DynamicCast_AsWBP_Join_Server_List_Entry_1; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSortAscending;                       // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHDServerListSortBy                           K2Node_Event_SortBy;                               // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DEC[0x1];                                     // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SubMenuIndex;                         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DED[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FFServerSortPreference& SortPreference)> K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1DEE[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ServerFilterRules_C> K2Node_DynamicCast_AsBPI_Server_Filter_Rules;      // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DEF[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UClass*, struct FHDFilterRuleParams> CallFunc_GetFilterRules_FilterRules;               // 0x00C0(0x0050)()
	TMap<class UClass*, struct FHDFilterRuleParams> K2Node_ComponentBoundEvent_ActiveFilters;          // 0x0110(0x0050)()
	struct FFServerSortPreference                 K2Node_CustomEvent_SortPreference;                 // 0x0160(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DF0[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InputText;                      // 0x0168(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame) == 0x000008, "Wrong alignment on WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame) == 0x000190, "Wrong size on WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, EntryPoint) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_ComponentBoundEvent_Item_2) == 0x000008, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_ComponentBoundEvent_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_ComponentBoundEvent_bIsSelected) == 0x000010, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_DynamicCast_AsHDServer_List_Item_Data) == 0x000018, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_DynamicCast_AsHDServer_List_Item_Data' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000021, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_ComponentBoundEvent_Item_1) == 0x000028, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_ComponentBoundEvent_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_ComponentBoundEvent_Widget_2) == 0x000030, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_ComponentBoundEvent_Widget_1) == 0x000038, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_DynamicCast_AsWBP_Join_Server_List_Entry) == 0x000040, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_DynamicCast_AsWBP_Join_Server_List_Entry' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, CallFunc_GetItemMinHeight_MinHeight) == 0x00004C, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::CallFunc_GetItemMinHeight_MinHeight' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, CallFunc_FMax_ReturnValue) == 0x000050, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, CallFunc_FTrunc_ReturnValue) == 0x000054, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, CallFunc_ParseServerBadgesFromTable_SortedBadgeDefs) == 0x000058, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::CallFunc_ParseServerBadgesFromTable_SortedBadgeDefs' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_ComponentBoundEvent_Item) == 0x000070, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_ComponentBoundEvent_Widget) == 0x000078, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_DynamicCast_AsWBP_Join_Server_List_Entry_1) == 0x000080, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_DynamicCast_AsWBP_Join_Server_List_Entry_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_Event_bSortAscending) == 0x000089, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_Event_bSortAscending' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_Event_SortBy) == 0x00008A, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_Event_SortBy' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_Event_SubMenuIndex) == 0x00008C, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_Event_SubMenuIndex' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_Event_IsDesignTime) == 0x000090, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_DynamicCast_AsBPI_Server_Filter_Rules) == 0x0000A8, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_DynamicCast_AsBPI_Server_Filter_Rules' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, CallFunc_GetFilterRules_FilterRules) == 0x0000C0, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::CallFunc_GetFilterRules_FilterRules' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_ComponentBoundEvent_ActiveFilters) == 0x000110, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_ComponentBoundEvent_ActiveFilters' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_CustomEvent_SortPreference) == 0x000160, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_CustomEvent_SortPreference' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, CallFunc_IsValid_ReturnValue_1) == 0x000162, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000163, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, K2Node_CustomEvent_InputText) == 0x000168, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::K2Node_CustomEvent_InputText' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame, CallFunc_Conv_TextToString_ReturnValue) == 0x000180, "Member 'WBP_OptionMenu_JoinGame_C_ExecuteUbergraph_WBP_OptionMenu_JoinGame::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.ConfirmServerPasswordInput
// 0x0018 (0x0018 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_ConfirmServerPasswordInput final
{
public:
	class FText                                   InputText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_ConfirmServerPasswordInput) == 0x000008, "Wrong alignment on WBP_OptionMenu_JoinGame_C_ConfirmServerPasswordInput");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_ConfirmServerPasswordInput) == 0x000018, "Wrong size on WBP_OptionMenu_JoinGame_C_ConfirmServerPasswordInput");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ConfirmServerPasswordInput, InputText) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_ConfirmServerPasswordInput::InputText' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.SortPreferenceChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_SortPreferenceChanged final
{
public:
	struct FFServerSortPreference                 SortPreference;                                    // 0x0000(0x0002)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_SortPreferenceChanged) == 0x000001, "Wrong alignment on WBP_OptionMenu_JoinGame_C_SortPreferenceChanged");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_SortPreferenceChanged) == 0x000002, "Wrong size on WBP_OptionMenu_JoinGame_C_SortPreferenceChanged");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_SortPreferenceChanged, SortPreference) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_SortPreferenceChanged::SortPreference' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.BndEvt__FiltersPanel_K2Node_ComponentBoundEvent_8_OnServerFiltersChanged__DelegateSignature
// 0x0050 (0x0050 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_BndEvt__FiltersPanel_K2Node_ComponentBoundEvent_8_OnServerFiltersChanged__DelegateSignature final
{
public:
	TMap<class UClass*, struct FHDFilterRuleParams> ActiveFilters;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_BndEvt__FiltersPanel_K2Node_ComponentBoundEvent_8_OnServerFiltersChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_OptionMenu_JoinGame_C_BndEvt__FiltersPanel_K2Node_ComponentBoundEvent_8_OnServerFiltersChanged__DelegateSignature");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_BndEvt__FiltersPanel_K2Node_ComponentBoundEvent_8_OnServerFiltersChanged__DelegateSignature) == 0x000050, "Wrong size on WBP_OptionMenu_JoinGame_C_BndEvt__FiltersPanel_K2Node_ComponentBoundEvent_8_OnServerFiltersChanged__DelegateSignature");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_BndEvt__FiltersPanel_K2Node_ComponentBoundEvent_8_OnServerFiltersChanged__DelegateSignature, ActiveFilters) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_BndEvt__FiltersPanel_K2Node_ComponentBoundEvent_8_OnServerFiltersChanged__DelegateSignature::ActiveFilters' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_OptionMenu_JoinGame_C_PreConstruct");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_PreConstruct) == 0x000001, "Wrong size on WBP_OptionMenu_JoinGame_C_PreConstruct");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.BndEvt__ServerList_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.BndEvt__ServerList_K2Node_ComponentBoundEvent_7_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_7_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_7_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_7_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_7_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_7_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_7_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_7_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.BndEvt__ServerList_K2Node_ComponentBoundEvent_1_OnListItemScrolledIntoViewDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_1_OnListItemScrolledIntoViewDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_1_OnListItemScrolledIntoViewDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_1_OnListItemScrolledIntoViewDynamic__DelegateSignature");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_1_OnListItemScrolledIntoViewDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_1_OnListItemScrolledIntoViewDynamic__DelegateSignature");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_1_OnListItemScrolledIntoViewDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_1_OnListItemScrolledIntoViewDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_1_OnListItemScrolledIntoViewDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_1_OnListItemScrolledIntoViewDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.BndEvt__ServerList_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_OptionMenu_JoinGame_C_BndEvt__ServerList_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.ReceiveOnRefreshComplete
// 0x0002 (0x0002 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_ReceiveOnRefreshComplete final
{
public:
	bool                                          bSortAscending;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EHDServerListSortBy                           SortBy;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_ReceiveOnRefreshComplete) == 0x000001, "Wrong alignment on WBP_OptionMenu_JoinGame_C_ReceiveOnRefreshComplete");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_ReceiveOnRefreshComplete) == 0x000002, "Wrong size on WBP_OptionMenu_JoinGame_C_ReceiveOnRefreshComplete");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ReceiveOnRefreshComplete, bSortAscending) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_ReceiveOnRefreshComplete::bSortAscending' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ReceiveOnRefreshComplete, SortBy) == 0x000001, "Member 'WBP_OptionMenu_JoinGame_C_ReceiveOnRefreshComplete::SortBy' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.SetActiveSubMenuByIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_SetActiveSubMenuByIndex final
{
public:
	int32                                         SubMenuIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_SetActiveSubMenuByIndex) == 0x000004, "Wrong alignment on WBP_OptionMenu_JoinGame_C_SetActiveSubMenuByIndex");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_SetActiveSubMenuByIndex) == 0x000004, "Wrong size on WBP_OptionMenu_JoinGame_C_SetActiveSubMenuByIndex");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_SetActiveSubMenuByIndex, SubMenuIndex) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_SetActiveSubMenuByIndex::SubMenuIndex' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.ServerListItemSelectionUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_ServerListItemSelectionUpdated final
{
public:
	class UHDServerListItemData*                  InSelectedServerListItem;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRefreshPending_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_ServerListItemSelectionUpdated) == 0x000008, "Wrong alignment on WBP_OptionMenu_JoinGame_C_ServerListItemSelectionUpdated");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_ServerListItemSelectionUpdated) == 0x000010, "Wrong size on WBP_OptionMenu_JoinGame_C_ServerListItemSelectionUpdated");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ServerListItemSelectionUpdated, InSelectedServerListItem) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_ServerListItemSelectionUpdated::InSelectedServerListItem' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ServerListItemSelectionUpdated, CallFunc_IsRefreshPending_ReturnValue) == 0x000008, "Member 'WBP_OptionMenu_JoinGame_C_ServerListItemSelectionUpdated::CallFunc_IsRefreshPending_ReturnValue' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.GetSelectedServerListItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_GetSelectedServerListItem final
{
public:
	class UHDServerListItemData*                  ServerItem;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_GetSelectedServerListItem) == 0x000008, "Wrong alignment on WBP_OptionMenu_JoinGame_C_GetSelectedServerListItem");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_GetSelectedServerListItem) == 0x000008, "Wrong size on WBP_OptionMenu_JoinGame_C_GetSelectedServerListItem");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_GetSelectedServerListItem, ServerItem) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_GetSelectedServerListItem::ServerItem' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.IsValidServerListItemIndex
// 0x0010 (0x0010 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex final
{
public:
	int32                                         IndexToTest;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bValidIndex;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DF1[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex) == 0x000004, "Wrong alignment on WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex) == 0x000010, "Wrong size on WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex, IndexToTest) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex::IndexToTest' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex, bValidIndex) == 0x000004, "Member 'WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex::bValidIndex' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000005, "Member 'WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex, CallFunc_GetNumItems_ReturnValue) == 0x000008, "Member 'WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'WBP_OptionMenu_JoinGame_C_IsValidServerListItemIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.GetServerListSortPreference
// 0x0004 (0x0004 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_GetServerListSortPreference final
{
public:
	struct FFServerSortPreference                 SortPreference;                                    // 0x0000(0x0002)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFServerSortPreference                 CallFunc_GetSelectedServerSortPreference_SortPreference; // 0x0002(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_GetServerListSortPreference) == 0x000001, "Wrong alignment on WBP_OptionMenu_JoinGame_C_GetServerListSortPreference");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_GetServerListSortPreference) == 0x000004, "Wrong size on WBP_OptionMenu_JoinGame_C_GetServerListSortPreference");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_GetServerListSortPreference, SortPreference) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_GetServerListSortPreference::SortPreference' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_GetServerListSortPreference, CallFunc_GetSelectedServerSortPreference_SortPreference) == 0x000002, "Member 'WBP_OptionMenu_JoinGame_C_GetServerListSortPreference::CallFunc_GetSelectedServerSortPreference_SortPreference' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.ToggleServerDetails
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_ToggleServerDetails final
{
public:
	bool                                          bShown;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_ToggleServerDetails) == 0x000001, "Wrong alignment on WBP_OptionMenu_JoinGame_C_ToggleServerDetails");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_ToggleServerDetails) == 0x000001, "Wrong size on WBP_OptionMenu_JoinGame_C_ToggleServerDetails");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_ToggleServerDetails, bShown) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_ToggleServerDetails::bShown' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.RefreshServerList
// 0x0003 (0x0003 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_RefreshServerList final
{
public:
	struct FFServerSortPreference                 CallFunc_GetServerListSortPreference_SortPreference; // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_RefreshServerList) == 0x000001, "Wrong alignment on WBP_OptionMenu_JoinGame_C_RefreshServerList");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_RefreshServerList) == 0x000003, "Wrong size on WBP_OptionMenu_JoinGame_C_RefreshServerList");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_RefreshServerList, CallFunc_GetServerListSortPreference_SortPreference) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_RefreshServerList::CallFunc_GetServerListSortPreference_SortPreference' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_RefreshServerList, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_OptionMenu_JoinGame_C_RefreshServerList::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.OpenPasswordPrompt
// 0x0018 (0x0018 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_OpenPasswordPrompt final
{
public:
	TDelegate<void(class FText InputText)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UWBP_DlgBox_ServerPasswordPrompt_C*     CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_OpenPasswordPrompt) == 0x000008, "Wrong alignment on WBP_OptionMenu_JoinGame_C_OpenPasswordPrompt");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_OpenPasswordPrompt) == 0x000018, "Wrong size on WBP_OptionMenu_JoinGame_C_OpenPasswordPrompt");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_OpenPasswordPrompt, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_OpenPasswordPrompt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_OpenPasswordPrompt, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_OptionMenu_JoinGame_C_OpenPasswordPrompt::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.GetDesiredVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_GetDesiredVerticalAlignment final
{
public:
	EVerticalAlignment                            Alignment;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_GetDesiredVerticalAlignment) == 0x000001, "Wrong alignment on WBP_OptionMenu_JoinGame_C_GetDesiredVerticalAlignment");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_GetDesiredVerticalAlignment) == 0x000001, "Wrong size on WBP_OptionMenu_JoinGame_C_GetDesiredVerticalAlignment");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_GetDesiredVerticalAlignment, Alignment) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_GetDesiredVerticalAlignment::Alignment' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.GetDesiredHorizontalAlignment
// 0x0006 (0x0006 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment final
{
public:
	EHorizontalAlignment                          Alignment;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment) == 0x000001, "Wrong alignment on WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment) == 0x000006, "Wrong size on WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment, Alignment) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment::Alignment' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment, Temp_bool_Variable) == 0x000001, "Member 'WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment, Temp_byte_Variable) == 0x000002, "Member 'WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment, CallFunc_IsVisible_ReturnValue) == 0x000004, "Member 'WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment, K2Node_Select_Default) == 0x000005, "Member 'WBP_OptionMenu_JoinGame_C_GetDesiredHorizontalAlignment::K2Node_Select_Default' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.GetSubMenuOptions
// 0x0010 (0x0010 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_GetSubMenuOptions final
{
public:
	TArray<struct FFSubMenuOption>                SubOptions;                                        // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_GetSubMenuOptions) == 0x000008, "Wrong alignment on WBP_OptionMenu_JoinGame_C_GetSubMenuOptions");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_GetSubMenuOptions) == 0x000010, "Wrong size on WBP_OptionMenu_JoinGame_C_GetSubMenuOptions");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_GetSubMenuOptions, SubOptions) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_GetSubMenuOptions::SubOptions' has a wrong offset!");

// Function WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C.HasSubMenus
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionMenu_JoinGame_C_HasSubMenus final
{
public:
	bool                                          bSubMenuOptions;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionMenu_JoinGame_C_HasSubMenus) == 0x000001, "Wrong alignment on WBP_OptionMenu_JoinGame_C_HasSubMenus");
static_assert(sizeof(WBP_OptionMenu_JoinGame_C_HasSubMenus) == 0x000001, "Wrong size on WBP_OptionMenu_JoinGame_C_HasSubMenus");
static_assert(offsetof(WBP_OptionMenu_JoinGame_C_HasSubMenus, bSubMenuOptions) == 0x000000, "Member 'WBP_OptionMenu_JoinGame_C_HasSubMenus::bSubMenuOptions' has a wrong offset!");

}

