#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModifierSetting_EditableText

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModifierSetting_EditableText.WBP_ModifierSetting_EditableText_C.OnTextChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSetting_EditableText_C_OnTextChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModifierSetting_EditableText_C_OnTextChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModifierSetting_EditableText_C_OnTextChanged__DelegateSignature");
static_assert(sizeof(WBP_ModifierSetting_EditableText_C_OnTextChanged__DelegateSignature) == 0x000018, "Wrong size on WBP_ModifierSetting_EditableText_C_OnTextChanged__DelegateSignature");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_OnTextChanged__DelegateSignature, Text) == 0x000000, "Member 'WBP_ModifierSetting_EditableText_C_OnTextChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_ModifierSetting_EditableText.WBP_ModifierSetting_EditableText_C.OnTextCommitted__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModifierSetting_EditableText_C_OnTextCommitted__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_EditableText_C_OnTextCommitted__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModifierSetting_EditableText_C_OnTextCommitted__DelegateSignature");
static_assert(sizeof(WBP_ModifierSetting_EditableText_C_OnTextCommitted__DelegateSignature) == 0x000020, "Wrong size on WBP_ModifierSetting_EditableText_C_OnTextCommitted__DelegateSignature");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_OnTextCommitted__DelegateSignature, Text) == 0x000000, "Member 'WBP_ModifierSetting_EditableText_C_OnTextCommitted__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_OnTextCommitted__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_ModifierSetting_EditableText_C_OnTextCommitted__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_ModifierSetting_EditableText.WBP_ModifierSetting_EditableText_C.ExecuteUbergraph_WBP_ModifierSetting_EditableText
// 0x0078 (0x0078 - 0x0000)
struct WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0028(0x0018)()
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0040(0x0018)(ConstParm)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0058(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText) == 0x000008, "Wrong alignment on WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText");
static_assert(sizeof(WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText) == 0x000078, "Wrong size on WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText, EntryPoint) == 0x000000, "Member 'WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText, Temp_text_Variable) == 0x000008, "Member 'WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText, CallFunc_TextIsEmpty_ReturnValue) == 0x000021, "Member 'WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText, Temp_bool_Variable) == 0x000022, "Member 'WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText, K2Node_Select_Default) == 0x000028, "Member 'WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText, K2Node_ComponentBoundEvent_Text_1) == 0x000040, "Member 'WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText, K2Node_ComponentBoundEvent_Text) == 0x000058, "Member 'WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText, K2Node_ComponentBoundEvent_CommitMethod) == 0x000070, "Member 'WBP_ModifierSetting_EditableText_C_ExecuteUbergraph_WBP_ModifierSetting_EditableText::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");

// Function WBP_ModifierSetting_EditableText.WBP_ModifierSetting_EditableText_C.BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_ModifierSetting_EditableText.WBP_ModifierSetting_EditableText_C.BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_ModifierSetting_EditableText_C_BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_ModifierSetting_EditableText.WBP_ModifierSetting_EditableText_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModifierSetting_EditableText_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ModifierSetting_EditableText_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModifierSetting_EditableText_C_PreConstruct");
static_assert(sizeof(WBP_ModifierSetting_EditableText_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModifierSetting_EditableText_C_PreConstruct");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModifierSetting_EditableText_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModifierSetting_EditableText.WBP_ModifierSetting_EditableText_C.SetSettingLabel
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSetting_EditableText_C_SetSettingLabel final
{
public:
	class FText                                   InSettingText;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModifierSetting_EditableText_C_SetSettingLabel) == 0x000008, "Wrong alignment on WBP_ModifierSetting_EditableText_C_SetSettingLabel");
static_assert(sizeof(WBP_ModifierSetting_EditableText_C_SetSettingLabel) == 0x000018, "Wrong size on WBP_ModifierSetting_EditableText_C_SetSettingLabel");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_SetSettingLabel, InSettingText) == 0x000000, "Member 'WBP_ModifierSetting_EditableText_C_SetSettingLabel::InSettingText' has a wrong offset!");

// Function WBP_ModifierSetting_EditableText.WBP_ModifierSetting_EditableText_C.GetSettingLabel
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSetting_EditableText_C_GetSettingLabel final
{
public:
	class FText                                   SettingText;                                       // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(WBP_ModifierSetting_EditableText_C_GetSettingLabel) == 0x000008, "Wrong alignment on WBP_ModifierSetting_EditableText_C_GetSettingLabel");
static_assert(sizeof(WBP_ModifierSetting_EditableText_C_GetSettingLabel) == 0x000018, "Wrong size on WBP_ModifierSetting_EditableText_C_GetSettingLabel");
static_assert(offsetof(WBP_ModifierSetting_EditableText_C_GetSettingLabel, SettingText) == 0x000000, "Member 'WBP_ModifierSetting_EditableText_C_GetSettingLabel::SettingText' has a wrong offset!");

}

