#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HDPOI_Player

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HDPOI_Player.WBP_HDPOI_Player_C.ExecuteUbergraph_WBP_HDPOI_Player
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Event_NewIconBrush;                         // 0x0008(0x0088)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0090(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderTransformAngle_ReturnValue;      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player) == 0x000008, "Wrong alignment on WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player");
static_assert(sizeof(WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player) == 0x0000D8, "Wrong size on WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player");
static_assert(offsetof(WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player, EntryPoint) == 0x000000, "Member 'WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player, K2Node_Event_NewIconBrush) == 0x000008, "Member 'WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player::K2Node_Event_NewIconBrush' has a wrong offset!");
static_assert(offsetof(WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player, K2Node_Event_MyGeometry) == 0x000090, "Member 'WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player, K2Node_Event_InDeltaTime) == 0x0000C8, "Member 'WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player, CallFunc_GetRenderTransformAngle_ReturnValue) == 0x0000CC, "Member 'WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player::CallFunc_GetRenderTransformAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D0, "Member 'WBP_HDPOI_Player_C_ExecuteUbergraph_WBP_HDPOI_Player::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_HDPOI_Player.WBP_HDPOI_Player_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_HDPOI_Player_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HDPOI_Player_C_Tick) == 0x000004, "Wrong alignment on WBP_HDPOI_Player_C_Tick");
static_assert(sizeof(WBP_HDPOI_Player_C_Tick) == 0x00003C, "Wrong size on WBP_HDPOI_Player_C_Tick");
static_assert(offsetof(WBP_HDPOI_Player_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_HDPOI_Player_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HDPOI_Player_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_HDPOI_Player_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_HDPOI_Player.WBP_HDPOI_Player_C.SetIconBrush
// 0x0088 (0x0088 - 0x0000)
struct WBP_HDPOI_Player_C_SetIconBrush final
{
public:
	struct FSlateBrush                            NewIconBrush;                                      // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_HDPOI_Player_C_SetIconBrush) == 0x000008, "Wrong alignment on WBP_HDPOI_Player_C_SetIconBrush");
static_assert(sizeof(WBP_HDPOI_Player_C_SetIconBrush) == 0x000088, "Wrong size on WBP_HDPOI_Player_C_SetIconBrush");
static_assert(offsetof(WBP_HDPOI_Player_C_SetIconBrush, NewIconBrush) == 0x000000, "Member 'WBP_HDPOI_Player_C_SetIconBrush::NewIconBrush' has a wrong offset!");

// Function WBP_HDPOI_Player.WBP_HDPOI_Player_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_HDPOI_Player_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HDPOI_Player_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_HDPOI_Player_C_PreConstruct");
static_assert(sizeof(WBP_HDPOI_Player_C_PreConstruct) == 0x000001, "Wrong size on WBP_HDPOI_Player_C_PreConstruct");
static_assert(offsetof(WBP_HDPOI_Player_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_HDPOI_Player_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

