#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeployMenu_DeployButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C
// 0x05D8 (0x0808 - 0x0230)
class UWBP_DeployMenu_DeployButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                DeployBtn;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DeployBtnText;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bCloseBtnBehavior;                                 // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DeployText;                                        // 0x0250(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly)
	class FText                                   CloseMenuText;                                     // 0x0268(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPressed;                                         // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnReleased;                                        // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnHovered;                                         // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhovered;                                       // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   SelectSpawnText;                                   // 0x02D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          bDeploying;                                        // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           DeployBtnStyle;                                    // 0x02F0(0x0278)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FButtonStyle                           CancelBtnStyle;                                    // 0x0568(0x0278)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          bDesignPreviewCancelBtn;                           // 0x07E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CancelDeploymentText;                              // 0x07E8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          bSpawnPointSelected;                               // 0x0800(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bUseCancelBehavior;                                // 0x0801(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnClicked__DelegateSignature(bool bCloseBtn);
	void OnPressed__DelegateSignature(bool bCloseBtn);
	void OnReleased__DelegateSignature(bool bCloseBtn);
	void OnHovered__DelegateSignature(bool bCloseBtn);
	void OnUnhovered__DelegateSignature(bool bCloseBtn);
	void ExecuteUbergraph_WBP_DeployMenu_DeployButton(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__DeployBtn_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__DeployBtn_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__DeployBtn_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__DeployBtn_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__DeployBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void UpdateDeployBtnState(bool bPlayerAlive, bool bDeploymentQueued, bool bSpawnPointSelected_0);
	void InternalUpdateBtnText(bool bDeploying_0, bool bSpawnPointSelected_0);
	void InternalUpdateBtnStyle();
	void InternalGetSpawnTimeRemaining(int32* SpawnSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DeployMenu_DeployButton_C">();
	}
	static class UWBP_DeployMenu_DeployButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DeployMenu_DeployButton_C>();
	}
};
static_assert(alignof(UWBP_DeployMenu_DeployButton_C) == 0x000008, "Wrong alignment on UWBP_DeployMenu_DeployButton_C");
static_assert(sizeof(UWBP_DeployMenu_DeployButton_C) == 0x000808, "Wrong size on UWBP_DeployMenu_DeployButton_C");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, UberGraphFrame) == 0x000230, "Member 'UWBP_DeployMenu_DeployButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, DeployBtn) == 0x000238, "Member 'UWBP_DeployMenu_DeployButton_C::DeployBtn' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, DeployBtnText) == 0x000240, "Member 'UWBP_DeployMenu_DeployButton_C::DeployBtnText' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, bCloseBtnBehavior) == 0x000248, "Member 'UWBP_DeployMenu_DeployButton_C::bCloseBtnBehavior' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, DeployText) == 0x000250, "Member 'UWBP_DeployMenu_DeployButton_C::DeployText' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, CloseMenuText) == 0x000268, "Member 'UWBP_DeployMenu_DeployButton_C::CloseMenuText' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, OnClicked) == 0x000280, "Member 'UWBP_DeployMenu_DeployButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, OnPressed) == 0x000290, "Member 'UWBP_DeployMenu_DeployButton_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, OnReleased) == 0x0002A0, "Member 'UWBP_DeployMenu_DeployButton_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, OnHovered) == 0x0002B0, "Member 'UWBP_DeployMenu_DeployButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, OnUnhovered) == 0x0002C0, "Member 'UWBP_DeployMenu_DeployButton_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, SelectSpawnText) == 0x0002D0, "Member 'UWBP_DeployMenu_DeployButton_C::SelectSpawnText' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, bDeploying) == 0x0002E8, "Member 'UWBP_DeployMenu_DeployButton_C::bDeploying' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, DeployBtnStyle) == 0x0002F0, "Member 'UWBP_DeployMenu_DeployButton_C::DeployBtnStyle' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, CancelBtnStyle) == 0x000568, "Member 'UWBP_DeployMenu_DeployButton_C::CancelBtnStyle' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, bDesignPreviewCancelBtn) == 0x0007E0, "Member 'UWBP_DeployMenu_DeployButton_C::bDesignPreviewCancelBtn' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, CancelDeploymentText) == 0x0007E8, "Member 'UWBP_DeployMenu_DeployButton_C::CancelDeploymentText' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, bSpawnPointSelected) == 0x000800, "Member 'UWBP_DeployMenu_DeployButton_C::bSpawnPointSelected' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_DeployButton_C, bUseCancelBehavior) == 0x000801, "Member 'UWBP_DeployMenu_DeployButton_C::bUseCancelBehavior' has a wrong offset!");

}

