#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RadialMenuIconBase

#include "Basic.hpp"

#include "EIconAnimationStyles_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_RadialMenuIconBase.WBP_RadialMenuIconBase_C.ExecuteUbergraph_WBP_RadialMenuIconBase
// 0x0090 (0x0090 - 0x0000)
struct WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EIconAnimationStyles                          Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase) == 0x000008, "Wrong alignment on WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase");
static_assert(sizeof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase) == 0x000090, "Wrong size on WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, EntryPoint) == 0x000000, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, Temp_object_Variable) == 0x000008, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, Temp_byte_Variable) == 0x000011, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, K2Node_Select_Default) == 0x000018, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, K2Node_Event_MyGeometry) == 0x000030, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, K2Node_Event_InDeltaTime) == 0x000068, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, CallFunc_FClamp_ReturnValue) == 0x00006C, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000070, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, CallFunc_Add_FloatFloat_ReturnValue) == 0x000074, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, CallFunc_LinearColorLerp_ReturnValue) == 0x000078, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000088, "Member 'WBP_RadialMenuIconBase_C_ExecuteUbergraph_WBP_RadialMenuIconBase::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_RadialMenuIconBase.WBP_RadialMenuIconBase_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_RadialMenuIconBase_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuIconBase_C_Tick) == 0x000004, "Wrong alignment on WBP_RadialMenuIconBase_C_Tick");
static_assert(sizeof(WBP_RadialMenuIconBase_C_Tick) == 0x00003C, "Wrong size on WBP_RadialMenuIconBase_C_Tick");
static_assert(offsetof(WBP_RadialMenuIconBase_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_RadialMenuIconBase_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuIconBase_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_RadialMenuIconBase_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_RadialMenuIconBase.WBP_RadialMenuIconBase_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_RadialMenuIconBase_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RadialMenuIconBase_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_RadialMenuIconBase_C_PreConstruct");
static_assert(sizeof(WBP_RadialMenuIconBase_C_PreConstruct) == 0x000001, "Wrong size on WBP_RadialMenuIconBase_C_PreConstruct");
static_assert(offsetof(WBP_RadialMenuIconBase_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_RadialMenuIconBase_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_RadialMenuIconBase.WBP_RadialMenuIconBase_C.Get_Icon_ColorAndOpacity_0
// 0x0010 (0x0010 - 0x0000)
struct WBP_RadialMenuIconBase_C_Get_Icon_ColorAndOpacity_0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuIconBase_C_Get_Icon_ColorAndOpacity_0) == 0x000004, "Wrong alignment on WBP_RadialMenuIconBase_C_Get_Icon_ColorAndOpacity_0");
static_assert(sizeof(WBP_RadialMenuIconBase_C_Get_Icon_ColorAndOpacity_0) == 0x000010, "Wrong size on WBP_RadialMenuIconBase_C_Get_Icon_ColorAndOpacity_0");
static_assert(offsetof(WBP_RadialMenuIconBase_C_Get_Icon_ColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'WBP_RadialMenuIconBase_C_Get_Icon_ColorAndOpacity_0::ReturnValue' has a wrong offset!");

}

