#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RadialMenuIconBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SRadialMenuIconSettings_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "EIconAnimationStyles_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RadialMenuIconBase.WBP_RadialMenuIconBase_C
// 0x0078 (0x02A8 - 0x0230)
class UWBP_RadialMenuIconBase_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Shake;                                             // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Grow;                                              // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Sizer;                                             // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             IconImage;                                         // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         IconSize;                                          // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSRadialMenuIconSettings               Settings;                                          // 0x0264(0x0028)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           CurrentColor;                                      // 0x028C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Highlighted;                                       // 0x029C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EBB[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Alpha;                                             // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_RadialMenuIconBase(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnUnhighlight();
	void OnHighlight();
	void PreConstruct(bool IsDesignTime);
	struct FLinearColor Get_Icon_ColorAndOpacity_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RadialMenuIconBase_C">();
	}
	static class UWBP_RadialMenuIconBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RadialMenuIconBase_C>();
	}
};
static_assert(alignof(UWBP_RadialMenuIconBase_C) == 0x000008, "Wrong alignment on UWBP_RadialMenuIconBase_C");
static_assert(sizeof(UWBP_RadialMenuIconBase_C) == 0x0002A8, "Wrong size on UWBP_RadialMenuIconBase_C");
static_assert(offsetof(UWBP_RadialMenuIconBase_C, UberGraphFrame) == 0x000230, "Member 'UWBP_RadialMenuIconBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuIconBase_C, Shake) == 0x000238, "Member 'UWBP_RadialMenuIconBase_C::Shake' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuIconBase_C, Grow) == 0x000240, "Member 'UWBP_RadialMenuIconBase_C::Grow' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuIconBase_C, Icon) == 0x000248, "Member 'UWBP_RadialMenuIconBase_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuIconBase_C, Sizer) == 0x000250, "Member 'UWBP_RadialMenuIconBase_C::Sizer' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuIconBase_C, IconImage) == 0x000258, "Member 'UWBP_RadialMenuIconBase_C::IconImage' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuIconBase_C, IconSize) == 0x000260, "Member 'UWBP_RadialMenuIconBase_C::IconSize' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuIconBase_C, Settings) == 0x000264, "Member 'UWBP_RadialMenuIconBase_C::Settings' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuIconBase_C, CurrentColor) == 0x00028C, "Member 'UWBP_RadialMenuIconBase_C::CurrentColor' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuIconBase_C, Highlighted) == 0x00029C, "Member 'UWBP_RadialMenuIconBase_C::Highlighted' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenuIconBase_C, Alpha) == 0x0002A0, "Member 'UWBP_RadialMenuIconBase_C::Alpha' has a wrong offset!");

}

