#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeployMenu_PlatoonSquadList

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList
// 0x0070 (0x0070 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatoonValid_bValidPLTN;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlatoonValid_bValidPLTN_1;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HDPlayerControllerBase_C*           K2Node_DynamicCast_AsBP_HDPlayer_Controller_Base;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_DeployMenu_SquadList_C*            CallFunc_AddNewSquadItemWidget_SquadItemWidget;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HDPlayerControllerBase_C*           K2Node_DynamicCast_AsBP_HDPlayer_Controller_Base_1; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasReachedMaxSquadLimit_ReturnValue;      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USquadListEntry*                        K2Node_Event_RemovedSquadData;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RemovedSquadIdx;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USquadListEntry*                        K2Node_Event_SquadData;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_DeployMenu_SquadList_C*            CallFunc_AddNewSquadItemWidget_SquadItemWidget_1;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList) == 0x000008, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList) == 0x000070, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, EntryPoint) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_IsPlatoonValid_bValidPLTN) == 0x000004, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_IsPlatoonValid_bValidPLTN' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_IsPlatoonValid_bValidPLTN_1) == 0x000005, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_IsPlatoonValid_bValidPLTN_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, K2Node_DynamicCast_AsBP_HDPlayer_Controller_Base) == 0x000010, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::K2Node_DynamicCast_AsBP_HDPlayer_Controller_Base' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, K2Node_Event_IsDesignTime) == 0x00001A, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_AddNewSquadItemWidget_SquadItemWidget) == 0x000020, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_AddNewSquadItemWidget_SquadItemWidget' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000028, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, K2Node_DynamicCast_AsBP_HDPlayer_Controller_Base_1) == 0x000030, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::K2Node_DynamicCast_AsBP_HDPlayer_Controller_Base_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_HasReachedMaxSquadLimit_ReturnValue) == 0x000039, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_HasReachedMaxSquadLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, K2Node_Event_RemovedSquadData) == 0x000040, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::K2Node_Event_RemovedSquadData' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, K2Node_Event_RemovedSquadIdx) == 0x000048, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::K2Node_Event_RemovedSquadIdx' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, K2Node_Event_SquadData) == 0x000050, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::K2Node_Event_SquadData' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_AddNewSquadItemWidget_SquadItemWidget_1) == 0x000058, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_AddNewSquadItemWidget_SquadItemWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, Temp_int_Variable) == 0x000060, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000064, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_BooleanAND_ReturnValue) == 0x00006C, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList, CallFunc_BooleanOR_ReturnValue) == 0x00006D, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_PreConstruct");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_PreConstruct) == 0x000001, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_PreConstruct");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.DeconstructSquad
// 0x0010 (0x0010 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_DeconstructSquad final
{
public:
	class USquadListEntry*                        RemovedSquadData;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RemovedSquadIdx;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_DeconstructSquad) == 0x000008, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_DeconstructSquad");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_DeconstructSquad) == 0x000010, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_DeconstructSquad");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_DeconstructSquad, RemovedSquadData) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_DeconstructSquad::RemovedSquadData' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_DeconstructSquad, RemovedSquadIdx) == 0x000008, "Member 'WBP_DeployMenu_PlatoonSquadList_C_DeconstructSquad::RemovedSquadIdx' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.GenerateSquad
// 0x0008 (0x0008 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_GenerateSquad final
{
public:
	class USquadListEntry*                        SquadData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_GenerateSquad) == 0x000008, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_GenerateSquad");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_GenerateSquad) == 0x000008, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_GenerateSquad");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_GenerateSquad, SquadData) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_GenerateSquad::SquadData' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.AddNewSquadItemWidget
// 0x0028 (0x0028 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget final
{
public:
	class USquadListEntry*                        SquadData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_DeployMenu_SquadList_C*            SquadItemWidget;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_DeployMenu_SquadList_C*            CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget) == 0x000008, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget) == 0x000028, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget, SquadData) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget::SquadData' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget, SquadItemWidget) == 0x000008, "Member 'WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget::SquadItemWidget' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_DeployMenu_PlatoonSquadList_C_AddNewSquadItemWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.RemoveSquadItemWidgetFromList
// 0x0068 (0x0068 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList final
{
public:
	class USquadListEntry*                        RemovedSquadData;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RemoveIdx;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DeployMenu_SquadList_C*            K2Node_DynamicCast_AsWBP_Deploy_Menu_Squad_List;   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue_1;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_DeployMenu_SquadList_C*            K2Node_DynamicCast_AsWBP_Deploy_Menu_Squad_List_1; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList) == 0x000008, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList) == 0x000068, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, RemovedSquadData) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::RemovedSquadData' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, RemoveIdx) == 0x000008, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::RemoveIdx' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, CallFunc_RemoveChildAt_ReturnValue) == 0x000010, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, K2Node_DynamicCast_AsWBP_Deploy_Menu_Squad_List) == 0x000038, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::K2Node_DynamicCast_AsWBP_Deploy_Menu_Squad_List' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000042, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, CallFunc_RemoveChildAt_ReturnValue_1) == 0x000048, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::CallFunc_RemoveChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, CallFunc_GetChildAt_ReturnValue) == 0x000050, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, K2Node_DynamicCast_AsWBP_Deploy_Menu_Squad_List_1) == 0x000058, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::K2Node_DynamicCast_AsWBP_Deploy_Menu_Squad_List_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000062, "Member 'WBP_DeployMenu_PlatoonSquadList_C_RemoveSquadItemWidgetFromList::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.ExpandList
// 0x0003 (0x0003 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_ExpandList final
{
public:
	bool                                          CallFunc_HasAnySquads_bValidSquadsPresent;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_ExpandList) == 0x000001, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_ExpandList");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_ExpandList) == 0x000003, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_ExpandList");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExpandList, CallFunc_HasAnySquads_bValidSquadsPresent) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExpandList::CallFunc_HasAnySquads_bValidSquadsPresent' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExpandList, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExpandList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_ExpandList, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WBP_DeployMenu_PlatoonSquadList_C_ExpandList::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.CollapseListIfEmpty
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_CollapseListIfEmpty final
{
public:
	bool                                          CallFunc_HasAnySquads_bValidSquadsPresent;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_CollapseListIfEmpty) == 0x000001, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_CollapseListIfEmpty");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_CollapseListIfEmpty) == 0x000001, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_CollapseListIfEmpty");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_CollapseListIfEmpty, CallFunc_HasAnySquads_bValidSquadsPresent) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_CollapseListIfEmpty::CallFunc_HasAnySquads_bValidSquadsPresent' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.UpdateSquadCountText
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText final
{
public:
	int32                                         CallFunc_GetNumSquads_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxSquadLimit_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0048(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText) == 0x000008, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText) == 0x0000B0, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText, CallFunc_GetNumSquads_ReturnValue) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText::CallFunc_GetNumSquads_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText, CallFunc_GetMaxSquadLimit_ReturnValue) == 0x000004, "Member 'WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText::CallFunc_GetMaxSquadLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000048, "Member 'WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText, CallFunc_Format_ReturnValue) == 0x000098, "Member 'WBP_DeployMenu_PlatoonSquadList_C_UpdateSquadCountText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.UpdateCreateBtnAvailability
// 0x0002 (0x0002 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_UpdateCreateBtnAvailability final
{
public:
	bool                                          CallFunc_HasReachedMaxSquadLimit_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_UpdateCreateBtnAvailability) == 0x000001, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_UpdateCreateBtnAvailability");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_UpdateCreateBtnAvailability) == 0x000002, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_UpdateCreateBtnAvailability");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_UpdateCreateBtnAvailability, CallFunc_HasReachedMaxSquadLimit_ReturnValue) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_UpdateCreateBtnAvailability::CallFunc_HasReachedMaxSquadLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_UpdateCreateBtnAvailability, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_DeployMenu_PlatoonSquadList_C_UpdateCreateBtnAvailability::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.SetPlatoonNameText
// 0x0098 (0x0098 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText final
{
public:
	class FText                                   NewPlatoonName;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText) == 0x000008, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText) == 0x000098, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText, NewPlatoonName) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText::NewPlatoonName' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText, CallFunc_TextToUpper_ReturnValue) == 0x000018, "Member 'WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText, CallFunc_Format_ReturnValue) == 0x000080, "Member 'WBP_DeployMenu_PlatoonSquadList_C_SetPlatoonNameText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.HasAnySquads
// 0x0018 (0x0018 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads final
{
public:
	bool                                          bValidSquadsPresent;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlatoonValid_bValidPLTN;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHDPlatoonState*                        CallFunc_GetPlatoonStateFromData_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumSquads_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads) == 0x000008, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads) == 0x000018, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads, bValidSquadsPresent) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads::bValidSquadsPresent' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads, CallFunc_IsPlatoonValid_bValidPLTN) == 0x000001, "Member 'WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads::CallFunc_IsPlatoonValid_bValidPLTN' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads, CallFunc_GetPlatoonStateFromData_ReturnValue) == 0x000008, "Member 'WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads::CallFunc_GetPlatoonStateFromData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads, CallFunc_GetNumSquads_ReturnValue) == 0x000010, "Member 'WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads::CallFunc_GetNumSquads_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'WBP_DeployMenu_PlatoonSquadList_C_HasAnySquads::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.WasListCollapsedByUser
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_WasListCollapsedByUser final
{
public:
	bool                                          bCollapsedByUser_0;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_WasListCollapsedByUser) == 0x000001, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_WasListCollapsedByUser");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_WasListCollapsedByUser) == 0x000001, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_WasListCollapsedByUser");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_WasListCollapsedByUser, bCollapsedByUser_0) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_WasListCollapsedByUser::bCollapsedByUser_0' has a wrong offset!");

// Function WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C.IsPlatoonValid
// 0x0018 (0x0018 - 0x0000)
struct WBP_DeployMenu_PlatoonSquadList_C_IsPlatoonValid final
{
public:
	bool                                          bValidPLTN;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHDPlatoonState*                        CallFunc_GetPlatoonStateFromData_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_PlatoonSquadList_C_IsPlatoonValid) == 0x000008, "Wrong alignment on WBP_DeployMenu_PlatoonSquadList_C_IsPlatoonValid");
static_assert(sizeof(WBP_DeployMenu_PlatoonSquadList_C_IsPlatoonValid) == 0x000018, "Wrong size on WBP_DeployMenu_PlatoonSquadList_C_IsPlatoonValid");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_IsPlatoonValid, bValidPLTN) == 0x000000, "Member 'WBP_DeployMenu_PlatoonSquadList_C_IsPlatoonValid::bValidPLTN' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_PlatoonSquadList_C_IsPlatoonValid, CallFunc_GetPlatoonStateFromData_ReturnValue) == 0x000008, "Member 'WBP_DeployMenu_PlatoonSquadList_C_IsPlatoonValid::CallFunc_GetPlatoonStateFromData_ReturnValue' has a wrong offset!");
