#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsMenuItem_Arrow

#include "Basic.hpp"

#include "FOptionItemSelection_structs.hpp"
#include "EArrowOptionsPreset_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 SelectedItemValue;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_OnSelectionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_OnSelectionChanged__DelegateSignature");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_OnSelectionChanged__DelegateSignature) == 0x000018, "Wrong size on WBP_OptionsMenuItem_Arrow_C_OnSelectionChanged__DelegateSignature");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_OnSelectionChanged__DelegateSignature, SelectedItemValue) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_OnSelectionChanged__DelegateSignature::SelectedItemValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_OnSelectionChanged__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_OptionsMenuItem_Arrow_C_OnSelectionChanged__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.OnSelectionChangedByUser__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_OnSelectionChangedByUser__DelegateSignature final
{
public:
	class FString                                 SelectedItemValue;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_OnSelectionChangedByUser__DelegateSignature) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_OnSelectionChangedByUser__DelegateSignature");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_OnSelectionChangedByUser__DelegateSignature) == 0x000010, "Wrong size on WBP_OptionsMenuItem_Arrow_C_OnSelectionChangedByUser__DelegateSignature");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_OnSelectionChangedByUser__DelegateSignature, SelectedItemValue) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_OnSelectionChangedByUser__DelegateSignature::SelectedItemValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.ExecuteUbergraph_WBP_OptionsMenuItem_Arrow
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_5;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0068(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& SelectedItemValue, ESelectInfo SelectionType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_SelectedItemValue;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_CustomEvent_SelectionType;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow) == 0x0000B0, "Wrong size on WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, EntryPoint) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Percent_IntInt_ReturnValue) == 0x000014, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Array_Length_ReturnValue_1) == 0x00001C, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000020, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Percent_IntInt_ReturnValue_2) == 0x000024, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Array_Length_ReturnValue_2) == 0x00002C, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Array_Length_ReturnValue_3) == 0x000030, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000034, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Max_ReturnValue) == 0x00003C, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Clamp_ReturnValue) == 0x000040, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Array_Length_ReturnValue_4) == 0x000044, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Array_Length_ReturnValue_5) == 0x000048, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00004C, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Greater_IntInt_ReturnValue_2) == 0x00004D, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Array_Length_ReturnValue_6) == 0x000050, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Array_Length_ReturnValue_7) == 0x000054, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000058, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Greater_IntInt_ReturnValue_4) == 0x000059, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Greater_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Array_Length_ReturnValue_8) == 0x00005C, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Array_Length_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_Greater_IntInt_ReturnValue_5) == 0x000060, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_Greater_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_BooleanAND_ReturnValue_1) == 0x000061, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, CallFunc_TextToUpper_ReturnValue) == 0x000068, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, K2Node_Event_IsDesignTime) == 0x000080, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, K2Node_CreateDelegate_OutputDelegate) == 0x000084, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, K2Node_CustomEvent_SelectedItemValue) == 0x000098, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::K2Node_CustomEvent_SelectedItemValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, K2Node_CustomEvent_SelectionType) == 0x0000A8, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::K2Node_CustomEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow, K2Node_SwitchEnum_CmpSuccess) == 0x0000A9, "Member 'WBP_OptionsMenuItem_Arrow_C_ExecuteUbergraph_WBP_OptionsMenuItem_Arrow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.OnItemSelectionChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_OnItemSelectionChanged final
{
public:
	class FString                                 SelectedItemValue;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_OnItemSelectionChanged) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_OnItemSelectionChanged");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_OnItemSelectionChanged) == 0x000018, "Wrong size on WBP_OptionsMenuItem_Arrow_C_OnItemSelectionChanged");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_OnItemSelectionChanged, SelectedItemValue) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_OnItemSelectionChanged::SelectedItemValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_OnItemSelectionChanged, SelectionType) == 0x000010, "Member 'WBP_OptionsMenuItem_Arrow_C_OnItemSelectionChanged::SelectionType' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_PreConstruct");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_PreConstruct) == 0x000001, "Wrong size on WBP_OptionsMenuItem_Arrow_C_PreConstruct");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.INTERNAL_SetSelectedOptionByIndex
// 0x0020 (0x0020 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0008(0x0018)()
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex) == 0x000020, "Wrong size on WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex, Index_0) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex, SelectionType) == 0x000004, "Member 'WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex::SelectionType' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000005, "Member 'WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex, CallFunc_TextToUpper_ReturnValue) == 0x000008, "Member 'WBP_OptionsMenuItem_Arrow_C_INTERNAL_SetSelectedOptionByIndex::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.GetSelectedOptionValue
// 0x0020 (0x0020 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_GetSelectedOptionValue final
{
public:
	class FString                                 OptionValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetOptionValueAtIndex_OptionValue;        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_GetSelectedOptionValue) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_GetSelectedOptionValue");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_GetSelectedOptionValue) == 0x000020, "Wrong size on WBP_OptionsMenuItem_Arrow_C_GetSelectedOptionValue");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_GetSelectedOptionValue, OptionValue) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_GetSelectedOptionValue::OptionValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_GetSelectedOptionValue, CallFunc_GetOptionValueAtIndex_OptionValue) == 0x000010, "Member 'WBP_OptionsMenuItem_Arrow_C_GetSelectedOptionValue::CallFunc_GetOptionValueAtIndex_OptionValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.GetOptionValueAtIndex
// 0x0048 (0x0048 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OptionValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex) == 0x000048, "Wrong size on WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex, Index_0) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex, OptionValue) == 0x000008, "Member 'WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex::OptionValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex, Temp_bool_Variable) == 0x000018, "Member 'WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex, Temp_string_Variable) == 0x000020, "Member 'WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000030, "Member 'WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex, K2Node_Select_Default) == 0x000038, "Member 'WBP_OptionsMenuItem_Arrow_C_GetOptionValueAtIndex::K2Node_Select_Default' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.AddOption
// 0x0030 (0x0030 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_AddOption final
{
public:
	struct FFOptionItemSelection                  NewOption;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_AddOption) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_AddOption");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_AddOption) == 0x000030, "Wrong size on WBP_OptionsMenuItem_Arrow_C_AddOption");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_AddOption, NewOption) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_AddOption::NewOption' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_AddOption, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'WBP_OptionsMenuItem_Arrow_C_AddOption::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.GetOptionCount
// 0x0008 (0x0008 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_GetOptionCount final
{
public:
	int32                                         OptionCount;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_GetOptionCount) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_GetOptionCount");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_GetOptionCount) == 0x000008, "Wrong size on WBP_OptionsMenuItem_Arrow_C_GetOptionCount");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_GetOptionCount, OptionCount) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_GetOptionCount::OptionCount' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_GetOptionCount, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_OptionsMenuItem_Arrow_C_GetOptionCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.RemoveOptionAtIndex
// 0x0008 (0x0008 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex final
{
public:
	int32                                         IndexToRemove;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRemovalSuccess;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex) == 0x000008, "Wrong size on WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex, IndexToRemove) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex::IndexToRemove' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex, bRemovalSuccess) == 0x000004, "Member 'WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex::bRemovalSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000005, "Member 'WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000006, "Member 'WBP_OptionsMenuItem_Arrow_C_RemoveOptionAtIndex::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.INTERNAL_ClearSelection
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_INTERNAL_ClearSelection final
{
public:
	ESelectInfo                                   DeselectionType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_INTERNAL_ClearSelection) == 0x000001, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_INTERNAL_ClearSelection");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_INTERNAL_ClearSelection) == 0x000001, "Wrong size on WBP_OptionsMenuItem_Arrow_C_INTERNAL_ClearSelection");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_INTERNAL_ClearSelection, DeselectionType) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_INTERNAL_ClearSelection::DeselectionType' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.SetSelectedOptionByIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByIndex) == 0x000004, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByIndex");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByIndex) == 0x000004, "Wrong size on WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByIndex");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByIndex, Index_0) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByIndex::Index_0' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.FindOptionValueIndex
// 0x0070 (0x0070 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex final
{
public:
	class FString                                 OptionValue;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InOptionValue;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         OptionIndex;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFOptionItemSelection                  CallFunc_Array_Get_Item;                           // 0x0040(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex) == 0x000070, "Wrong size on WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, OptionValue) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::OptionValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, Index_0) == 0x000010, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, InOptionValue) == 0x000018, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::InOptionValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, OptionIndex) == 0x000028, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::OptionIndex' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, Temp_bool_True_if_break_was_hit_Variable) == 0x00002C, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, CallFunc_Not_PreBool_ReturnValue) == 0x00002D, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00006D, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex, CallFunc_BooleanAND_ReturnValue) == 0x00006E, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionValueIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.PopulateOptionsByPreset
// 0x0040 (0x0040 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset final
{
public:
	EArrowOptionsPreset                           Preset;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFOptionItemSelection                  CallFunc_Array_Get_Item;                           // 0x0010(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset) == 0x000040, "Wrong size on WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset, Preset) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset::Preset' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_OptionsMenuItem_Arrow_C_PopulateOptionsByPreset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.SetSelectedOptionByValue
// 0x0018 (0x0018 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByValue final
{
public:
	class FString                                 OptionValue;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindOptionValueIndex_Index;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByValue) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByValue");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByValue) == 0x000018, "Wrong size on WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByValue");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByValue, OptionValue) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByValue::OptionValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByValue, CallFunc_FindOptionValueIndex_Index) == 0x000010, "Member 'WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByValue::CallFunc_FindOptionValueIndex_Index' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByValue, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_OptionsMenuItem_Arrow_C_SetSelectedOptionByValue::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.SetSelectedOption
// 0x0020 (0x0020 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_SetSelectedOption final
{
public:
	class FText                                   OptionDisplayName;                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CallFunc_FindOptionIndex_Index;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOption) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_SetSelectedOption");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOption) == 0x000020, "Wrong size on WBP_OptionsMenuItem_Arrow_C_SetSelectedOption");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOption, OptionDisplayName) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_SetSelectedOption::OptionDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOption, CallFunc_FindOptionIndex_Index) == 0x000018, "Member 'WBP_OptionsMenuItem_Arrow_C_SetSelectedOption::CallFunc_FindOptionIndex_Index' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_SetSelectedOption, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_OptionsMenuItem_Arrow_C_SetSelectedOption::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenuItem_Arrow.WBP_OptionsMenuItem_Arrow_C.FindOptionIndex
// 0x0080 (0x0080 - 0x0000)
struct WBP_OptionsMenuItem_Arrow_C_FindOptionIndex final
{
public:
	class FText                                   OptionDisplayName;                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Index_0;                                           // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InOptionDisplayName;                               // 0x0020(0x0018)(Edit, BlueprintVisible)
	int32                                         OptionIndex;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFOptionItemSelection                  CallFunc_Array_Get_Item;                           // 0x0050(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_OptionsMenuItem_Arrow_C_FindOptionIndex) == 0x000008, "Wrong alignment on WBP_OptionsMenuItem_Arrow_C_FindOptionIndex");
static_assert(sizeof(WBP_OptionsMenuItem_Arrow_C_FindOptionIndex) == 0x000080, "Wrong size on WBP_OptionsMenuItem_Arrow_C_FindOptionIndex");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionIndex, OptionDisplayName) == 0x000000, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionIndex::OptionDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionIndex, Index_0) == 0x000018, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenuItem_Arrow_C_FindOptionIndex, InOptionDisplayName) == 0x000020, "Member 'WBP_OptionsMenuItem_Arrow_C_FindOptionIndex::InOptionDisplayName' has a wrong offset!");
