#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JoinServerListEntry

#include "Basic.hpp"

#include "HDMain_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_JoinServerListEntry.WBP_JoinServerListEntry_C
// 0x0618 (0x0888 - 0x0270)
class UWBP_JoinServerListEntry_C final : public UHDServerListing
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ServerListEntryColumn_C*           GameVersionCol;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServerListEntryColumn_C*           GMNameCol;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemBg;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ItemBox;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              ItemCheckBox;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemSelectionHighlight;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServerListEntryColumn_C*           MapNameCol;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServerListEntryColumn_C*           PingCol;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServerListEntryColumn_C*           PlayerCountCol;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ServerBadgeHBox;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServerListEntryColumn_C*           ServerNameCol;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelectionStateChanged;                           // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             PlaceholderMapBannerImg;                           // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                BadgePadding;                                      // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	struct FCheckBoxStyle                         ItemStyle;                                         // 0x02F8(0x0580)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bSelectionToggle;                                  // 0x0878(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_879[0x3];                                      // 0x0879(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemMinWidth;                                      // 0x087C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ItemMinHeight;                                     // 0x0880(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bBadgesInitialized;                                // 0x0884(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnSelectionStateChanged__DelegateSignature(class UWBP_JoinServerListEntry_C* Item, bool bSelected);
	void ExecuteUbergraph_WBP_JoinServerListEntry(int32 EntryPoint);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void OnServerItemDataSet(bool bIsDesignTime);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void On_Selection_State_Changed(bool bSelected);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BndEvt__ItemCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void PreConstruct(bool IsDesignTime);
	void SetItemSelectionState(ECheckBoxState InSelectionState);
	void SetItemIsSelected(bool bSelected);
	void GetItemSelectionState(ECheckBoxState* SelectionState);
	void IsItemSelected(bool* bSelected);
	void InternalUpdateItemBgTintColor(bool bSelected);
	void SetItemStyle(const struct FCheckBoxStyle& InItemStyle);
	void SetItemImage(class UTexture2D* InItemImg);
	void GetItemStyle(struct FCheckBoxStyle* ItemStyle_0);
	void SetItemMinDimensions(int32 InMinWidth, int32 InMinHeight);
	void GetItemMinWidth(int32* MinWidth);
	void GetItemMinHeight(int32* MinHeight);
	void InternalRefreshDimensions();
	void GetBrushWithImageTexture(struct FSlateBrush& Brush, class UTexture2D* Image, struct FSlateBrush* UpdatedBrush);
	void GetBrushWithItemDimensions(struct FSlateBrush& InBrush, struct FSlateBrush* OutBrush);
	void PopulateBadges(TArray<struct FFServerBadgeUIDefinition>& BadgeDefs);
	void SetBadgeVisibilityFromServerData();
	void HideAllBadges();
	void GetBadgeDefinitionFromTable(const struct FDataTableRowHandle& RowHandle, bool* bFound, struct FFServerBadgeUIDefinition* BadgeUIDef);
	void CreateAndAddBadgeWidgetFromDefinition(struct FFServerBadgeUIDefinition& BadgeUIDef);
	void AddBadgeDefinitionToListIfFound(class FName TableRowName, TArray<struct FFServerBadgeUIDefinition>& BadgeArr);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_JoinServerListEntry_C">();
	}
	static class UWBP_JoinServerListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_JoinServerListEntry_C>();
	}
};
static_assert(alignof(UWBP_JoinServerListEntry_C) == 0x000008, "Wrong alignment on UWBP_JoinServerListEntry_C");
static_assert(sizeof(UWBP_JoinServerListEntry_C) == 0x000888, "Wrong size on UWBP_JoinServerListEntry_C");
static_assert(offsetof(UWBP_JoinServerListEntry_C, UberGraphFrame) == 0x000270, "Member 'UWBP_JoinServerListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, GameVersionCol) == 0x000278, "Member 'UWBP_JoinServerListEntry_C::GameVersionCol' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, GMNameCol) == 0x000280, "Member 'UWBP_JoinServerListEntry_C::GMNameCol' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, ItemBg) == 0x000288, "Member 'UWBP_JoinServerListEntry_C::ItemBg' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, ItemBox) == 0x000290, "Member 'UWBP_JoinServerListEntry_C::ItemBox' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, ItemCheckBox) == 0x000298, "Member 'UWBP_JoinServerListEntry_C::ItemCheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, ItemSelectionHighlight) == 0x0002A0, "Member 'UWBP_JoinServerListEntry_C::ItemSelectionHighlight' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, MapNameCol) == 0x0002A8, "Member 'UWBP_JoinServerListEntry_C::MapNameCol' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, PingCol) == 0x0002B0, "Member 'UWBP_JoinServerListEntry_C::PingCol' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, PlayerCountCol) == 0x0002B8, "Member 'UWBP_JoinServerListEntry_C::PlayerCountCol' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, ServerBadgeHBox) == 0x0002C0, "Member 'UWBP_JoinServerListEntry_C::ServerBadgeHBox' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, ServerNameCol) == 0x0002C8, "Member 'UWBP_JoinServerListEntry_C::ServerNameCol' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, OnSelectionStateChanged) == 0x0002D0, "Member 'UWBP_JoinServerListEntry_C::OnSelectionStateChanged' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, PlaceholderMapBannerImg) == 0x0002E0, "Member 'UWBP_JoinServerListEntry_C::PlaceholderMapBannerImg' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, BadgePadding) == 0x0002E8, "Member 'UWBP_JoinServerListEntry_C::BadgePadding' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, ItemStyle) == 0x0002F8, "Member 'UWBP_JoinServerListEntry_C::ItemStyle' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, bSelectionToggle) == 0x000878, "Member 'UWBP_JoinServerListEntry_C::bSelectionToggle' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, ItemMinWidth) == 0x00087C, "Member 'UWBP_JoinServerListEntry_C::ItemMinWidth' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, ItemMinHeight) == 0x000880, "Member 'UWBP_JoinServerListEntry_C::ItemMinHeight' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServerListEntry_C, bBadgesInitialized) == 0x000884, "Member 'UWBP_JoinServerListEntry_C::bBadgesInitialized' has a wrong offset!");

}

