#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TextChat_MsgPrefix

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TextChat_MsgPrefix.WBP_TextChat_MsgPrefix_C.ExecuteUbergraph_WBP_TextChat_MsgPrefix
// 0x0018 (0x0018 - 0x0000)
struct WBP_TextChat_MsgPrefix_C_ExecuteUbergraph_WBP_TextChat_MsgPrefix final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHDTextChatMsgInfo*                     K2Node_CustomEvent_Msg;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetTextChatIconForCommChannel_ChannelChatIcon; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextChat_MsgPrefix_C_ExecuteUbergraph_WBP_TextChat_MsgPrefix) == 0x000008, "Wrong alignment on WBP_TextChat_MsgPrefix_C_ExecuteUbergraph_WBP_TextChat_MsgPrefix");
static_assert(sizeof(WBP_TextChat_MsgPrefix_C_ExecuteUbergraph_WBP_TextChat_MsgPrefix) == 0x000018, "Wrong size on WBP_TextChat_MsgPrefix_C_ExecuteUbergraph_WBP_TextChat_MsgPrefix");
static_assert(offsetof(WBP_TextChat_MsgPrefix_C_ExecuteUbergraph_WBP_TextChat_MsgPrefix, EntryPoint) == 0x000000, "Member 'WBP_TextChat_MsgPrefix_C_ExecuteUbergraph_WBP_TextChat_MsgPrefix::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TextChat_MsgPrefix_C_ExecuteUbergraph_WBP_TextChat_MsgPrefix, K2Node_CustomEvent_Msg) == 0x000008, "Member 'WBP_TextChat_MsgPrefix_C_ExecuteUbergraph_WBP_TextChat_MsgPrefix::K2Node_CustomEvent_Msg' has a wrong offset!");
static_assert(offsetof(WBP_TextChat_MsgPrefix_C_ExecuteUbergraph_WBP_TextChat_MsgPrefix, CallFunc_GetTextChatIconForCommChannel_ChannelChatIcon) == 0x000010, "Member 'WBP_TextChat_MsgPrefix_C_ExecuteUbergraph_WBP_TextChat_MsgPrefix::CallFunc_GetTextChatIconForCommChannel_ChannelChatIcon' has a wrong offset!");

// Function WBP_TextChat_MsgPrefix.WBP_TextChat_MsgPrefix_C.SetupMsgPrefix
// 0x0008 (0x0008 - 0x0000)
struct WBP_TextChat_MsgPrefix_C_SetupMsgPrefix final
{
public:
	class UHDTextChatMsgInfo*                     Msg;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextChat_MsgPrefix_C_SetupMsgPrefix) == 0x000008, "Wrong alignment on WBP_TextChat_MsgPrefix_C_SetupMsgPrefix");
static_assert(sizeof(WBP_TextChat_MsgPrefix_C_SetupMsgPrefix) == 0x000008, "Wrong size on WBP_TextChat_MsgPrefix_C_SetupMsgPrefix");
static_assert(offsetof(WBP_TextChat_MsgPrefix_C_SetupMsgPrefix, Msg) == 0x000000, "Member 'WBP_TextChat_MsgPrefix_C_SetupMsgPrefix::Msg' has a wrong offset!");

}

