#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeployMenu_ClassSelectionListing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "HDMain_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.OnClassSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_OnClassSelected__DelegateSignature final
{
public:
	class UWBP_DeployMenu_ClassSelectionListing_C* SelectedClassWidget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_OnClassSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_OnClassSelected__DelegateSignature");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_OnClassSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_OnClassSelected__DelegateSignature");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_OnClassSelected__DelegateSignature, SelectedClassWidget) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_OnClassSelected__DelegateSignature::SelectedClassWidget' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.OnClassDeselected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_OnClassDeselected__DelegateSignature final
{
public:
	class UWBP_DeployMenu_ClassSelectionListing_C* DeselectedClassWidget;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_OnClassDeselected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_OnClassDeselected__DelegateSignature");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_OnClassDeselected__DelegateSignature) == 0x000008, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_OnClassDeselected__DelegateSignature");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_OnClassDeselected__DelegateSignature, DeselectedClassWidget) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_OnClassDeselected__DelegateSignature::DeselectedClassWidget' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing
// 0x0538 (0x0538 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0008(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0028(0x0018)()
	struct FButtonStyle                           K2Node_Select_Default;                             // 0x0040(0x0278)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           K2Node_Select_Default_1;                           // 0x02C0(0x0278)()
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing) == 0x000538, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing, EntryPoint) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing, Temp_bool_Variable) == 0x000004, "Member 'WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing, CallFunc_TextToUpper_ReturnValue) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing, Temp_bool_Variable_1) == 0x000021, "Member 'WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing, CallFunc_MakeLiteralText_ReturnValue) == 0x000028, "Member 'WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing, K2Node_Select_Default) == 0x000040, "Member 'WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002B8, "Member 'WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing, K2Node_Select_Default_1) == 0x0002C0, "Member 'WBP_DeployMenu_ClassSelectionListing_C_ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_PreConstruct");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_PreConstruct) == 0x000001, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_PreConstruct");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.Init
// 0x0010 (0x0010 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_Init final
{
public:
	class UHDKit*                                 Kit_0;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HDPlayerControllerBase_C*           OwningPC;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_Init) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_Init");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_Init) == 0x000010, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_Init");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_Init, Kit_0) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_Init::Kit_0' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_Init, OwningPC) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_Init::OwningPC' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.InternalKitDisplaySetup
// 0x0020 (0x0020 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_InternalKitDisplaySetup final
{
public:
	bool                                          CallFunc_InternalIsKitRestricted_bKitRestricted;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_InternalIsKitRestricted_KitRestrictionReason; // 0x0008(0x0018)()
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_InternalKitDisplaySetup) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_InternalKitDisplaySetup");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_InternalKitDisplaySetup) == 0x000020, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_InternalKitDisplaySetup");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalKitDisplaySetup, CallFunc_InternalIsKitRestricted_bKitRestricted) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalKitDisplaySetup::CallFunc_InternalIsKitRestricted_bKitRestricted' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalKitDisplaySetup, CallFunc_InternalIsKitRestricted_KitRestrictionReason) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalKitDisplaySetup::CallFunc_InternalIsKitRestricted_KitRestrictionReason' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.UpdateRestrictedState
// 0x0028 (0x0028 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_UpdateRestrictedState final
{
public:
	bool                                          CallFunc_InternalIsKitRestricted_bKitRestricted;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_InternalIsKitRestricted_KitRestrictionReason; // 0x0008(0x0018)()
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_UpdateRestrictedState) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_UpdateRestrictedState");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_UpdateRestrictedState) == 0x000028, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_UpdateRestrictedState");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_UpdateRestrictedState, CallFunc_InternalIsKitRestricted_bKitRestricted) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_UpdateRestrictedState::CallFunc_InternalIsKitRestricted_bKitRestricted' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_UpdateRestrictedState, CallFunc_InternalIsKitRestricted_KitRestrictionReason) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_UpdateRestrictedState::CallFunc_InternalIsKitRestricted_KitRestrictionReason' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_UpdateRestrictedState, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000020, "Member 'WBP_DeployMenu_ClassSelectionListing_C_UpdateRestrictedState::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.InternalSetupPrimaryWeaponIcon
// 0x0010 (0x0010 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_InternalSetupPrimaryWeaponIcon final
{
public:
	class UTexture2D*                             CallFunc_GetPrimaryItemEntryDisplayIcon_OutDisplayIcon; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPrimaryItemEntryDisplayIcon_ReturnValue; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupPrimaryWeaponIcon) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_InternalSetupPrimaryWeaponIcon");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupPrimaryWeaponIcon) == 0x000010, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_InternalSetupPrimaryWeaponIcon");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupPrimaryWeaponIcon, CallFunc_GetPrimaryItemEntryDisplayIcon_OutDisplayIcon) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupPrimaryWeaponIcon::CallFunc_GetPrimaryItemEntryDisplayIcon_OutDisplayIcon' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupPrimaryWeaponIcon, CallFunc_GetPrimaryItemEntryDisplayIcon_ReturnValue) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupPrimaryWeaponIcon::CallFunc_GetPrimaryItemEntryDisplayIcon_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.InternalSetClassSelectionState
// 0x0280 (0x0280 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState final
{
public:
	bool                                          bNewSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           K2Node_Select_Default;                             // 0x0008(0x0278)()
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState) == 0x000280, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState, bNewSelected) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState::bNewSelected' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState, Temp_bool_Variable) == 0x000003, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState, K2Node_Select_Default) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassSelectionState::K2Node_Select_Default' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.ToggleClassSelection
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_ToggleClassSelection final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_ToggleClassSelection) == 0x000001, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_ToggleClassSelection");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_ToggleClassSelection) == 0x000001, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_ToggleClassSelection");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_ToggleClassSelection, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_ToggleClassSelection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_SetSelected final
{
public:
	bool                                          bSelected_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_SetSelected) == 0x000001, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_SetSelected");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_SetSelected) == 0x000001, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_SetSelected");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SetSelected, bSelected_0) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SetSelected::bSelected_0' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.InternalSetupKitDisplaySymbol
// 0x0030 (0x0030 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0008(0x0028)()
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol) == 0x000030, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol, Temp_bool_Variable) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol, K2Node_Select_Default) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplaySymbol::K2Node_Select_Default' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.InternalSetupKitDisplayName
// 0x0038 (0x0038 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0008(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0020(0x0018)()
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName) == 0x000038, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName, Temp_bool_Variable) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName, CallFunc_TextIsEmpty_ReturnValue) == 0x000002, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName, K2Node_Select_Default) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName, CallFunc_TextToUpper_ReturnValue) == 0x000020, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayName::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.InternalSetupKitRestrictionDisplay
// 0x0028 (0x0028 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay final
{
public:
	bool                                          bKitRestricted;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   KitRestrictionReason;                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay) == 0x000028, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay, bKitRestricted) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay::bKitRestricted' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay, KitRestrictionReason) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay::KitRestrictionReason' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay, Temp_bool_Variable) == 0x000020, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay, Temp_byte_Variable) == 0x000021, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay, Temp_byte_Variable_1) == 0x000022, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay, K2Node_Select_Default) == 0x000023, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitRestrictionDisplay::K2Node_Select_Default' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.InternalUpdateClassRestrictedText
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText final
{
public:
	bool                                          bKitRestricted;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   KitRestrictionReason;                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasKitRequirements_ReturnValue;           // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0060(0x0018)()
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x0078(0x0028)()
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText) == 0x0000A0, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText, bKitRestricted) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText::bKitRestricted' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText, KitRestrictionReason) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText::KitRestrictionReason' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText, Temp_bool_Variable) == 0x000020, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText, Temp_text_Variable) == 0x000028, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText, Temp_bool_Variable_1) == 0x000040, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText, Temp_bool_Variable_2) == 0x000041, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText, CallFunc_HasKitRequirements_ReturnValue) == 0x000042, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText::CallFunc_HasKitRequirements_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText, K2Node_Select_Default) == 0x000048, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText, K2Node_Select_Default_1) == 0x000060, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText, K2Node_Select_Default_2) == 0x000078, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalUpdateClassRestrictedText::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.InternalSetClassRestrictedState
// 0x0028 (0x0028 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassRestrictedState final
{
public:
	bool                                          bNewRestricted;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NewRestrictionReason;                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassRestrictedState) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassRestrictedState");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassRestrictedState) == 0x000028, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassRestrictedState");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassRestrictedState, bNewRestricted) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassRestrictedState::bNewRestricted' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassRestrictedState, NewRestrictionReason) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassRestrictedState::NewRestrictionReason' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassRestrictedState, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetClassRestrictedState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.InternalSetupKitDisplayEqpSlots
// 0x0030 (0x0030 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHDItemEntry                           CallFunc_Array_Get_Item;                           // 0x0008(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots) == 0x000030, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots, CallFunc_Array_Add_ReturnValue) == 0x00001C, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetupKitDisplayEqpSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.InternalSetEqpDisplaySymbolBySlotNum
// 0x0040 (0x0040 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum final
{
public:
	int32                                         SlotNum;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             SlotSymbolToUse;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDesignTime;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_InternalGetEqpSlotImageWidgetByNum_EqpSlotImage; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum) == 0x000040, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum, SlotNum) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum::SlotNum' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum, SlotSymbolToUse) == 0x000008, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum::SlotSymbolToUse' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum, bDesignTime) == 0x000010, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum::bDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum, CallFunc_InternalGetEqpSlotImageWidgetByNum_EqpSlotImage) == 0x000018, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum::CallFunc_InternalGetEqpSlotImageWidgetByNum_EqpSlotImage' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum, CallFunc_GetParent_ReturnValue) == 0x000020, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum, Temp_bool_Variable) == 0x000028, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum, K2Node_Select_Default) == 0x00002C, "Member 'WBP_DeployMenu_ClassSelectionListing_C_InternalSetEqpDisplaySymbolBySlotNum::K2Node_Select_Default' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.SortItemEntriesInPlaceBySlotNum
// 0x0058 (0x0058 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum final
{
public:
	TArray<struct FHDItemEntry>                   EntriesToSort;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          bSwapped;                                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHDItemEntry>                   SortedEntries;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum");
static_assert(sizeof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum) == 0x000058, "Wrong size on WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, EntriesToSort) == 0x000000, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::EntriesToSort' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, bSwapped) == 0x000010, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::bSwapped' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, SortedEntries) == 0x000018, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::SortedEntries' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, Temp_int_Variable) == 0x000028, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000034, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000038, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, Temp_int_Variable_1) == 0x000048, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, CallFunc_Add_IntInt_ReturnValue_2) == 0x00004C, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, Temp_bool_Variable) == 0x000051, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum, CallFunc_BooleanAND_ReturnValue) == 0x000053, "Member 'WBP_DeployMenu_ClassSelectionListing_C_SortItemEntriesInPlaceBySlotNum::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C.InternalFillEqpSlots
// 0x0058 (0x0058 - 0x0000)
struct WBP_DeployMenu_ClassSelectionListing_C_InternalFillEqpSlots final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_InternalGetEqpSlotImageWidgetByNum_EqpSlotImage; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreColorsNearlyEqual_bEqual;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHDItemEntry                           CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetItemEntryDisplayEquipmentSymbol_OutDisplayEquipmentSymbol; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemEntryDisplayEquipmentSymbol_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_ClassSelectionListing_C_InternalFillEqpSlots) == 0x000008, "Wrong alignment on WBP_DeployMenu_ClassSelectionListing_C_InternalFillEqpSlots");
