#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModifierSettingBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FModifierTextStyle_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModifierSettingBox.WBP_ModifierSettingBox_C
// 0x00A8 (0x02D8 - 0x0230)
class UWBP_ModifierSettingBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             Content;                                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SettingLabel;                                      // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SettingText;                                       // 0x0248(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FFModifierTextStyle                    SettingTextStyle;                                  // 0x0260(0x0078)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ModifierSettingBox(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetSettingText(const class FText& InSettingText);
	void GetSettingText(class FText* SettingText_0);
	void SetSettingTextStyle(struct FFModifierTextStyle& InSettingTextStyle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModifierSettingBox_C">();
	}
	static class UWBP_ModifierSettingBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModifierSettingBox_C>();
	}
};
static_assert(alignof(UWBP_ModifierSettingBox_C) == 0x000008, "Wrong alignment on UWBP_ModifierSettingBox_C");
static_assert(sizeof(UWBP_ModifierSettingBox_C) == 0x0002D8, "Wrong size on UWBP_ModifierSettingBox_C");
static_assert(offsetof(UWBP_ModifierSettingBox_C, UberGraphFrame) == 0x000230, "Member 'UWBP_ModifierSettingBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSettingBox_C, Content) == 0x000238, "Member 'UWBP_ModifierSettingBox_C::Content' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSettingBox_C, SettingLabel) == 0x000240, "Member 'UWBP_ModifierSettingBox_C::SettingLabel' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSettingBox_C, SettingText) == 0x000248, "Member 'UWBP_ModifierSettingBox_C::SettingText' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSettingBox_C, SettingTextStyle) == 0x000260, "Member 'UWBP_ModifierSettingBox_C::SettingTextStyle' has a wrong offset!");

}

