#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HDRadialMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SHDRadialMenu_OptionData_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.ExecuteUbergraph_WBP_HDRadialMenu
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HDPlayerCharacterBase_C*            K2Node_DynamicCast_AsBP_HDPlayer_Character_Base;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA0[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetCategories_Categories;                 // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_NewSelection;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OldSelection;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA1[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA2[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetItemNamesForSelectedOption_OutRowNames; // 0x0050(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHDRadialMenu_OptionData              CallFunc_GetCategoryData_CategoryData;             // 0x0068(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA3[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0094(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHDRadialMenu_OptionData              K2Node_MakeStruct_SHDRadialMenu_OptionData;        // 0x00D0(0x0028)(HasGetValueTypeHash)
	struct FSHDRadialMenu_OptionData              K2Node_MakeStruct_SHDRadialMenu_OptionData_1;      // 0x00F8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA4[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSHDRadialMenu_OptionData              CallFunc_GetItemData_ItemData;                     // 0x0128(0x0028)(HasGetValueTypeHash)
	TDelegate<void(class APawn* VictimPawn, class AController* VictimController, float KillingDamage, struct FDamageEvent& DamageEvent, class APawn* InstigatingPawn, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate;              // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class APawn* VictimPawn, class AController* VictimController, float KillingDamage, struct FDamageEvent& DamageEvent, class APawn* InstigatingPawn, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA5[0x3];                                     // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1EA6[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_1;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HDPlayerCharacterBase_C*            K2Node_DynamicCast_AsBP_HDPlayer_Character_Base_1; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu) == 0x000008, "Wrong alignment on WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu");
static_assert(sizeof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu) == 0x0001B0, "Wrong size on WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, EntryPoint) == 0x000000, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000008, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_DynamicCast_AsBP_HDPlayer_Character_Base) == 0x000010, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_DynamicCast_AsBP_HDPlayer_Character_Base' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_GetCategories_Categories) == 0x000020, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_GetCategories_Categories' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_ComponentBoundEvent_NewSelection) == 0x000030, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_ComponentBoundEvent_NewSelection' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_ComponentBoundEvent_OldSelection) == 0x000034, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_ComponentBoundEvent_OldSelection' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000040, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_NotEqual_NameName_ReturnValue) == 0x000048, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000049, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_GetItemNamesForSelectedOption_OutRowNames) == 0x000050, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_GetItemNamesForSelectedOption_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_GetCategoryData_CategoryData) == 0x000068, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_GetCategoryData_CategoryData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000090, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_Event_MyGeometry) == 0x000094, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_Event_InDeltaTime) == 0x0000CC, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_MakeStruct_SHDRadialMenu_OptionData) == 0x0000D0, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_MakeStruct_SHDRadialMenu_OptionData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_MakeStruct_SHDRadialMenu_OptionData_1) == 0x0000F8, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_MakeStruct_SHDRadialMenu_OptionData_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000120, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_GetItemData_ItemData) == 0x000128, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_GetItemData_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000150, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000160, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000170, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000180, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000184, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, CallFunc_GetOwningPlayerPawn_ReturnValue_1) == 0x000198, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::CallFunc_GetOwningPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_DynamicCast_AsBP_HDPlayer_Character_Base_1) == 0x0001A0, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_DynamicCast_AsBP_HDPlayer_Character_Base_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'WBP_HDRadialMenu_C_ExecuteUbergraph_WBP_HDRadialMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_HDRadialMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HDRadialMenu_C_Tick) == 0x000004, "Wrong alignment on WBP_HDRadialMenu_C_Tick");
static_assert(sizeof(WBP_HDRadialMenu_C_Tick) == 0x00003C, "Wrong size on WBP_HDRadialMenu_C_Tick");
static_assert(offsetof(WBP_HDRadialMenu_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_HDRadialMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_HDRadialMenu_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.BndEvt__categoryRing_K2Node_ComponentBoundEvent_1_SelectionChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HDRadialMenu_C_BndEvt__categoryRing_K2Node_ComponentBoundEvent_1_SelectionChanged__DelegateSignature final
{
public:
	int32                                         NewSelection;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldSelection;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HDRadialMenu_C_BndEvt__categoryRing_K2Node_ComponentBoundEvent_1_SelectionChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_HDRadialMenu_C_BndEvt__categoryRing_K2Node_ComponentBoundEvent_1_SelectionChanged__DelegateSignature");
static_assert(sizeof(WBP_HDRadialMenu_C_BndEvt__categoryRing_K2Node_ComponentBoundEvent_1_SelectionChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_HDRadialMenu_C_BndEvt__categoryRing_K2Node_ComponentBoundEvent_1_SelectionChanged__DelegateSignature");
static_assert(offsetof(WBP_HDRadialMenu_C_BndEvt__categoryRing_K2Node_ComponentBoundEvent_1_SelectionChanged__DelegateSignature, NewSelection) == 0x000000, "Member 'WBP_HDRadialMenu_C_BndEvt__categoryRing_K2Node_ComponentBoundEvent_1_SelectionChanged__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_BndEvt__categoryRing_K2Node_ComponentBoundEvent_1_SelectionChanged__DelegateSignature, OldSelection) == 0x000004, "Member 'WBP_HDRadialMenu_C_BndEvt__categoryRing_K2Node_ComponentBoundEvent_1_SelectionChanged__DelegateSignature::OldSelection' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.GetCategoryName
// 0x0090 (0x0090 - 0x0000)
struct WBP_HDRadialMenu_C_GetCategoryName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class ABP_HDPlayerCharacterBase_C*            OwnerPawn;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetOutpostName_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0038(0x0018)()
	class FText                                   CallFunc_GetRallypointName_ReturnValue;            // 0x0050(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA7[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0070(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HDRadialMenu_C_GetCategoryName) == 0x000008, "Wrong alignment on WBP_HDRadialMenu_C_GetCategoryName");
static_assert(sizeof(WBP_HDRadialMenu_C_GetCategoryName) == 0x000090, "Wrong size on WBP_HDRadialMenu_C_GetCategoryName");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryName, ReturnValue) == 0x000000, "Member 'WBP_HDRadialMenu_C_GetCategoryName::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryName, OwnerPawn) == 0x000018, "Member 'WBP_HDRadialMenu_C_GetCategoryName::OwnerPawn' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryName, CallFunc_GetOutpostName_ReturnValue) == 0x000020, "Member 'WBP_HDRadialMenu_C_GetCategoryName::CallFunc_GetOutpostName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryName, CallFunc_MakeLiteralText_ReturnValue) == 0x000038, "Member 'WBP_HDRadialMenu_C_GetCategoryName::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryName, CallFunc_GetRallypointName_ReturnValue) == 0x000050, "Member 'WBP_HDRadialMenu_C_GetCategoryName::CallFunc_GetRallypointName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryName, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000068, "Member 'WBP_HDRadialMenu_C_GetCategoryName::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryName, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000070, "Member 'WBP_HDRadialMenu_C_GetCategoryName::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryName, CallFunc_EqualEqual_TextText_ReturnValue_1) == 0x000088, "Member 'WBP_HDRadialMenu_C_GetCategoryName::CallFunc_EqualEqual_TextText_ReturnValue_1' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.GetCategories
// 0x0020 (0x0020 - 0x0000)
struct WBP_HDRadialMenu_C_GetCategories final
{
public:
	TArray<class FName>                           Categories;                                        // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HDRadialMenu_C_GetCategories) == 0x000008, "Wrong alignment on WBP_HDRadialMenu_C_GetCategories");
static_assert(sizeof(WBP_HDRadialMenu_C_GetCategories) == 0x000020, "Wrong size on WBP_HDRadialMenu_C_GetCategories");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategories, Categories) == 0x000000, "Member 'WBP_HDRadialMenu_C_GetCategories::Categories' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategories, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000010, "Member 'WBP_HDRadialMenu_C_GetCategories::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.GetCategoryData
// 0x0088 (0x0088 - 0x0000)
struct WBP_HDRadialMenu_C_GetCategoryData final
{
public:
	class FName                                   Category;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHDRadialMenu_OptionData              Param_CategoryData;                                // 0x0008(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	struct FSHDRadialMenu_OptionData              K2Node_MakeStruct_SHDRadialMenu_OptionData;        // 0x0030(0x0028)(HasGetValueTypeHash)
	struct FSHDRadialMenu_OptionData              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HDRadialMenu_C_GetCategoryData) == 0x000008, "Wrong alignment on WBP_HDRadialMenu_C_GetCategoryData");
static_assert(sizeof(WBP_HDRadialMenu_C_GetCategoryData) == 0x000088, "Wrong size on WBP_HDRadialMenu_C_GetCategoryData");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryData, Category) == 0x000000, "Member 'WBP_HDRadialMenu_C_GetCategoryData::Category' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryData, Param_CategoryData) == 0x000008, "Member 'WBP_HDRadialMenu_C_GetCategoryData::Param_CategoryData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryData, K2Node_MakeStruct_SHDRadialMenu_OptionData) == 0x000030, "Member 'WBP_HDRadialMenu_C_GetCategoryData::K2Node_MakeStruct_SHDRadialMenu_OptionData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'WBP_HDRadialMenu_C_GetCategoryData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetCategoryData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000080, "Member 'WBP_HDRadialMenu_C_GetCategoryData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.GetItemNamesForSelectedOption
// 0x0048 (0x0048 - 0x0000)
struct WBP_HDRadialMenu_C_GetItemNamesForSelectedOption final
{
public:
	TArray<class FName>                           OutRowNames;                                       // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	struct FSHDRadialMenu_OptionData              CallFunc_GetCategoryData_CategoryData;             // 0x0010(0x0028)(HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0038(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HDRadialMenu_C_GetItemNamesForSelectedOption) == 0x000008, "Wrong alignment on WBP_HDRadialMenu_C_GetItemNamesForSelectedOption");
static_assert(sizeof(WBP_HDRadialMenu_C_GetItemNamesForSelectedOption) == 0x000048, "Wrong size on WBP_HDRadialMenu_C_GetItemNamesForSelectedOption");
static_assert(offsetof(WBP_HDRadialMenu_C_GetItemNamesForSelectedOption, OutRowNames) == 0x000000, "Member 'WBP_HDRadialMenu_C_GetItemNamesForSelectedOption::OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetItemNamesForSelectedOption, CallFunc_GetCategoryData_CategoryData) == 0x000010, "Member 'WBP_HDRadialMenu_C_GetItemNamesForSelectedOption::CallFunc_GetCategoryData_CategoryData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetItemNamesForSelectedOption, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000038, "Member 'WBP_HDRadialMenu_C_GetItemNamesForSelectedOption::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.GetItemData
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_HDRadialMenu_C_GetItemData final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHDRadialMenu_OptionData              ItemData;                                          // 0x0008(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	struct FSHDRadialMenu_OptionData              K2Node_MakeStruct_SHDRadialMenu_OptionData;        // 0x0030(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA8[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSHDRadialMenu_OptionData              K2Node_MakeStruct_SHDRadialMenu_OptionData_1;      // 0x0060(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA9[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSHDRadialMenu_OptionData              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0090(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HDRadialMenu_C_GetItemData) == 0x000008, "Wrong alignment on WBP_HDRadialMenu_C_GetItemData");
static_assert(sizeof(WBP_HDRadialMenu_C_GetItemData) == 0x0000C0, "Wrong size on WBP_HDRadialMenu_C_GetItemData");
static_assert(offsetof(WBP_HDRadialMenu_C_GetItemData, RowName) == 0x000000, "Member 'WBP_HDRadialMenu_C_GetItemData::RowName' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetItemData, ItemData) == 0x000008, "Member 'WBP_HDRadialMenu_C_GetItemData::ItemData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetItemData, K2Node_MakeStruct_SHDRadialMenu_OptionData) == 0x000030, "Member 'WBP_HDRadialMenu_C_GetItemData::K2Node_MakeStruct_SHDRadialMenu_OptionData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetItemData, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000058, "Member 'WBP_HDRadialMenu_C_GetItemData::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetItemData, K2Node_MakeStruct_SHDRadialMenu_OptionData_1) == 0x000060, "Member 'WBP_HDRadialMenu_C_GetItemData::K2Node_MakeStruct_SHDRadialMenu_OptionData_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetItemData, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'WBP_HDRadialMenu_C_GetItemData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetItemData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000090, "Member 'WBP_HDRadialMenu_C_GetItemData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_GetItemData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B8, "Member 'WBP_HDRadialMenu_C_GetItemData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.PopulateMenuOptions
// 0x0090 (0x0090 - 0x0000)
struct WBP_HDRadialMenu_C_PopulateMenuOptions final
{
public:
	class UDataTable*                             MenuOptions;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHDRadialMenu_OptionData              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EAA[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RadialMenuIconBase_C*              CallFunc_MakeOutpostIcon_Widget;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddChildToRadialMenu_Success;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EAB[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSHDRadialMenu_OptionData              CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0048(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EAC[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RadialMenuIconBase_C*              CallFunc_MakeRallypointIcon_Widget;                // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddChildToRadialMenu_Success_1;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddChildToRadialMenu_Success_2;           // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EAD[0x1];                                     // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HDRadialMenu_C_PopulateMenuOptions) == 0x000008, "Wrong alignment on WBP_HDRadialMenu_C_PopulateMenuOptions");
static_assert(sizeof(WBP_HDRadialMenu_C_PopulateMenuOptions) == 0x000090, "Wrong size on WBP_HDRadialMenu_C_PopulateMenuOptions");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, MenuOptions) == 0x000000, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::MenuOptions' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000030, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, CallFunc_MakeOutpostIcon_Widget) == 0x000038, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::CallFunc_MakeOutpostIcon_Widget' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, CallFunc_AddChildToRadialMenu_Success) == 0x000040, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::CallFunc_AddChildToRadialMenu_Success' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000048, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000070, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, CallFunc_MakeRallypointIcon_Widget) == 0x000078, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::CallFunc_MakeRallypointIcon_Widget' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, CallFunc_AddChildToRadialMenu_Success_1) == 0x000080, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::CallFunc_AddChildToRadialMenu_Success_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, CallFunc_AddChildToRadialMenu_Success_2) == 0x000081, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::CallFunc_AddChildToRadialMenu_Success_2' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, CallFunc_Greater_IntInt_ReturnValue) == 0x000082, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, Temp_int_Variable) == 0x000084, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateMenuOptions, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_HDRadialMenu_C_PopulateMenuOptions::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.PopulateSubmenuOptions
// 0x0080 (0x0080 - 0x0000)
struct WBP_HDRadialMenu_C_PopulateSubmenuOptions final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EAE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetItemNamesForSelectedOption_OutRowNames; // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UWBP_RadialMenuIconBase_C*              CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHDRadialMenu_OptionData              CallFunc_GetItemData_ItemData;                     // 0x0030(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RadialMenuIconBase_C*              CallFunc_Create_ReturnValue_1;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddChildToRadialMenu_Success;             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EAF[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddChildToRadialMenu_Success_1;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HDRadialMenu_C_PopulateSubmenuOptions) == 0x000008, "Wrong alignment on WBP_HDRadialMenu_C_PopulateSubmenuOptions");
static_assert(sizeof(WBP_HDRadialMenu_C_PopulateSubmenuOptions) == 0x000080, "Wrong size on WBP_HDRadialMenu_C_PopulateSubmenuOptions");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, CallFunc_GetItemNamesForSelectedOption_OutRowNames) == 0x000010, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::CallFunc_GetItemNamesForSelectedOption_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, CallFunc_GetItemData_ItemData) == 0x000030, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::CallFunc_GetItemData_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000060, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, CallFunc_Create_ReturnValue_1) == 0x000068, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, CallFunc_AddChildToRadialMenu_Success) == 0x000071, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::CallFunc_AddChildToRadialMenu_Success' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_PopulateSubmenuOptions, CallFunc_AddChildToRadialMenu_Success_1) == 0x000078, "Member 'WBP_HDRadialMenu_C_PopulateSubmenuOptions::CallFunc_AddChildToRadialMenu_Success_1' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.SelectSubmenu
// 0x0030 (0x0030 - 0x0000)
struct WBP_HDRadialMenu_C_SelectSubmenu final
{
public:
	struct FSHDRadialMenu_OptionData              CallFunc_GetCategoryData_CategoryData;             // 0x0000(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HDRadialMenu_C_SelectSubmenu) == 0x000008, "Wrong alignment on WBP_HDRadialMenu_C_SelectSubmenu");
static_assert(sizeof(WBP_HDRadialMenu_C_SelectSubmenu) == 0x000030, "Wrong size on WBP_HDRadialMenu_C_SelectSubmenu");
static_assert(offsetof(WBP_HDRadialMenu_C_SelectSubmenu, CallFunc_GetCategoryData_CategoryData) == 0x000000, "Member 'WBP_HDRadialMenu_C_SelectSubmenu::CallFunc_GetCategoryData_CategoryData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_SelectSubmenu, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_HDRadialMenu_C_SelectSubmenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.MakeSpottingIcon
// 0x0078 (0x0078 - 0x0000)
struct WBP_HDRadialMenu_C_MakeSpottingIcon final
{
public:
	struct FSHDRadialMenu_OptionData              OptionData;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UWBP_RadialMenuIconBase_C*              Widget;                                            // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HDPlayerCharacterBase_C*            OwnerPawn;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HDPlayerCharacterBase_C*            K2Node_DynamicCast_AsBP_HDPlayer_Character_Base;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB0[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RadialMenuIconBase_C*              CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RadialMenuIconBase_C*              CallFunc_Create_ReturnValue_1;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RadialMenuCanSelectSpot_bSelectable;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HDRadialMenu_C_MakeSpottingIcon) == 0x000008, "Wrong alignment on WBP_HDRadialMenu_C_MakeSpottingIcon");
static_assert(sizeof(WBP_HDRadialMenu_C_MakeSpottingIcon) == 0x000078, "Wrong size on WBP_HDRadialMenu_C_MakeSpottingIcon");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeSpottingIcon, OptionData) == 0x000000, "Member 'WBP_HDRadialMenu_C_MakeSpottingIcon::OptionData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeSpottingIcon, Widget) == 0x000028, "Member 'WBP_HDRadialMenu_C_MakeSpottingIcon::Widget' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeSpottingIcon, OwnerPawn) == 0x000030, "Member 'WBP_HDRadialMenu_C_MakeSpottingIcon::OwnerPawn' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeSpottingIcon, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000038, "Member 'WBP_HDRadialMenu_C_MakeSpottingIcon::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeSpottingIcon, K2Node_DynamicCast_AsBP_HDPlayer_Character_Base) == 0x000040, "Member 'WBP_HDRadialMenu_C_MakeSpottingIcon::K2Node_DynamicCast_AsBP_HDPlayer_Character_Base' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeSpottingIcon, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_HDRadialMenu_C_MakeSpottingIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeSpottingIcon, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'WBP_HDRadialMenu_C_MakeSpottingIcon::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeSpottingIcon, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WBP_HDRadialMenu_C_MakeSpottingIcon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeSpottingIcon, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000060, "Member 'WBP_HDRadialMenu_C_MakeSpottingIcon::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeSpottingIcon, CallFunc_Create_ReturnValue_1) == 0x000068, "Member 'WBP_HDRadialMenu_C_MakeSpottingIcon::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeSpottingIcon, CallFunc_RadialMenuCanSelectSpot_bSelectable) == 0x000070, "Member 'WBP_HDRadialMenu_C_MakeSpottingIcon::CallFunc_RadialMenuCanSelectSpot_bSelectable' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.MakeRallypointIcon
// 0x0078 (0x0078 - 0x0000)
struct WBP_HDRadialMenu_C_MakeRallypointIcon final
{
public:
	struct FSHDRadialMenu_OptionData              OptionData;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UWBP_RadialMenuIconBase_C*              Widget;                                            // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HDPlayerCharacterBase_C*            OwnerPawn;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HDPlayerCharacterBase_C*            K2Node_DynamicCast_AsBP_HDPlayer_Character_Base;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB1[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RadialMenuIconBase_C*              CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RadialMenuIconBase_C*              CallFunc_Create_ReturnValue_1;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RadialMenuCanSelectRallypoint_bSelectable; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HDRadialMenu_C_MakeRallypointIcon) == 0x000008, "Wrong alignment on WBP_HDRadialMenu_C_MakeRallypointIcon");
static_assert(sizeof(WBP_HDRadialMenu_C_MakeRallypointIcon) == 0x000078, "Wrong size on WBP_HDRadialMenu_C_MakeRallypointIcon");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeRallypointIcon, OptionData) == 0x000000, "Member 'WBP_HDRadialMenu_C_MakeRallypointIcon::OptionData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeRallypointIcon, Widget) == 0x000028, "Member 'WBP_HDRadialMenu_C_MakeRallypointIcon::Widget' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeRallypointIcon, OwnerPawn) == 0x000030, "Member 'WBP_HDRadialMenu_C_MakeRallypointIcon::OwnerPawn' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeRallypointIcon, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000038, "Member 'WBP_HDRadialMenu_C_MakeRallypointIcon::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeRallypointIcon, K2Node_DynamicCast_AsBP_HDPlayer_Character_Base) == 0x000040, "Member 'WBP_HDRadialMenu_C_MakeRallypointIcon::K2Node_DynamicCast_AsBP_HDPlayer_Character_Base' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeRallypointIcon, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_HDRadialMenu_C_MakeRallypointIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeRallypointIcon, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'WBP_HDRadialMenu_C_MakeRallypointIcon::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeRallypointIcon, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WBP_HDRadialMenu_C_MakeRallypointIcon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeRallypointIcon, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000060, "Member 'WBP_HDRadialMenu_C_MakeRallypointIcon::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeRallypointIcon, CallFunc_Create_ReturnValue_1) == 0x000068, "Member 'WBP_HDRadialMenu_C_MakeRallypointIcon::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeRallypointIcon, CallFunc_RadialMenuCanSelectRallypoint_bSelectable) == 0x000070, "Member 'WBP_HDRadialMenu_C_MakeRallypointIcon::CallFunc_RadialMenuCanSelectRallypoint_bSelectable' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.MakeOutpostIcon
// 0x0078 (0x0078 - 0x0000)
struct WBP_HDRadialMenu_C_MakeOutpostIcon final
{
public:
	struct FSHDRadialMenu_OptionData              OptionData;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UWBP_RadialMenuIconBase_C*              Widget;                                            // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HDPlayerCharacterBase_C*            OwnerPawn;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HDPlayerCharacterBase_C*            K2Node_DynamicCast_AsBP_HDPlayer_Character_Base;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB2[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RadialMenuIconBase_C*              CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RadialMenuIconBase_C*              CallFunc_Create_ReturnValue_1;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RadialMenuCanSelectOutpost_bSelectable;   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HDRadialMenu_C_MakeOutpostIcon) == 0x000008, "Wrong alignment on WBP_HDRadialMenu_C_MakeOutpostIcon");
static_assert(sizeof(WBP_HDRadialMenu_C_MakeOutpostIcon) == 0x000078, "Wrong size on WBP_HDRadialMenu_C_MakeOutpostIcon");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeOutpostIcon, OptionData) == 0x000000, "Member 'WBP_HDRadialMenu_C_MakeOutpostIcon::OptionData' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeOutpostIcon, Widget) == 0x000028, "Member 'WBP_HDRadialMenu_C_MakeOutpostIcon::Widget' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeOutpostIcon, OwnerPawn) == 0x000030, "Member 'WBP_HDRadialMenu_C_MakeOutpostIcon::OwnerPawn' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeOutpostIcon, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000038, "Member 'WBP_HDRadialMenu_C_MakeOutpostIcon::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeOutpostIcon, K2Node_DynamicCast_AsBP_HDPlayer_Character_Base) == 0x000040, "Member 'WBP_HDRadialMenu_C_MakeOutpostIcon::K2Node_DynamicCast_AsBP_HDPlayer_Character_Base' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeOutpostIcon, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_HDRadialMenu_C_MakeOutpostIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeOutpostIcon, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'WBP_HDRadialMenu_C_MakeOutpostIcon::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeOutpostIcon, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WBP_HDRadialMenu_C_MakeOutpostIcon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeOutpostIcon, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000060, "Member 'WBP_HDRadialMenu_C_MakeOutpostIcon::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeOutpostIcon, CallFunc_Create_ReturnValue_1) == 0x000068, "Member 'WBP_HDRadialMenu_C_MakeOutpostIcon::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenu_C_MakeOutpostIcon, CallFunc_RadialMenuCanSelectOutpost_bSelectable) == 0x000070, "Member 'WBP_HDRadialMenu_C_MakeOutpostIcon::CallFunc_RadialMenuCanSelectOutpost_bSelectable' has a wrong offset!");

// Function WBP_HDRadialMenu.WBP_HDRadialMenu_C.OwnerPawnDeath
// 0x0038 (0x0038 - 0x0000)
struct WBP_HDRadialMenu_C_OwnerPawnDeath final
{
public:
	class APawn*                                  VictimPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            VictimController;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KillingDamage;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EB3[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEvent                           DamageEvent;                                       // 0x0018(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
