#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModifierSetting_Numeric

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FNumericModifierValueBound_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C
// 0x0130 (0x0360 - 0x0230)
class UWBP_ModifierSetting_Numeric_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ModifierSettingBox_C*              ModifierSetting;                                   // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NumericHintText;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpinBox*                               NumericSpinBox;                                    // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SettingText;                                       // 0x0250(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMap<float, class FText>                      MagicValues;                                       // 0x0268(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   MagicValueText;                                    // 0x02B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ValueSnapDelta;                                    // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         ValueInitial;                                      // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FFNumericModifierValueBound            ValueMinInitial;                                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FFNumericModifierValueBound            ValueMaxInitial;                                   // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateColor                            VisibleSpinBoxForegroundColor;                     // 0x02E8(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         MinFractionalDigitsInitial;                        // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         MaxFractionalDigitsInitial;                        // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateColor                            HiddenSpinBoxForegroundColor;                      // 0x0318(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             OnValueChanged;                                    // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnValueCommitted;                                  // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnValueChanged__DelegateSignature(float InValue);
	void OnValueCommitted__DelegateSignature(float InValue, ETextCommit CommitMethod);
	void ExecuteUbergraph_WBP_ModifierSetting_Numeric(int32 EntryPoint);
	void BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_1_OnSpinBoxValueCommittedEvent__DelegateSignature(float InValue, ETextCommit CommitMethod);
	void BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void PreConstruct(bool IsDesignTime);
	void SetSettingText(const class FText& InSettingText);
	void GetSettingText(class FText* SettingText_0);
	void SetMagicValueText(const class FText& InMagicValueText);
	void GetMagicValueText(class FText* MagicValueText_0);
	void SetValue(float InValue);
	void GetValue(float* Value);
	void SetValueSnapDelta(float InDelta);
	void GetValueSnapDelta(float* Delta);
	void UpdateMagicValueState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModifierSetting_Numeric_C">();
	}
	static class UWBP_ModifierSetting_Numeric_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModifierSetting_Numeric_C>();
	}
};
static_assert(alignof(UWBP_ModifierSetting_Numeric_C) == 0x000008, "Wrong alignment on UWBP_ModifierSetting_Numeric_C");
static_assert(sizeof(UWBP_ModifierSetting_Numeric_C) == 0x000360, "Wrong size on UWBP_ModifierSetting_Numeric_C");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, UberGraphFrame) == 0x000230, "Member 'UWBP_ModifierSetting_Numeric_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, ModifierSetting) == 0x000238, "Member 'UWBP_ModifierSetting_Numeric_C::ModifierSetting' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, NumericHintText) == 0x000240, "Member 'UWBP_ModifierSetting_Numeric_C::NumericHintText' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, NumericSpinBox) == 0x000248, "Member 'UWBP_ModifierSetting_Numeric_C::NumericSpinBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, SettingText) == 0x000250, "Member 'UWBP_ModifierSetting_Numeric_C::SettingText' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, MagicValues) == 0x000268, "Member 'UWBP_ModifierSetting_Numeric_C::MagicValues' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, MagicValueText) == 0x0002B8, "Member 'UWBP_ModifierSetting_Numeric_C::MagicValueText' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, ValueSnapDelta) == 0x0002D0, "Member 'UWBP_ModifierSetting_Numeric_C::ValueSnapDelta' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, ValueInitial) == 0x0002D4, "Member 'UWBP_ModifierSetting_Numeric_C::ValueInitial' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, ValueMinInitial) == 0x0002D8, "Member 'UWBP_ModifierSetting_Numeric_C::ValueMinInitial' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, ValueMaxInitial) == 0x0002E0, "Member 'UWBP_ModifierSetting_Numeric_C::ValueMaxInitial' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, VisibleSpinBoxForegroundColor) == 0x0002E8, "Member 'UWBP_ModifierSetting_Numeric_C::VisibleSpinBoxForegroundColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, MinFractionalDigitsInitial) == 0x000310, "Member 'UWBP_ModifierSetting_Numeric_C::MinFractionalDigitsInitial' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, MaxFractionalDigitsInitial) == 0x000314, "Member 'UWBP_ModifierSetting_Numeric_C::MaxFractionalDigitsInitial' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, HiddenSpinBoxForegroundColor) == 0x000318, "Member 'UWBP_ModifierSetting_Numeric_C::HiddenSpinBoxForegroundColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, OnValueChanged) == 0x000340, "Member 'UWBP_ModifierSetting_Numeric_C::OnValueChanged' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_Numeric_C, OnValueCommitted) == 0x000350, "Member 'UWBP_ModifierSetting_Numeric_C::OnValueCommitted' has a wrong offset!");

}

