#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeployMenu_DeployButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C.OnClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_DeployButton_C_OnClicked__DelegateSignature final
{
public:
	bool                                          bCloseBtn;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_DeployButton_C_OnClicked__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DeployMenu_DeployButton_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_DeployMenu_DeployButton_C_OnClicked__DelegateSignature) == 0x000001, "Wrong size on WBP_DeployMenu_DeployButton_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_OnClicked__DelegateSignature, bCloseBtn) == 0x000000, "Member 'WBP_DeployMenu_DeployButton_C_OnClicked__DelegateSignature::bCloseBtn' has a wrong offset!");

// Function WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C.OnPressed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_DeployButton_C_OnPressed__DelegateSignature final
{
public:
	bool                                          bCloseBtn;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_DeployButton_C_OnPressed__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DeployMenu_DeployButton_C_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_DeployMenu_DeployButton_C_OnPressed__DelegateSignature) == 0x000001, "Wrong size on WBP_DeployMenu_DeployButton_C_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_OnPressed__DelegateSignature, bCloseBtn) == 0x000000, "Member 'WBP_DeployMenu_DeployButton_C_OnPressed__DelegateSignature::bCloseBtn' has a wrong offset!");

// Function WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C.OnReleased__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_DeployButton_C_OnReleased__DelegateSignature final
{
public:
	bool                                          bCloseBtn;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_DeployButton_C_OnReleased__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DeployMenu_DeployButton_C_OnReleased__DelegateSignature");
static_assert(sizeof(WBP_DeployMenu_DeployButton_C_OnReleased__DelegateSignature) == 0x000001, "Wrong size on WBP_DeployMenu_DeployButton_C_OnReleased__DelegateSignature");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_OnReleased__DelegateSignature, bCloseBtn) == 0x000000, "Member 'WBP_DeployMenu_DeployButton_C_OnReleased__DelegateSignature::bCloseBtn' has a wrong offset!");

// Function WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C.OnHovered__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_DeployButton_C_OnHovered__DelegateSignature final
{
public:
	bool                                          bCloseBtn;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_DeployButton_C_OnHovered__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DeployMenu_DeployButton_C_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_DeployMenu_DeployButton_C_OnHovered__DelegateSignature) == 0x000001, "Wrong size on WBP_DeployMenu_DeployButton_C_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_OnHovered__DelegateSignature, bCloseBtn) == 0x000000, "Member 'WBP_DeployMenu_DeployButton_C_OnHovered__DelegateSignature::bCloseBtn' has a wrong offset!");

// Function WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C.OnUnhovered__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_DeployButton_C_OnUnhovered__DelegateSignature final
{
public:
	bool                                          bCloseBtn;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_DeployButton_C_OnUnhovered__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DeployMenu_DeployButton_C_OnUnhovered__DelegateSignature");
static_assert(sizeof(WBP_DeployMenu_DeployButton_C_OnUnhovered__DelegateSignature) == 0x000001, "Wrong size on WBP_DeployMenu_DeployButton_C_OnUnhovered__DelegateSignature");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_OnUnhovered__DelegateSignature, bCloseBtn) == 0x000000, "Member 'WBP_DeployMenu_DeployButton_C_OnUnhovered__DelegateSignature::bCloseBtn' has a wrong offset!");

// Function WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C.ExecuteUbergraph_WBP_DeployMenu_DeployButton
// 0x02F8 (0x02F8 - 0x0000)
struct WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHDPlayerController*                    K2Node_DynamicCast_AsHDPlayer_Controller;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_GetUnFreezeTimerHandle_ReturnValue;       // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           K2Node_Select_Default;                             // 0x0070(0x0278)(ConstParm)
	int32                                         CallFunc_InternalGetSpawnTimeRemaining_SpawnSeconds; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_InternalGetSpawnTimeRemaining_SpawnSeconds_1; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton) == 0x000008, "Wrong alignment on WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton");
static_assert(sizeof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton) == 0x0002F8, "Wrong size on WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, EntryPoint) == 0x000000, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, K2Node_DynamicCast_AsHDPlayer_Controller) == 0x000050, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::K2Node_DynamicCast_AsHDPlayer_Controller' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_GetUnFreezeTimerHandle_ReturnValue) == 0x000060, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_GetUnFreezeTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000068, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_BooleanAND_ReturnValue_1) == 0x00006A, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, Temp_bool_Variable) == 0x00006B, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_BooleanOR_ReturnValue) == 0x00006C, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_BooleanAND_ReturnValue_2) == 0x00006D, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_BooleanOR_ReturnValue_1) == 0x00006E, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, K2Node_Select_Default) == 0x000070, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_InternalGetSpawnTimeRemaining_SpawnSeconds) == 0x0002E8, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_InternalGetSpawnTimeRemaining_SpawnSeconds' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_Less_IntInt_ReturnValue) == 0x0002EC, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_InternalGetSpawnTimeRemaining_SpawnSeconds_1) == 0x0002F0, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_InternalGetSpawnTimeRemaining_SpawnSeconds_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002F4, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton, CallFunc_BooleanOR_ReturnValue_2) == 0x0002F5, "Member 'WBP_DeployMenu_DeployButton_C_ExecuteUbergraph_WBP_DeployMenu_DeployButton::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_DeployMenu_DeployButton_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_DeployButton_C_Tick) == 0x000004, "Wrong alignment on WBP_DeployMenu_DeployButton_C_Tick");
static_assert(sizeof(WBP_DeployMenu_DeployButton_C_Tick) == 0x00003C, "Wrong size on WBP_DeployMenu_DeployButton_C_Tick");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_DeployMenu_DeployButton_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_DeployMenu_DeployButton_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_DeployButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_DeployButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DeployMenu_DeployButton_C_PreConstruct");
static_assert(sizeof(WBP_DeployMenu_DeployButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_DeployMenu_DeployButton_C_PreConstruct");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DeployMenu_DeployButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C.UpdateDeployBtnState
// 0x0038 (0x0038 - 0x0000)
struct WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState final
{
public:
	bool                                          bPlayerAlive;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDeploymentQueued;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSpawnPointSelected_0;                             // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHDPlayerController*                    K2Node_DynamicCast_AsHDPlayer_Controller;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_GetUnFreezeTimerHandle_ReturnValue;       // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_InternalGetSpawnTimeRemaining_SpawnSeconds; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState) == 0x000008, "Wrong alignment on WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState");
static_assert(sizeof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState) == 0x000038, "Wrong size on WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, bPlayerAlive) == 0x000000, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::bPlayerAlive' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, bDeploymentQueued) == 0x000001, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::bDeploymentQueued' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, bSpawnPointSelected_0) == 0x000002, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::bSpawnPointSelected_0' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, K2Node_DynamicCast_AsHDPlayer_Controller) == 0x000010, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::K2Node_DynamicCast_AsHDPlayer_Controller' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, CallFunc_GetUnFreezeTimerHandle_ReturnValue) == 0x000020, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::CallFunc_GetUnFreezeTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000028, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, CallFunc_InternalGetSpawnTimeRemaining_SpawnSeconds) == 0x00002C, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::CallFunc_InternalGetSpawnTimeRemaining_SpawnSeconds' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, CallFunc_BooleanAND_ReturnValue_1) == 0x000033, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState, CallFunc_BooleanOR_ReturnValue) == 0x000034, "Member 'WBP_DeployMenu_DeployButton_C_UpdateDeployBtnState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C.InternalUpdateBtnText
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText final
{
public:
	bool                                          bDeploying_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSpawnPointSelected_0;                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_InternalGetSpawnTimeRemaining_SpawnSeconds; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0100(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0110(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0128(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0140(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x0158(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x0170(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0188(0x0018)()
};
static_assert(alignof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText) == 0x000008, "Wrong alignment on WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText");
static_assert(sizeof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText) == 0x0001A0, "Wrong size on WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, bDeploying_0) == 0x000000, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::bDeploying_0' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, bSpawnPointSelected_0) == 0x000001, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::bSpawnPointSelected_0' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, Temp_bool_Variable) == 0x000002, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, Temp_bool_Variable_2) == 0x000004, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, Temp_bool_Variable_3) == 0x000005, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, CallFunc_InternalGetSpawnTimeRemaining_SpawnSeconds) == 0x000008, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::CallFunc_InternalGetSpawnTimeRemaining_SpawnSeconds' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B8, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, CallFunc_BooleanAND_ReturnValue) == 0x0000B9, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C0, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, K2Node_MakeArray_Array_1) == 0x000100, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, CallFunc_Format_ReturnValue_1) == 0x000110, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, K2Node_Select_Default) == 0x000128, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, K2Node_Select_Default_1) == 0x000140, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, K2Node_Select_Default_2) == 0x000158, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, K2Node_Select_Default_3) == 0x000170, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText, CallFunc_TextToUpper_ReturnValue) == 0x000188, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnText::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C.InternalUpdateBtnStyle
// 0x0280 (0x0280 - 0x0000)
struct WBP_DeployMenu_DeployButton_C_InternalUpdateBtnStyle final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           K2Node_Select_Default;                             // 0x0008(0x0278)(ConstParm)
};
static_assert(alignof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnStyle) == 0x000008, "Wrong alignment on WBP_DeployMenu_DeployButton_C_InternalUpdateBtnStyle");
static_assert(sizeof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnStyle) == 0x000280, "Wrong size on WBP_DeployMenu_DeployButton_C_InternalUpdateBtnStyle");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnStyle, Temp_bool_Variable) == 0x000000, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnStyle, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnStyle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalUpdateBtnStyle, K2Node_Select_Default) == 0x000008, "Member 'WBP_DeployMenu_DeployButton_C_InternalUpdateBtnStyle::K2Node_Select_Default' has a wrong offset!");

// Function WBP_DeployMenu_DeployButton.WBP_DeployMenu_DeployButton_C.InternalGetSpawnTimeRemaining
// 0x0030 (0x0030 - 0x0000)
struct WBP_DeployMenu_DeployButton_C_InternalGetSpawnTimeRemaining final
{
public:
	int32                                         SpawnSeconds;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHDPlayerController*                    K2Node_DynamicCast_AsHDPlayer_Controller;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_GetUnFreezeTimerHandle_ReturnValue;       // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_DeployButton_C_InternalGetSpawnTimeRemaining) == 0x000008, "Wrong alignment on WBP_DeployMenu_DeployButton_C_InternalGetSpawnTimeRemaining");
static_assert(sizeof(WBP_DeployMenu_DeployButton_C_InternalGetSpawnTimeRemaining) == 0x000030, "Wrong size on WBP_DeployMenu_DeployButton_C_InternalGetSpawnTimeRemaining");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalGetSpawnTimeRemaining, SpawnSeconds) == 0x000000, "Member 'WBP_DeployMenu_DeployButton_C_InternalGetSpawnTimeRemaining::SpawnSeconds' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_DeployButton_C_InternalGetSpawnTimeRemaining, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_DeployMenu_DeployButton_C_InternalGetSpawnTimeRemaining::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
