#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CaptureStatus_UnitIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ECaptureUnitType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CaptureStatus_UnitIcon.WBP_CaptureStatus_UnitIcon_C
// 0x0280 (0x04B0 - 0x0230)
class UWBP_CaptureStatus_UnitIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 UnitIcon;                                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ECaptureUnitType                              UnitType;                                          // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            UnoccupiedUnitImage;                               // 0x0248(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateBrush                            FriendlyUnitImage;                                 // 0x02D0(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateBrush                            EnemyUnitImage;                                    // 0x0358(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateBrush                            MultipleUnitImage;                                 // 0x03E0(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          bUseFriendlyUnitColor;                             // 0x0468(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           UnoccupiedUnitColor;                               // 0x046C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FriendlyUnitColor;                                 // 0x047C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EnemyUnitColor;                                    // 0x048C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUnitMultiple;                                     // 0x049C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bIsDesignTime;                                     // 0x049D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49E[0x2];                                      // 0x049E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LocalUnitColorToUse;                               // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CaptureStatus_UnitIcon(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetUnitType(ECaptureUnitType NewUnitType);
	void SetIsMultipleUnit(bool bNewUnitMultiple);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CaptureStatus_UnitIcon_C">();
	}
	static class UWBP_CaptureStatus_UnitIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CaptureStatus_UnitIcon_C>();
	}
};
static_assert(alignof(UWBP_CaptureStatus_UnitIcon_C) == 0x000008, "Wrong alignment on UWBP_CaptureStatus_UnitIcon_C");
static_assert(sizeof(UWBP_CaptureStatus_UnitIcon_C) == 0x0004B0, "Wrong size on UWBP_CaptureStatus_UnitIcon_C");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, UberGraphFrame) == 0x000230, "Member 'UWBP_CaptureStatus_UnitIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, UnitIcon) == 0x000238, "Member 'UWBP_CaptureStatus_UnitIcon_C::UnitIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, UnitType) == 0x000240, "Member 'UWBP_CaptureStatus_UnitIcon_C::UnitType' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, UnoccupiedUnitImage) == 0x000248, "Member 'UWBP_CaptureStatus_UnitIcon_C::UnoccupiedUnitImage' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, FriendlyUnitImage) == 0x0002D0, "Member 'UWBP_CaptureStatus_UnitIcon_C::FriendlyUnitImage' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, EnemyUnitImage) == 0x000358, "Member 'UWBP_CaptureStatus_UnitIcon_C::EnemyUnitImage' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, MultipleUnitImage) == 0x0003E0, "Member 'UWBP_CaptureStatus_UnitIcon_C::MultipleUnitImage' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, bUseFriendlyUnitColor) == 0x000468, "Member 'UWBP_CaptureStatus_UnitIcon_C::bUseFriendlyUnitColor' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, UnoccupiedUnitColor) == 0x00046C, "Member 'UWBP_CaptureStatus_UnitIcon_C::UnoccupiedUnitColor' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, FriendlyUnitColor) == 0x00047C, "Member 'UWBP_CaptureStatus_UnitIcon_C::FriendlyUnitColor' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, EnemyUnitColor) == 0x00048C, "Member 'UWBP_CaptureStatus_UnitIcon_C::EnemyUnitColor' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, bUnitMultiple) == 0x00049C, "Member 'UWBP_CaptureStatus_UnitIcon_C::bUnitMultiple' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, bIsDesignTime) == 0x00049D, "Member 'UWBP_CaptureStatus_UnitIcon_C::bIsDesignTime' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_UnitIcon_C, LocalUnitColorToUse) == 0x0004A0, "Member 'UWBP_CaptureStatus_UnitIcon_C::LocalUnitColorToUse' has a wrong offset!");

}

