#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionMenu_JoinGame

#include "Basic.hpp"

#include "HDMain_structs.hpp"
#include "HDMain_classes.hpp"
#include "Engine_structs.hpp"
#include "FServerBadgeUIDefinition_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OptionMenu_JoinGame.WBP_OptionMenu_JoinGame_C
// 0x00C0 (0x0340 - 0x0280)
class UWBP_OptionMenu_JoinGame_C final : public UHDJoinGameMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_JoinServerDetailsPanel_C*          DetailsPanel;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                FiltersOpenCloseBtn;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JoinServerFiltersPanel_C*          FiltersPanel;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               FiltersPanelOpenCloseBox;                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JoinServer_Header_C*               GameModeHeader;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JoinServer_Header_C*               MapHeader;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JoinServer_Header_C*               ModHeader;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JoinServer_Header_C*               PingHeader;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JoinServer_Header_C*               PlayersHeader;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RefreshListBtn;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      RefreshListThrobber;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServerDetails_C*                   ServerDetails;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ServerDetailsContainer;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ServerListBox;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JoinServer_Header_C*               ServerNameHeader;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHDServerListItemData*                  SelectedServerListItem;                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowServerDetailsInDesigner;                      // 0x0308(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             ServerBadgeTable;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FFServerBadgeUIDefinition>      ServerBadgeDefs;                                   // 0x0318(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bDesignTime;                                       // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LastConfirmedJoinPassword;                         // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OptionMenu_JoinGame(int32 EntryPoint);
	void ConfirmServerPasswordInput(const class FText& InputText);
	void SortPreferenceChanged(const struct FFServerSortPreference& SortPreference);
	void BndEvt__FiltersPanel_K2Node_ComponentBoundEvent_8_OnServerFiltersChanged__DelegateSignature(const TMap<class UClass*, struct FHDFilterRuleParams>& ActiveFilters);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__ServerList_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void OnInitialized();
	void BndEvt__DetailsPanel_K2Node_ComponentBoundEvent_3_OnJoinServerBtnClicked__DelegateSignature();
	void BndEvt__ServerList_K2Node_ComponentBoundEvent_7_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__ServerList_K2Node_ComponentBoundEvent_1_OnListItemScrolledIntoViewDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void BndEvt__ServerList_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__RefreshListBtn_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void ReceiveOnRefreshComplete(bool bSortAscending, EHDServerListSortBy SortBy);
	void ReceiveOnRefreshStart();
	void SetActiveSubMenuByIndex(int32 SubMenuIndex);
	void ServerListItemSelectionUpdated(class UHDServerListItemData* InSelectedServerListItem);
	void ServerListItemSelectionCleared();
	void ClearServerListItemSelection();
	void GetSelectedServerListItem(class UHDServerListItemData** ServerItem);
	void IsValidServerListItemIndex(int32 IndexToTest, bool* bValidIndex);
	void GetServerListSortPreference(struct FFServerSortPreference* SortPreference);
	void ToggleServerDetails(bool bShown);
	void RefreshServerList();
	void ApplyActiveServerFilters();
	void OpenPasswordPrompt();
	void GetDesiredVerticalAlignment(EVerticalAlignment* Alignment);
	void GetDesiredHorizontalAlignment(EHorizontalAlignment* Alignment);
	void GetSubMenuOptions(TArray<struct FFSubMenuOption>* SubOptions);
	void HasSubMenus(bool* bSubMenuOptions);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OptionMenu_JoinGame_C">();
	}
	static class UWBP_OptionMenu_JoinGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OptionMenu_JoinGame_C>();
	}
};
static_assert(alignof(UWBP_OptionMenu_JoinGame_C) == 0x000008, "Wrong alignment on UWBP_OptionMenu_JoinGame_C");
static_assert(sizeof(UWBP_OptionMenu_JoinGame_C) == 0x000340, "Wrong size on UWBP_OptionMenu_JoinGame_C");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, UberGraphFrame) == 0x000280, "Member 'UWBP_OptionMenu_JoinGame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, DetailsPanel) == 0x000288, "Member 'UWBP_OptionMenu_JoinGame_C::DetailsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, FiltersOpenCloseBtn) == 0x000290, "Member 'UWBP_OptionMenu_JoinGame_C::FiltersOpenCloseBtn' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, FiltersPanel) == 0x000298, "Member 'UWBP_OptionMenu_JoinGame_C::FiltersPanel' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, FiltersPanelOpenCloseBox) == 0x0002A0, "Member 'UWBP_OptionMenu_JoinGame_C::FiltersPanelOpenCloseBox' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, GameModeHeader) == 0x0002A8, "Member 'UWBP_OptionMenu_JoinGame_C::GameModeHeader' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, MapHeader) == 0x0002B0, "Member 'UWBP_OptionMenu_JoinGame_C::MapHeader' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, ModHeader) == 0x0002B8, "Member 'UWBP_OptionMenu_JoinGame_C::ModHeader' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, PingHeader) == 0x0002C0, "Member 'UWBP_OptionMenu_JoinGame_C::PingHeader' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, PlayersHeader) == 0x0002C8, "Member 'UWBP_OptionMenu_JoinGame_C::PlayersHeader' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, RefreshListBtn) == 0x0002D0, "Member 'UWBP_OptionMenu_JoinGame_C::RefreshListBtn' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, RefreshListThrobber) == 0x0002D8, "Member 'UWBP_OptionMenu_JoinGame_C::RefreshListThrobber' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, ServerDetails) == 0x0002E0, "Member 'UWBP_OptionMenu_JoinGame_C::ServerDetails' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, ServerDetailsContainer) == 0x0002E8, "Member 'UWBP_OptionMenu_JoinGame_C::ServerDetailsContainer' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, ServerListBox) == 0x0002F0, "Member 'UWBP_OptionMenu_JoinGame_C::ServerListBox' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, ServerNameHeader) == 0x0002F8, "Member 'UWBP_OptionMenu_JoinGame_C::ServerNameHeader' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, SelectedServerListItem) == 0x000300, "Member 'UWBP_OptionMenu_JoinGame_C::SelectedServerListItem' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, bShowServerDetailsInDesigner) == 0x000308, "Member 'UWBP_OptionMenu_JoinGame_C::bShowServerDetailsInDesigner' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, ServerBadgeTable) == 0x000310, "Member 'UWBP_OptionMenu_JoinGame_C::ServerBadgeTable' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, ServerBadgeDefs) == 0x000318, "Member 'UWBP_OptionMenu_JoinGame_C::ServerBadgeDefs' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, bDesignTime) == 0x000328, "Member 'UWBP_OptionMenu_JoinGame_C::bDesignTime' has a wrong offset!");
static_assert(offsetof(UWBP_OptionMenu_JoinGame_C, LastConfirmedJoinPassword) == 0x000330, "Member 'UWBP_OptionMenu_JoinGame_C::LastConfirmedJoinPassword' has a wrong offset!");

}

