#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BotsGameModifierSettings

#include "Basic.hpp"

#include "HDMain_structs.hpp"


namespace SDK::Params
{

// Function WBP_BotsGameModifierSettings.WBP_BotsGameModifierSettings_C.ExecuteUbergraph_WBP_BotsGameModifierSettings
// 0x0010 (0x0010 - 0x0000)
struct WBP_BotsGameModifierSettings_C_ExecuteUbergraph_WBP_BotsGameModifierSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_OptionMenu_CreateGame_C*           K2Node_Event_ParentMenu;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BotsGameModifierSettings_C_ExecuteUbergraph_WBP_BotsGameModifierSettings) == 0x000008, "Wrong alignment on WBP_BotsGameModifierSettings_C_ExecuteUbergraph_WBP_BotsGameModifierSettings");
static_assert(sizeof(WBP_BotsGameModifierSettings_C_ExecuteUbergraph_WBP_BotsGameModifierSettings) == 0x000010, "Wrong size on WBP_BotsGameModifierSettings_C_ExecuteUbergraph_WBP_BotsGameModifierSettings");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_ExecuteUbergraph_WBP_BotsGameModifierSettings, EntryPoint) == 0x000000, "Member 'WBP_BotsGameModifierSettings_C_ExecuteUbergraph_WBP_BotsGameModifierSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_ExecuteUbergraph_WBP_BotsGameModifierSettings, K2Node_Event_ParentMenu) == 0x000008, "Member 'WBP_BotsGameModifierSettings_C_ExecuteUbergraph_WBP_BotsGameModifierSettings::K2Node_Event_ParentMenu' has a wrong offset!");

// Function WBP_BotsGameModifierSettings.WBP_BotsGameModifierSettings_C.SetupModifier
// 0x0008 (0x0008 - 0x0000)
struct WBP_BotsGameModifierSettings_C_SetupModifier final
{
public:
	class UWBP_OptionMenu_CreateGame_C*           ParentMenu;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BotsGameModifierSettings_C_SetupModifier) == 0x000008, "Wrong alignment on WBP_BotsGameModifierSettings_C_SetupModifier");
static_assert(sizeof(WBP_BotsGameModifierSettings_C_SetupModifier) == 0x000008, "Wrong size on WBP_BotsGameModifierSettings_C_SetupModifier");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_SetupModifier, ParentMenu) == 0x000000, "Member 'WBP_BotsGameModifierSettings_C_SetupModifier::ParentMenu' has a wrong offset!");

// Function WBP_BotsGameModifierSettings.WBP_BotsGameModifierSettings_C.BuildBotCountURLOption
// 0x0058 (0x0058 - 0x0000)
struct WBP_BotsGameModifierSettings_C_BuildBotCountURLOption final
{
public:
	EHDTeam                                       Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Pair;                                              // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetNumBotsOptionName_ReturnValue;         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BotsGameModifierSettings_C_BuildBotCountURLOption) == 0x000008, "Wrong alignment on WBP_BotsGameModifierSettings_C_BuildBotCountURLOption");
static_assert(sizeof(WBP_BotsGameModifierSettings_C_BuildBotCountURLOption) == 0x000058, "Wrong size on WBP_BotsGameModifierSettings_C_BuildBotCountURLOption");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_BuildBotCountURLOption, Team) == 0x000000, "Member 'WBP_BotsGameModifierSettings_C_BuildBotCountURLOption::Team' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_BuildBotCountURLOption, Count) == 0x000004, "Member 'WBP_BotsGameModifierSettings_C_BuildBotCountURLOption::Count' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_BuildBotCountURLOption, Pair) == 0x000008, "Member 'WBP_BotsGameModifierSettings_C_BuildBotCountURLOption::Pair' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_BuildBotCountURLOption, CallFunc_GetNumBotsOptionName_ReturnValue) == 0x000018, "Member 'WBP_BotsGameModifierSettings_C_BuildBotCountURLOption::CallFunc_GetNumBotsOptionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_BuildBotCountURLOption, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'WBP_BotsGameModifierSettings_C_BuildBotCountURLOption::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_BuildBotCountURLOption, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'WBP_BotsGameModifierSettings_C_BuildBotCountURLOption::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_BuildBotCountURLOption, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'WBP_BotsGameModifierSettings_C_BuildBotCountURLOption::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function WBP_BotsGameModifierSettings.WBP_BotsGameModifierSettings_C.IsEnabled
// 0x0002 (0x0002 - 0x0000)
struct WBP_BotsGameModifierSettings_C_IsEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_bActive;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_BotsGameModifierSettings_C_IsEnabled) == 0x000001, "Wrong alignment on WBP_BotsGameModifierSettings_C_IsEnabled");
static_assert(sizeof(WBP_BotsGameModifierSettings_C_IsEnabled) == 0x000002, "Wrong size on WBP_BotsGameModifierSettings_C_IsEnabled");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_IsEnabled, bEnabled) == 0x000000, "Member 'WBP_BotsGameModifierSettings_C_IsEnabled::bEnabled' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_IsEnabled, CallFunc_IsActive_bActive) == 0x000001, "Member 'WBP_BotsGameModifierSettings_C_IsEnabled::CallFunc_IsActive_bActive' has a wrong offset!");

// Function WBP_BotsGameModifierSettings.WBP_BotsGameModifierSettings_C.GetTravelURLOptions
// 0x0088 (0x0088 - 0x0000)
struct WBP_BotsGameModifierSettings_C_GetTravelURLOptions final
{
public:
	class FString                                 Options;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 OptionsStr;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_Value;                           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_Value_1;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildBotCountURLOption_Pair;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildBotCountURLOption_Pair_1;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions) == 0x000008, "Wrong alignment on WBP_BotsGameModifierSettings_C_GetTravelURLOptions");
static_assert(sizeof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions) == 0x000088, "Wrong size on WBP_BotsGameModifierSettings_C_GetTravelURLOptions");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions, Options) == 0x000000, "Member 'WBP_BotsGameModifierSettings_C_GetTravelURLOptions::Options' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions, OptionsStr) == 0x000010, "Member 'WBP_BotsGameModifierSettings_C_GetTravelURLOptions::OptionsStr' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'WBP_BotsGameModifierSettings_C_GetTravelURLOptions::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions, CallFunc_MakeLiteralInt_ReturnValue) == 0x000030, "Member 'WBP_BotsGameModifierSettings_C_GetTravelURLOptions::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'WBP_BotsGameModifierSettings_C_GetTravelURLOptions::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'WBP_BotsGameModifierSettings_C_GetTravelURLOptions::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions, CallFunc_GetValue_Value) == 0x000058, "Member 'WBP_BotsGameModifierSettings_C_GetTravelURLOptions::CallFunc_GetValue_Value' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions, CallFunc_GetValue_Value_1) == 0x00005C, "Member 'WBP_BotsGameModifierSettings_C_GetTravelURLOptions::CallFunc_GetValue_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions, CallFunc_FTrunc_ReturnValue) == 0x000060, "Member 'WBP_BotsGameModifierSettings_C_GetTravelURLOptions::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions, CallFunc_FTrunc_ReturnValue_1) == 0x000064, "Member 'WBP_BotsGameModifierSettings_C_GetTravelURLOptions::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions, CallFunc_BuildBotCountURLOption_Pair) == 0x000068, "Member 'WBP_BotsGameModifierSettings_C_GetTravelURLOptions::CallFunc_BuildBotCountURLOption_Pair' has a wrong offset!");
static_assert(offsetof(WBP_BotsGameModifierSettings_C_GetTravelURLOptions, CallFunc_BuildBotCountURLOption_Pair_1) == 0x000078, "Member 'WBP_BotsGameModifierSettings_C_GetTravelURLOptions::CallFunc_BuildBotCountURLOption_Pair_1' has a wrong offset!");

}

