#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerListModifierSetting_FilterRule

#include "Basic.hpp"

#include "HDMain_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerListModifierSetting_FilterRule.WBP_ServerListModifierSetting_FilterRule_C
// 0x0048 (0x0278 - 0x0230)
class UWBP_ServerListModifierSetting_FilterRule_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ModifierSetting_ComboBox_C*        FilterSetting;                                     // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0240(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FHDFilterRuleParams                    RuleParams;                                        // 0x0258(0x0002)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Rule;                                              // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnDropdownSettingChanged;                          // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnDropdownSettingChanged__DelegateSignature(class UClass* Rule_0, const struct FHDFilterRuleParams& RuleParams_0);
	void ExecuteUbergraph_WBP_ServerListModifierSetting_FilterRule(int32 EntryPoint);
	void BndEvt__FilterSetting_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void PreConstruct(bool IsDesignTime);
	void SetRuleParams(const struct FHDFilterRuleParams& NewParams);
	void GetRuleParams(struct FHDFilterRuleParams* Params_0);

	void GetFilterRulePair(class UClass** Rule_0, struct FHDFilterRuleParams* RuleParams_0) const;
	void IsFilterEnabled(bool* bActive) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerListModifierSetting_FilterRule_C">();
	}
	static class UWBP_ServerListModifierSetting_FilterRule_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerListModifierSetting_FilterRule_C>();
	}
};
static_assert(alignof(UWBP_ServerListModifierSetting_FilterRule_C) == 0x000008, "Wrong alignment on UWBP_ServerListModifierSetting_FilterRule_C");
static_assert(sizeof(UWBP_ServerListModifierSetting_FilterRule_C) == 0x000278, "Wrong size on UWBP_ServerListModifierSetting_FilterRule_C");
static_assert(offsetof(UWBP_ServerListModifierSetting_FilterRule_C, UberGraphFrame) == 0x000230, "Member 'UWBP_ServerListModifierSetting_FilterRule_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListModifierSetting_FilterRule_C, FilterSetting) == 0x000238, "Member 'UWBP_ServerListModifierSetting_FilterRule_C::FilterSetting' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListModifierSetting_FilterRule_C, Text) == 0x000240, "Member 'UWBP_ServerListModifierSetting_FilterRule_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListModifierSetting_FilterRule_C, RuleParams) == 0x000258, "Member 'UWBP_ServerListModifierSetting_FilterRule_C::RuleParams' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListModifierSetting_FilterRule_C, Rule) == 0x000260, "Member 'UWBP_ServerListModifierSetting_FilterRule_C::Rule' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListModifierSetting_FilterRule_C, OnDropdownSettingChanged) == 0x000268, "Member 'UWBP_ServerListModifierSetting_FilterRule_C::OnDropdownSettingChanged' has a wrong offset!");

}

