#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeployMenu_ClassSelectionPanel

#include "Basic.hpp"

#include "HDMain_structs.hpp"
#include "HDMain_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DeployMenu_ClassSelectionPanel.WBP_DeployMenu_ClassSelectionPanel_C
// 0x0090 (0x02C0 - 0x0230)
class UWBP_DeployMenu_ClassSelectionPanel_C final : public UDeployMenu_ClassSelectionPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             ClassScrollBox;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bPanelInitialized;                                 // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HDPlayerControllerBase_C*           HDOwningPlayer;                                    // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle_CheckRestrictions;                     // 0x0250(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 KitListingWidgetClass;                             // 0x0258(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TSet<class UHDKit*>                           DesignPreviewKits;                                 // 0x0260(0x0050)(Edit, BlueprintVisible)
	class UHDKit*                                 SelectedClass;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHDTeam                                       LastFaction;                                       // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_DeployMenu_ClassSelectionPanel(int32 EntryPoint);
	void OnClassDeselected(class UWBP_DeployMenu_ClassSelectionListing_C* DeselectedClassWidget);
	void OnClassSelected(class UWBP_DeployMenu_ClassSelectionListing_C* SelectedClassWidget);
	void Destruct();
	void CheckRestrictions();
	void LateInit_RepPlayerState();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void RepopulateListByFaction(EHDTeam OwningPlayerTeam);
	void InternalPopulateListWithClasses(const TSet<class UHDKit*>& TeamKits);
	void InternalCreateClassListingWidget(class UHDKit* Kit, class UWBP_DeployMenu_ClassSelectionListing_C** NewKitListingWidget);
	void ToggleRestrictionsTimer(bool bEnabled, bool bFireOnceImmediately);
	void SetClassSelectionStateByIndex(int32 ChildIndex, bool bSelected);
	void InternalDeselectAllClasses();
	void SelectFirstUnrestrictedClass();
	void InternalUpdateSelectionState(class UDeployMenu_ClassSelectionListing* NewSelection);
	void SetClassSelectionState(class UHDKit* ClassToUpdate, bool bSelected, bool bMatchDisplayNames, bool* bClassUpdated);

	void IsValidClassListingIndex(int32 ChildIndex, bool* bValidIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DeployMenu_ClassSelectionPanel_C">();
	}
	static class UWBP_DeployMenu_ClassSelectionPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DeployMenu_ClassSelectionPanel_C>();
	}
};
static_assert(alignof(UWBP_DeployMenu_ClassSelectionPanel_C) == 0x000008, "Wrong alignment on UWBP_DeployMenu_ClassSelectionPanel_C");
static_assert(sizeof(UWBP_DeployMenu_ClassSelectionPanel_C) == 0x0002C0, "Wrong size on UWBP_DeployMenu_ClassSelectionPanel_C");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionPanel_C, UberGraphFrame) == 0x000230, "Member 'UWBP_DeployMenu_ClassSelectionPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionPanel_C, ClassScrollBox) == 0x000238, "Member 'UWBP_DeployMenu_ClassSelectionPanel_C::ClassScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionPanel_C, bPanelInitialized) == 0x000240, "Member 'UWBP_DeployMenu_ClassSelectionPanel_C::bPanelInitialized' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionPanel_C, HDOwningPlayer) == 0x000248, "Member 'UWBP_DeployMenu_ClassSelectionPanel_C::HDOwningPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionPanel_C, TimerHandle_CheckRestrictions) == 0x000250, "Member 'UWBP_DeployMenu_ClassSelectionPanel_C::TimerHandle_CheckRestrictions' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionPanel_C, KitListingWidgetClass) == 0x000258, "Member 'UWBP_DeployMenu_ClassSelectionPanel_C::KitListingWidgetClass' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionPanel_C, DesignPreviewKits) == 0x000260, "Member 'UWBP_DeployMenu_ClassSelectionPanel_C::DesignPreviewKits' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionPanel_C, SelectedClass) == 0x0002B0, "Member 'UWBP_DeployMenu_ClassSelectionPanel_C::SelectedClass' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionPanel_C, LastFaction) == 0x0002B8, "Member 'UWBP_DeployMenu_ClassSelectionPanel_C::LastFaction' has a wrong offset!");

}

