#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HDRadialMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SRadialMenuIconSettings_structs.hpp"
#include "SHDRadialMenu_OptionData_structs.hpp"
#include "WBP_HDRadialMenuBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HDRadialMenu.WBP_HDRadialMenu_C
// 0x0130 (0x03A8 - 0x0278)
class UWBP_HDRadialMenu_C final : public UWBP_HDRadialMenuBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_HDRadialMenu_C;                 // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowFirst;                                         // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowCategory;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowBuild;                                         // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CategoryTitle;                                     // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CenterCircle;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RadialMenuBase_C*                  MenuOptionsRing;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MenuSubselection;                                  // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   SelectedItem;                                      // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SelectedMenuOption;                                // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHDRadialMenu_OptionData              CategoryData;                                      // 0x02C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bPickingItem;                                      // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSHDRadialMenu_OptionData              SelectedItemData;                                  // 0x02F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         SelectedIndex;                                     // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CategorySelectSound;                               // 0x0328(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             GoBackSound;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSRadialMenuIconSettings               IconStyle;                                         // 0x0338(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MenuOptionsMain;                                   // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             MenuOptionsSelected;                               // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSRadialMenuIconSettings               DisabledIconStyle;                                 // 0x0370(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RallypointRespawnTimeDefault;                      // 0x0398(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutpostRespawnTime;                                // 0x039C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfSegments;                                  // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HDRadialMenu(int32 EntryPoint);
	void OnCancel();
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void GoBack();
	void Submit();
	void BndEvt__categoryRing_K2Node_ComponentBoundEvent_1_SelectionChanged__DelegateSignature(int32 NewSelection, int32 OldSelection);
	class FText GetCategoryName();
	void GetCategories(TArray<class FName>* Categories);
	void GetCategoryData(class FName Category, struct FSHDRadialMenu_OptionData* CategoryData_0);
	void GetItemNamesForSelectedOption(TArray<class FName>* OutRowNames);
	void GetItemData(class FName RowName, struct FSHDRadialMenu_OptionData* ItemData);
	void PopulateMenuOptions(class UDataTable* MenuOptions);
	void PopulateSubmenuOptions();
	void SelectSubmenu();
	void MakeSpottingIcon(const struct FSHDRadialMenu_OptionData& OptionData, class UWBP_RadialMenuIconBase_C** Widget);
	void MakeRallypointIcon(const struct FSHDRadialMenu_OptionData& OptionData, class UWBP_RadialMenuIconBase_C** Widget);
	void MakeOutpostIcon(const struct FSHDRadialMenu_OptionData& OptionData, class UWBP_RadialMenuIconBase_C** Widget);
	void OwnerPawnDeath(class APawn* VictimPawn, class AController* VictimController, float KillingDamage, const struct FDamageEvent& DamageEvent, class APawn* InstigatingPawn, class AActor* DamageCauser);
	void GetRallypointTimeRemaining(class ABP_HDPlayerCharacterBase_C* OwnerPawn, class FText* TimeRemaining);
	class FText GetRallypointName();
	void GetOutpostTimeRemaining(class ABP_HDPlayerCharacterBase_C* OwnerPawn, class FText* TimeRemaining);
	class FText GetOutpostName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HDRadialMenu_C">();
	}
	static class UWBP_HDRadialMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HDRadialMenu_C>();
	}
};
static_assert(alignof(UWBP_HDRadialMenu_C) == 0x000008, "Wrong alignment on UWBP_HDRadialMenu_C");
static_assert(sizeof(UWBP_HDRadialMenu_C) == 0x0003A8, "Wrong size on UWBP_HDRadialMenu_C");
static_assert(offsetof(UWBP_HDRadialMenu_C, UberGraphFrame_WBP_HDRadialMenu_C) == 0x000278, "Member 'UWBP_HDRadialMenu_C::UberGraphFrame_WBP_HDRadialMenu_C' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, ShowFirst) == 0x000280, "Member 'UWBP_HDRadialMenu_C::ShowFirst' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, ShowCategory) == 0x000288, "Member 'UWBP_HDRadialMenu_C::ShowCategory' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, ShowBuild) == 0x000290, "Member 'UWBP_HDRadialMenu_C::ShowBuild' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, CategoryTitle) == 0x000298, "Member 'UWBP_HDRadialMenu_C::CategoryTitle' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, CenterCircle) == 0x0002A0, "Member 'UWBP_HDRadialMenu_C::CenterCircle' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, MenuOptionsRing) == 0x0002A8, "Member 'UWBP_HDRadialMenu_C::MenuOptionsRing' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, MenuSubselection) == 0x0002B0, "Member 'UWBP_HDRadialMenu_C::MenuSubselection' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, SelectedItem) == 0x0002B8, "Member 'UWBP_HDRadialMenu_C::SelectedItem' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, SelectedMenuOption) == 0x0002C0, "Member 'UWBP_HDRadialMenu_C::SelectedMenuOption' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, CategoryData) == 0x0002C8, "Member 'UWBP_HDRadialMenu_C::CategoryData' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, bPickingItem) == 0x0002F0, "Member 'UWBP_HDRadialMenu_C::bPickingItem' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, SelectedItemData) == 0x0002F8, "Member 'UWBP_HDRadialMenu_C::SelectedItemData' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, SelectedIndex) == 0x000320, "Member 'UWBP_HDRadialMenu_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, CategorySelectSound) == 0x000328, "Member 'UWBP_HDRadialMenu_C::CategorySelectSound' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, GoBackSound) == 0x000330, "Member 'UWBP_HDRadialMenu_C::GoBackSound' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, IconStyle) == 0x000338, "Member 'UWBP_HDRadialMenu_C::IconStyle' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, MenuOptionsMain) == 0x000360, "Member 'UWBP_HDRadialMenu_C::MenuOptionsMain' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, MenuOptionsSelected) == 0x000368, "Member 'UWBP_HDRadialMenu_C::MenuOptionsSelected' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, DisabledIconStyle) == 0x000370, "Member 'UWBP_HDRadialMenu_C::DisabledIconStyle' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, RallypointRespawnTimeDefault) == 0x000398, "Member 'UWBP_HDRadialMenu_C::RallypointRespawnTimeDefault' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, OutpostRespawnTime) == 0x00039C, "Member 'UWBP_HDRadialMenu_C::OutpostRespawnTime' has a wrong offset!");
static_assert(offsetof(UWBP_HDRadialMenu_C, NumberOfSegments) == 0x0003A0, "Member 'UWBP_HDRadialMenu_C::NumberOfSegments' has a wrong offset!");

}

