#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DlgBox_ServerPasswordPrompt

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DlgBox_ServerPasswordPrompt.WBP_DlgBox_ServerPasswordPrompt_C.OnConfirmInput__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_DlgBox_ServerPasswordPrompt_C_OnConfirmInput__DelegateSignature final
{
public:
	class FText                                   InputText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_DlgBox_ServerPasswordPrompt_C_OnConfirmInput__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DlgBox_ServerPasswordPrompt_C_OnConfirmInput__DelegateSignature");
static_assert(sizeof(WBP_DlgBox_ServerPasswordPrompt_C_OnConfirmInput__DelegateSignature) == 0x000018, "Wrong size on WBP_DlgBox_ServerPasswordPrompt_C_OnConfirmInput__DelegateSignature");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnConfirmInput__DelegateSignature, InputText) == 0x000000, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnConfirmInput__DelegateSignature::InputText' has a wrong offset!");

// Function WBP_DlgBox_ServerPasswordPrompt.WBP_DlgBox_ServerPasswordPrompt_C.ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt
// 0x0040 (0x0040 - 0x0000)
struct WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0014(0x0008)(NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0020(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt) == 0x000008, "Wrong alignment on WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt");
static_assert(sizeof(WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt) == 0x000040, "Wrong size on WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt, EntryPoint) == 0x000000, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt, K2Node_Event_InFocusEvent) == 0x000014, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt, CallFunc_GetText_ReturnValue) == 0x000020, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt, CallFunc_TextIsEmpty_ReturnValue) == 0x000038, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_ExecuteUbergraph_WBP_DlgBox_ServerPasswordPrompt::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_DlgBox_ServerPasswordPrompt.WBP_DlgBox_ServerPasswordPrompt_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_DlgBox_ServerPasswordPrompt_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_DlgBox_ServerPasswordPrompt_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_DlgBox_ServerPasswordPrompt_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_DlgBox_ServerPasswordPrompt_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_DlgBox_ServerPasswordPrompt_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_DlgBox_ServerPasswordPrompt.WBP_DlgBox_ServerPasswordPrompt_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown");
static_assert(sizeof(WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown) == 0x000218, "Wrong size on WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DlgBox_ServerPasswordPrompt.WBP_DlgBox_ServerPasswordPrompt_C.OnPreviewKeyDown
// 0x0200 (0x0200 - 0x0000)
struct WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0148(0x00B8)()
};
static_assert(alignof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown");
static_assert(sizeof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown) == 0x000200, "Wrong size on WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown, ReturnValue) == 0x000070, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000140, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000141, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x000142, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue_3) == 0x000143, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown, CallFunc_BooleanOR_ReturnValue) == 0x000144, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown, CallFunc_BooleanOR_ReturnValue_1) == 0x000145, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown, CallFunc_Handled_ReturnValue) == 0x000148, "Member 'WBP_DlgBox_ServerPasswordPrompt_C_OnPreviewKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

