#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CreateGameSelectionListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "FSelectionItemTextStyle_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CreateGameSelectionListEntry.WBP_CreateGameSelectionListEntry_C
// 0x0868 (0x0A98 - 0x0230)
class UWBP_CreateGameSelectionListEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ItemBg;                                            // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ItemBox;                                           // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              ItemCheckBox;                                      // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemSelectionHighlight;                            // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemSubText;                                       // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemText;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelectionStateChanged;                           // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FCheckBoxStyle                         ItemStyle;                                         // 0x0278(0x0580)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FFSelectionItemTextStyle               ItemTextStyle;                                     // 0x07F8(0x0130)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FFSelectionItemTextStyle               ItemSubTextStyle;                                  // 0x0928(0x0130)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ItemMinWidth;                                      // 0x0A58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_A5C[0x4];                                      // 0x0A5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0A60(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   SubText;                                           // 0x0A78(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         ItemMinHeight;                                     // 0x0A90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bSelectionToggle;                                  // 0x0A94(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void OnSelectionStateChanged__DelegateSignature(class UWBP_CreateGameSelectionListEntry_C* Item, bool bSelected);
	void ExecuteUbergraph_WBP_CreateGameSelectionListEntry(int32 EntryPoint);
	void BndEvt__ItemCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void PreConstruct(bool IsDesignTime);
	void SetItemSelectionState(ECheckBoxState InSelectionState);
	void SetItemIsSelected(bool bSelected);
	void GetItemSelectionState(ECheckBoxState* SelectionState);
	void IsItemSelected(bool* bSelected);
	void InternalApplyStyleToText(class UTextBlock* Text_0, struct FFSelectionItemTextStyle& TextStyle);
	void InternalUpdateItemBgTintColor(bool bSelected);
	void SetItemStyle(const struct FCheckBoxStyle& InItemStyle);
	void SetItemTextStyle(const struct FFSelectionItemTextStyle& InItemTextStyle);
	void SetItemSubTextStyle(const struct FFSelectionItemTextStyle& InItemSubTextStyle);
	void SetItemImage(class UTexture2D* InItemImg);
	void GetItemStyle(struct FCheckBoxStyle* ItemStyle_0);
	void GetItemTextStyle(struct FFSelectionItemTextStyle* TextStyle);
	void GetItemSubTextStyle(struct FFSelectionItemTextStyle* TextStyle);
	void SetItemText(const class FText& InText);
	void SetItemSubText(const class FText& InText);
	void GetItemText(class FText* Text_0);
	void GetItemSubText(class FText* Text_0);
	void SetItemMinDimensions(int32 InMinWidth, int32 InMinHeight);
	void GetItemMinWidth(int32* MinWidth);
	void GetItemMinHeight(int32* MinHeight);
	void InternalRefreshDimensions();
	void GetBrushWithImageTexture(struct FSlateBrush& Brush, class UTexture2D* Image, struct FSlateBrush* UpdatedBrush);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CreateGameSelectionListEntry_C">();
	}
	static class UWBP_CreateGameSelectionListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CreateGameSelectionListEntry_C>();
	}
};
static_assert(alignof(UWBP_CreateGameSelectionListEntry_C) == 0x000008, "Wrong alignment on UWBP_CreateGameSelectionListEntry_C");
static_assert(sizeof(UWBP_CreateGameSelectionListEntry_C) == 0x000A98, "Wrong size on UWBP_CreateGameSelectionListEntry_C");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, UberGraphFrame) == 0x000230, "Member 'UWBP_CreateGameSelectionListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, ItemBg) == 0x000238, "Member 'UWBP_CreateGameSelectionListEntry_C::ItemBg' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, ItemBox) == 0x000240, "Member 'UWBP_CreateGameSelectionListEntry_C::ItemBox' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, ItemCheckBox) == 0x000248, "Member 'UWBP_CreateGameSelectionListEntry_C::ItemCheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, ItemSelectionHighlight) == 0x000250, "Member 'UWBP_CreateGameSelectionListEntry_C::ItemSelectionHighlight' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, ItemSubText) == 0x000258, "Member 'UWBP_CreateGameSelectionListEntry_C::ItemSubText' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, ItemText) == 0x000260, "Member 'UWBP_CreateGameSelectionListEntry_C::ItemText' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, OnSelectionStateChanged) == 0x000268, "Member 'UWBP_CreateGameSelectionListEntry_C::OnSelectionStateChanged' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, ItemStyle) == 0x000278, "Member 'UWBP_CreateGameSelectionListEntry_C::ItemStyle' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, ItemTextStyle) == 0x0007F8, "Member 'UWBP_CreateGameSelectionListEntry_C::ItemTextStyle' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, ItemSubTextStyle) == 0x000928, "Member 'UWBP_CreateGameSelectionListEntry_C::ItemSubTextStyle' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, ItemMinWidth) == 0x000A58, "Member 'UWBP_CreateGameSelectionListEntry_C::ItemMinWidth' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, Text) == 0x000A60, "Member 'UWBP_CreateGameSelectionListEntry_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, SubText) == 0x000A78, "Member 'UWBP_CreateGameSelectionListEntry_C::SubText' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, ItemMinHeight) == 0x000A90, "Member 'UWBP_CreateGameSelectionListEntry_C::ItemMinHeight' has a wrong offset!");
static_assert(offsetof(UWBP_CreateGameSelectionListEntry_C, bSelectionToggle) == 0x000A94, "Member 'UWBP_CreateGameSelectionListEntry_C::bSelectionToggle' has a wrong offset!");

}

