#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUDElement_TextChat_OutputListing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUDElement_TextChat_OutputListing.WBP_HUDElement_TextChat_OutputListing_C
// 0x0080 (0x02B0 - 0x0230)
class UWBP_HUDElement_TextChat_OutputListing_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         MsgContentText;                                    // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextChat_MsgPrefix_C*              MsgPrefix;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHDTextChatMsgInfo*                     ChatMsg;                                           // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MsgLifeTime;                                       // 0x0258(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            EnemyMsgColor;                                     // 0x0260(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateColor                            FriendlyMsgColor;                                  // 0x0288(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void ExecuteUbergraph_WBP_HUDElement_TextChat_OutputListing(int32 EntryPoint);
	void SetupListing(class UHDTextChatMsgInfo* Msg);
	void OnInitialized();
	void LifetimeExpired();
	void Finished_54BC5F4D4E481384960AD59474319862();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUDElement_TextChat_OutputListing_C">();
	}
	static class UWBP_HUDElement_TextChat_OutputListing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUDElement_TextChat_OutputListing_C>();
	}
};
static_assert(alignof(UWBP_HUDElement_TextChat_OutputListing_C) == 0x000008, "Wrong alignment on UWBP_HUDElement_TextChat_OutputListing_C");
static_assert(sizeof(UWBP_HUDElement_TextChat_OutputListing_C) == 0x0002B0, "Wrong size on UWBP_HUDElement_TextChat_OutputListing_C");
static_assert(offsetof(UWBP_HUDElement_TextChat_OutputListing_C, UberGraphFrame) == 0x000230, "Member 'UWBP_HUDElement_TextChat_OutputListing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_OutputListing_C, FadeOutAnim) == 0x000238, "Member 'UWBP_HUDElement_TextChat_OutputListing_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_OutputListing_C, MsgContentText) == 0x000240, "Member 'UWBP_HUDElement_TextChat_OutputListing_C::MsgContentText' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_OutputListing_C, MsgPrefix) == 0x000248, "Member 'UWBP_HUDElement_TextChat_OutputListing_C::MsgPrefix' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_OutputListing_C, ChatMsg) == 0x000250, "Member 'UWBP_HUDElement_TextChat_OutputListing_C::ChatMsg' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_OutputListing_C, MsgLifeTime) == 0x000258, "Member 'UWBP_HUDElement_TextChat_OutputListing_C::MsgLifeTime' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_OutputListing_C, EnemyMsgColor) == 0x000260, "Member 'UWBP_HUDElement_TextChat_OutputListing_C::EnemyMsgColor' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_OutputListing_C, FriendlyMsgColor) == 0x000288, "Member 'UWBP_HUDElement_TextChat_OutputListing_C::FriendlyMsgColor' has a wrong offset!");

}

