#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Confirmation

#include "Basic.hpp"

#include "HDMain_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Confirmation.WBP_Confirmation_C
// 0x0018 (0x0268 - 0x0250)
class UWBP_Confirmation_C final : public UHDConfirmationDialog
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         DescriptionRichText;                               // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Confirmation(int32 EntryPoint);
	void UpdateDialogText(const class FText& TitleText_0, const class FText& DescriptionText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Confirmation_C">();
	}
	static class UWBP_Confirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Confirmation_C>();
	}
};
static_assert(alignof(UWBP_Confirmation_C) == 0x000008, "Wrong alignment on UWBP_Confirmation_C");
static_assert(sizeof(UWBP_Confirmation_C) == 0x000268, "Wrong size on UWBP_Confirmation_C");
static_assert(offsetof(UWBP_Confirmation_C, UberGraphFrame) == 0x000250, "Member 'UWBP_Confirmation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Confirmation_C, DescriptionRichText) == 0x000258, "Member 'UWBP_Confirmation_C::DescriptionRichText' has a wrong offset!");
static_assert(offsetof(UWBP_Confirmation_C, TitleText) == 0x000260, "Member 'UWBP_Confirmation_C::TitleText' has a wrong offset!");

}

