#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeployMenu_SpawnMapView

#include "Basic.hpp"

#include "Tinkerbox_structs.hpp"


namespace SDK::Params
{

// Function WBP_DeployMenu_SpawnMapView.WBP_DeployMenu_SpawnMapView_C.OnSpawnPointSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DeployMenu_SpawnMapView_C_OnSpawnPointSelected__DelegateSignature final
{
public:
	class AActor*                                 POISpawnPointActor;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMapView_C_OnSpawnPointSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMapView_C_OnSpawnPointSelected__DelegateSignature");
static_assert(sizeof(WBP_DeployMenu_SpawnMapView_C_OnSpawnPointSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_DeployMenu_SpawnMapView_C_OnSpawnPointSelected__DelegateSignature");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_OnSpawnPointSelected__DelegateSignature, POISpawnPointActor) == 0x000000, "Member 'WBP_DeployMenu_SpawnMapView_C_OnSpawnPointSelected__DelegateSignature::POISpawnPointActor' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMapView.WBP_DeployMenu_SpawnMapView_C.ExecuteUbergraph_WBP_DeployMenu_SpawnMapView
// 0x0020 (0x0020 - 0x0000)
struct WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_POISpawnPointActor;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_POISpawnPointActor_1;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView");
static_assert(sizeof(WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView) == 0x000020, "Wrong size on WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView, EntryPoint) == 0x000000, "Member 'WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView, K2Node_ComponentBoundEvent_POISpawnPointActor) == 0x000008, "Member 'WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView::K2Node_ComponentBoundEvent_POISpawnPointActor' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView, K2Node_ComponentBoundEvent_POISpawnPointActor_1) == 0x000018, "Member 'WBP_DeployMenu_SpawnMapView_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMapView::K2Node_ComponentBoundEvent_POISpawnPointActor_1' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMapView.WBP_DeployMenu_SpawnMapView_C.BndEvt__Minimap_K2Node_ComponentBoundEvent_2_OnSpawnPointDeselected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_2_OnSpawnPointDeselected__DelegateSignature final
{
public:
	class AActor*                                 POISpawnPointActor;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_2_OnSpawnPointDeselected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_2_OnSpawnPointDeselected__DelegateSignature");
static_assert(sizeof(WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_2_OnSpawnPointDeselected__DelegateSignature) == 0x000008, "Wrong size on WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_2_OnSpawnPointDeselected__DelegateSignature");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_2_OnSpawnPointDeselected__DelegateSignature, POISpawnPointActor) == 0x000000, "Member 'WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_2_OnSpawnPointDeselected__DelegateSignature::POISpawnPointActor' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMapView.WBP_DeployMenu_SpawnMapView_C.BndEvt__Minimap_K2Node_ComponentBoundEvent_0_OnSpawnPointSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_0_OnSpawnPointSelected__DelegateSignature final
{
public:
	class AActor*                                 POISpawnPointActor;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_0_OnSpawnPointSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_0_OnSpawnPointSelected__DelegateSignature");
static_assert(sizeof(WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_0_OnSpawnPointSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_0_OnSpawnPointSelected__DelegateSignature");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_0_OnSpawnPointSelected__DelegateSignature, POISpawnPointActor) == 0x000000, "Member 'WBP_DeployMenu_SpawnMapView_C_BndEvt__Minimap_K2Node_ComponentBoundEvent_0_OnSpawnPointSelected__DelegateSignature::POISpawnPointActor' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMapView.WBP_DeployMenu_SpawnMapView_C.PreloadContent
// 0x0060 (0x0060 - 0x0000)
struct WBP_DeployMenu_SpawnMapView_C_PreloadContent final
{
public:
	bool                                          CallFunc_GetMinimapData_bSuccess;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetMinimapData_MinimapImg;                // 0x0008(0x0028)(HasGetValueTypeHash)
	struct FMinimapGenerationSettings             CallFunc_GetMinimapData_MinimapSettings;           // 0x0030(0x0028)(NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_SpawnMapView_C_PreloadContent) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMapView_C_PreloadContent");
static_assert(sizeof(WBP_DeployMenu_SpawnMapView_C_PreloadContent) == 0x000060, "Wrong size on WBP_DeployMenu_SpawnMapView_C_PreloadContent");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_PreloadContent, CallFunc_GetMinimapData_bSuccess) == 0x000000, "Member 'WBP_DeployMenu_SpawnMapView_C_PreloadContent::CallFunc_GetMinimapData_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_PreloadContent, CallFunc_GetMinimapData_MinimapImg) == 0x000008, "Member 'WBP_DeployMenu_SpawnMapView_C_PreloadContent::CallFunc_GetMinimapData_MinimapImg' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_PreloadContent, CallFunc_GetMinimapData_MinimapSettings) == 0x000030, "Member 'WBP_DeployMenu_SpawnMapView_C_PreloadContent::CallFunc_GetMinimapData_MinimapSettings' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_PreloadContent, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000058, "Member 'WBP_DeployMenu_SpawnMapView_C_PreloadContent::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMapView.WBP_DeployMenu_SpawnMapView_C.GetMinimapData
// 0x0070 (0x0070 - 0x0000)
struct WBP_DeployMenu_SpawnMapView_C_GetMinimapData final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              MinimapImg;                                        // 0x0008(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	struct FMinimapGenerationSettings             MinimapSettings;                                   // 0x0030(0x0028)(Parm, OutParm, NoDestructor)
	class AWorldSettings*                         CallFunc_GetWorldSettings_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATBWorldSettings*                       K2Node_DynamicCast_AsTBWorld_Settings;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_SpawnMapView_C_GetMinimapData) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMapView_C_GetMinimapData");
static_assert(sizeof(WBP_DeployMenu_SpawnMapView_C_GetMinimapData) == 0x000070, "Wrong size on WBP_DeployMenu_SpawnMapView_C_GetMinimapData");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_GetMinimapData, bSuccess) == 0x000000, "Member 'WBP_DeployMenu_SpawnMapView_C_GetMinimapData::bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_GetMinimapData, MinimapImg) == 0x000008, "Member 'WBP_DeployMenu_SpawnMapView_C_GetMinimapData::MinimapImg' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_GetMinimapData, MinimapSettings) == 0x000030, "Member 'WBP_DeployMenu_SpawnMapView_C_GetMinimapData::MinimapSettings' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_GetMinimapData, CallFunc_GetWorldSettings_ReturnValue) == 0x000058, "Member 'WBP_DeployMenu_SpawnMapView_C_GetMinimapData::CallFunc_GetWorldSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_GetMinimapData, K2Node_DynamicCast_AsTBWorld_Settings) == 0x000060, "Member 'WBP_DeployMenu_SpawnMapView_C_GetMinimapData::K2Node_DynamicCast_AsTBWorld_Settings' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMapView_C_GetMinimapData, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_DeployMenu_SpawnMapView_C_GetMinimapData::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

