#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameModifierSettingsSection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameModifierSettingsSection.WBP_GameModifierSettingsSection_C
// 0x0070 (0x02A0 - 0x0230)
class UWBP_GameModifierSettingsSection_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             Content;                                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              SectionActiveToggleChkBox;                         // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SectionExpansionArrow;                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SectionExpansionToggleBtn;                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SectionTitleText;                                  // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TitleText;                                         // 0x0260(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bShowToggleBtn;                                    // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bExpanded;                                         // 0x0279(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bActive;                                           // 0x027A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_27B[0x5];                                      // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnActivated;                                       // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnDeactivated;                                     // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnActivated__DelegateSignature();
	void OnDeactivated__DelegateSignature();
	void ExecuteUbergraph_WBP_GameModifierSettingsSection(int32 EntryPoint);
	void BndEvt__SectionActiveToggleChkBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__SectionExpansionToggleBtn_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void SetTitleText(const class FText& InTitleText);
	void SetExpansionState(bool bExpanded_0);
	void SetIsActive(bool bActive_0);
	void GetTitleText(class FText* TitleText_0);
	void IsExpanded(bool* bExpanded_0);
	void IsActive(bool* bActive_0);
	void InternalRecursiveSetContentIsEnabled(bool bInIsEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameModifierSettingsSection_C">();
	}
	static class UWBP_GameModifierSettingsSection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameModifierSettingsSection_C>();
	}
};
static_assert(alignof(UWBP_GameModifierSettingsSection_C) == 0x000008, "Wrong alignment on UWBP_GameModifierSettingsSection_C");
static_assert(sizeof(UWBP_GameModifierSettingsSection_C) == 0x0002A0, "Wrong size on UWBP_GameModifierSettingsSection_C");
static_assert(offsetof(UWBP_GameModifierSettingsSection_C, UberGraphFrame) == 0x000230, "Member 'UWBP_GameModifierSettingsSection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameModifierSettingsSection_C, Content) == 0x000238, "Member 'UWBP_GameModifierSettingsSection_C::Content' has a wrong offset!");
static_assert(offsetof(UWBP_GameModifierSettingsSection_C, SectionActiveToggleChkBox) == 0x000240, "Member 'UWBP_GameModifierSettingsSection_C::SectionActiveToggleChkBox' has a wrong offset!");
static_assert(offsetof(UWBP_GameModifierSettingsSection_C, SectionExpansionArrow) == 0x000248, "Member 'UWBP_GameModifierSettingsSection_C::SectionExpansionArrow' has a wrong offset!");
static_assert(offsetof(UWBP_GameModifierSettingsSection_C, SectionExpansionToggleBtn) == 0x000250, "Member 'UWBP_GameModifierSettingsSection_C::SectionExpansionToggleBtn' has a wrong offset!");
static_assert(offsetof(UWBP_GameModifierSettingsSection_C, SectionTitleText) == 0x000258, "Member 'UWBP_GameModifierSettingsSection_C::SectionTitleText' has a wrong offset!");
static_assert(offsetof(UWBP_GameModifierSettingsSection_C, TitleText) == 0x000260, "Member 'UWBP_GameModifierSettingsSection_C::TitleText' has a wrong offset!");
static_assert(offsetof(UWBP_GameModifierSettingsSection_C, bShowToggleBtn) == 0x000278, "Member 'UWBP_GameModifierSettingsSection_C::bShowToggleBtn' has a wrong offset!");
static_assert(offsetof(UWBP_GameModifierSettingsSection_C, bExpanded) == 0x000279, "Member 'UWBP_GameModifierSettingsSection_C::bExpanded' has a wrong offset!");
static_assert(offsetof(UWBP_GameModifierSettingsSection_C, bActive) == 0x00027A, "Member 'UWBP_GameModifierSettingsSection_C::bActive' has a wrong offset!");
static_assert(offsetof(UWBP_GameModifierSettingsSection_C, OnActivated) == 0x000280, "Member 'UWBP_GameModifierSettingsSection_C::OnActivated' has a wrong offset!");
static_assert(offsetof(UWBP_GameModifierSettingsSection_C, OnDeactivated) == 0x000290, "Member 'UWBP_GameModifierSettingsSection_C::OnDeactivated' has a wrong offset!");

}

