#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModifierSetting_Numeric

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_OnValueChanged__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_ModifierSetting_Numeric_C_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_OnValueChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_ModifierSetting_Numeric_C_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_OnValueChanged__DelegateSignature, InValue) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_OnValueChanged__DelegateSignature::InValue' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.OnValueCommitted__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_OnValueCommitted__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextCommit                                   CommitMethod;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_OnValueCommitted__DelegateSignature) == 0x000004, "Wrong alignment on WBP_ModifierSetting_Numeric_C_OnValueCommitted__DelegateSignature");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_OnValueCommitted__DelegateSignature) == 0x000008, "Wrong size on WBP_ModifierSetting_Numeric_C_OnValueCommitted__DelegateSignature");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_OnValueCommitted__DelegateSignature, InValue) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_OnValueCommitted__DelegateSignature::InValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_OnValueCommitted__DelegateSignature, CommitMethod) == 0x000004, "Member 'WBP_ModifierSetting_Numeric_C_OnValueCommitted__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.ExecuteUbergraph_WBP_ModifierSetting_Numeric
// 0x0050 (0x0050 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0028(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_InValue_1;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric) == 0x000008, "Wrong alignment on WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric) == 0x000050, "Wrong size on WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric, EntryPoint) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric, Temp_bool_Variable) == 0x000004, "Member 'WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric, Temp_text_Variable) == 0x000008, "Member 'WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric, CallFunc_TextIsEmpty_ReturnValue) == 0x000020, "Member 'WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric, K2Node_Select_Default) == 0x000028, "Member 'WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric, K2Node_Event_IsDesignTime) == 0x000040, "Member 'WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric, K2Node_ComponentBoundEvent_InValue_1) == 0x000044, "Member 'WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric::K2Node_ComponentBoundEvent_InValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric, K2Node_ComponentBoundEvent_InValue) == 0x000048, "Member 'WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric::K2Node_ComponentBoundEvent_InValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric, K2Node_ComponentBoundEvent_CommitMethod) == 0x00004C, "Member 'WBP_ModifierSetting_Numeric_C_ExecuteUbergraph_WBP_ModifierSetting_Numeric::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_1_OnSpinBoxValueCommittedEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_1_OnSpinBoxValueCommittedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextCommit                                   CommitMethod;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_1_OnSpinBoxValueCommittedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_1_OnSpinBoxValueCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_1_OnSpinBoxValueCommittedEvent__DelegateSignature) == 0x000008, "Wrong size on WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_1_OnSpinBoxValueCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_1_OnSpinBoxValueCommittedEvent__DelegateSignature, InValue) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_1_OnSpinBoxValueCommittedEvent__DelegateSignature::InValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_1_OnSpinBoxValueCommittedEvent__DelegateSignature, CommitMethod) == 0x000004, "Member 'WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_1_OnSpinBoxValueCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_BndEvt__NumericSpinBox_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModifierSetting_Numeric_C_PreConstruct");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModifierSetting_Numeric_C_PreConstruct");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.SetSettingText
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_SetSettingText final
{
public:
	class FText                                   InSettingText;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_SetSettingText) == 0x000008, "Wrong alignment on WBP_ModifierSetting_Numeric_C_SetSettingText");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_SetSettingText) == 0x000018, "Wrong size on WBP_ModifierSetting_Numeric_C_SetSettingText");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_SetSettingText, InSettingText) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_SetSettingText::InSettingText' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.GetSettingText
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_GetSettingText final
{
public:
	class FText                                   SettingText_0;                                     // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_GetSettingText) == 0x000008, "Wrong alignment on WBP_ModifierSetting_Numeric_C_GetSettingText");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_GetSettingText) == 0x000018, "Wrong size on WBP_ModifierSetting_Numeric_C_GetSettingText");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_GetSettingText, SettingText_0) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_GetSettingText::SettingText_0' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.SetMagicValueText
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_SetMagicValueText final
{
public:
	class FText                                   InMagicValueText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_SetMagicValueText) == 0x000008, "Wrong alignment on WBP_ModifierSetting_Numeric_C_SetMagicValueText");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_SetMagicValueText) == 0x000018, "Wrong size on WBP_ModifierSetting_Numeric_C_SetMagicValueText");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_SetMagicValueText, InMagicValueText) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_SetMagicValueText::InMagicValueText' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.GetMagicValueText
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_GetMagicValueText final
{
public:
	class FText                                   MagicValueText_0;                                  // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_GetMagicValueText) == 0x000008, "Wrong alignment on WBP_ModifierSetting_Numeric_C_GetMagicValueText");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_GetMagicValueText) == 0x000018, "Wrong size on WBP_ModifierSetting_Numeric_C_GetMagicValueText");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_GetMagicValueText, MagicValueText_0) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_GetMagicValueText::MagicValueText_0' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.SetValue
// 0x0004 (0x0004 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_SetValue final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_SetValue) == 0x000004, "Wrong alignment on WBP_ModifierSetting_Numeric_C_SetValue");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_SetValue) == 0x000004, "Wrong size on WBP_ModifierSetting_Numeric_C_SetValue");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_SetValue, InValue) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_SetValue::InValue' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.GetValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_GetValue final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_GetValue) == 0x000004, "Wrong alignment on WBP_ModifierSetting_Numeric_C_GetValue");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_GetValue) == 0x000008, "Wrong size on WBP_ModifierSetting_Numeric_C_GetValue");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_GetValue, Value) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_GetValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_GetValue, CallFunc_GetValue_ReturnValue) == 0x000004, "Member 'WBP_ModifierSetting_Numeric_C_GetValue::CallFunc_GetValue_ReturnValue' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.SetValueSnapDelta
// 0x000C (0x000C - 0x0000)
struct WBP_ModifierSetting_Numeric_C_SetValueSnapDelta final
{
public:
	float                                         InDelta;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDelta_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_SetValueSnapDelta) == 0x000004, "Wrong alignment on WBP_ModifierSetting_Numeric_C_SetValueSnapDelta");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_SetValueSnapDelta) == 0x00000C, "Wrong size on WBP_ModifierSetting_Numeric_C_SetValueSnapDelta");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_SetValueSnapDelta, InDelta) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_SetValueSnapDelta::InDelta' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_SetValueSnapDelta, CallFunc_GetDelta_ReturnValue) == 0x000004, "Member 'WBP_ModifierSetting_Numeric_C_SetValueSnapDelta::CallFunc_GetDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_SetValueSnapDelta, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'WBP_ModifierSetting_Numeric_C_SetValueSnapDelta::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.GetValueSnapDelta
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_GetValueSnapDelta final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDelta_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_GetValueSnapDelta) == 0x000004, "Wrong alignment on WBP_ModifierSetting_Numeric_C_GetValueSnapDelta");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_GetValueSnapDelta) == 0x000008, "Wrong size on WBP_ModifierSetting_Numeric_C_GetValueSnapDelta");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_GetValueSnapDelta, Delta) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_GetValueSnapDelta::Delta' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_GetValueSnapDelta, CallFunc_GetDelta_ReturnValue) == 0x000004, "Member 'WBP_ModifierSetting_Numeric_C_GetValueSnapDelta::CallFunc_GetDelta_ReturnValue' has a wrong offset!");

// Function WBP_ModifierSetting_Numeric.WBP_ModifierSetting_Numeric_C.UpdateMagicValueState
// 0x0090 (0x0090 - 0x0000)
struct WBP_ModifierSetting_Numeric_C_UpdateMagicValueState final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0028(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0018)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x0060(0x0028)()
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState) == 0x000008, "Wrong alignment on WBP_ModifierSetting_Numeric_C_UpdateMagicValueState");
static_assert(sizeof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState) == 0x000090, "Wrong size on WBP_ModifierSetting_Numeric_C_UpdateMagicValueState");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState, Temp_bool_Variable) == 0x000000, "Member 'WBP_ModifierSetting_Numeric_C_UpdateMagicValueState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState, Temp_byte_Variable) == 0x000001, "Member 'WBP_ModifierSetting_Numeric_C_UpdateMagicValueState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_ModifierSetting_Numeric_C_UpdateMagicValueState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_ModifierSetting_Numeric_C_UpdateMagicValueState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState, Temp_text_Variable) == 0x000008, "Member 'WBP_ModifierSetting_Numeric_C_UpdateMagicValueState::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState, Temp_bool_Variable_2) == 0x000020, "Member 'WBP_ModifierSetting_Numeric_C_UpdateMagicValueState::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState, CallFunc_GetValue_ReturnValue) == 0x000024, "Member 'WBP_ModifierSetting_Numeric_C_UpdateMagicValueState::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState, CallFunc_Map_Find_Value) == 0x000028, "Member 'WBP_ModifierSetting_Numeric_C_UpdateMagicValueState::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'WBP_ModifierSetting_Numeric_C_UpdateMagicValueState::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState, K2Node_Select_Default) == 0x000048, "Member 'WBP_ModifierSetting_Numeric_C_UpdateMagicValueState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState, K2Node_Select_Default_1) == 0x000060, "Member 'WBP_ModifierSetting_Numeric_C_UpdateMagicValueState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_Numeric_C_UpdateMagicValueState, K2Node_Select_Default_2) == 0x000088, "Member 'WBP_ModifierSetting_Numeric_C_UpdateMagicValueState::K2Node_Select_Default_2' has a wrong offset!");

}

