#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MobilityStatusBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MobilityStatusBar.WBP_MobilityStatusBar_C.ExecuteUbergraph_WBP_MobilityStatusBar
// 0x0010 (0x0010 - 0x0000)
struct WBP_MobilityStatusBar_C_ExecuteUbergraph_WBP_MobilityStatusBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MobilityStatusBar_C_ExecuteUbergraph_WBP_MobilityStatusBar) == 0x000008, "Wrong alignment on WBP_MobilityStatusBar_C_ExecuteUbergraph_WBP_MobilityStatusBar");
static_assert(sizeof(WBP_MobilityStatusBar_C_ExecuteUbergraph_WBP_MobilityStatusBar) == 0x000010, "Wrong size on WBP_MobilityStatusBar_C_ExecuteUbergraph_WBP_MobilityStatusBar");
static_assert(offsetof(WBP_MobilityStatusBar_C_ExecuteUbergraph_WBP_MobilityStatusBar, EntryPoint) == 0x000000, "Member 'WBP_MobilityStatusBar_C_ExecuteUbergraph_WBP_MobilityStatusBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MobilityStatusBar_C_ExecuteUbergraph_WBP_MobilityStatusBar, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_MobilityStatusBar_C_ExecuteUbergraph_WBP_MobilityStatusBar::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_MobilityStatusBar.WBP_MobilityStatusBar_C.SetPercent
// 0x0008 (0x0008 - 0x0000)
struct WBP_MobilityStatusBar_C_SetPercent final
{
public:
	float                                         InPercent;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitial;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_MobilityStatusBar_C_SetPercent) == 0x000004, "Wrong alignment on WBP_MobilityStatusBar_C_SetPercent");
static_assert(sizeof(WBP_MobilityStatusBar_C_SetPercent) == 0x000008, "Wrong size on WBP_MobilityStatusBar_C_SetPercent");
static_assert(offsetof(WBP_MobilityStatusBar_C_SetPercent, InPercent) == 0x000000, "Member 'WBP_MobilityStatusBar_C_SetPercent::InPercent' has a wrong offset!");
static_assert(offsetof(WBP_MobilityStatusBar_C_SetPercent, bInitial) == 0x000004, "Member 'WBP_MobilityStatusBar_C_SetPercent::bInitial' has a wrong offset!");
static_assert(offsetof(WBP_MobilityStatusBar_C_SetPercent, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_MobilityStatusBar_C_SetPercent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MobilityStatusBar_C_SetPercent, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000006, "Member 'WBP_MobilityStatusBar_C_SetPercent::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MobilityStatusBar_C_SetPercent, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'WBP_MobilityStatusBar_C_SetPercent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

