#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUDElement_TextChat_InputHandler

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUDElement_TextChat_InputHandler.WBP_HUDElement_TextChat_InputHandler_C.OnInputTextCommitted__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUDElement_TextChat_InputHandler_C_OnInputTextCommitted__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDElement_TextChat_InputHandler_C_OnInputTextCommitted__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HUDElement_TextChat_InputHandler_C_OnInputTextCommitted__DelegateSignature");
static_assert(sizeof(WBP_HUDElement_TextChat_InputHandler_C_OnInputTextCommitted__DelegateSignature) == 0x000020, "Wrong size on WBP_HUDElement_TextChat_InputHandler_C_OnInputTextCommitted__DelegateSignature");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_OnInputTextCommitted__DelegateSignature, Text) == 0x000000, "Member 'WBP_HUDElement_TextChat_InputHandler_C_OnInputTextCommitted__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_OnInputTextCommitted__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_HUDElement_TextChat_InputHandler_C_OnInputTextCommitted__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_HUDElement_TextChat_InputHandler.WBP_HUDElement_TextChat_InputHandler_C.ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler
// 0x0130 (0x0130 - 0x0000)
struct WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0008(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFCommChannel*                         K2Node_Event_CurrentChannel;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFCommChannel*                         K2Node_Event_NewTalkChannel;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetChannelDisplayName_ReturnValue;        // 0x0040(0x0018)()
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0058(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F8(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0110(0x0018)()
	bool                                          CallFunc_TextIsEmptyOrWhitespace_ReturnValue;      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler) == 0x000008, "Wrong alignment on WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler");
static_assert(sizeof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler) == 0x000130, "Wrong size on WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, EntryPoint) == 0x000000, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, K2Node_ComponentBoundEvent_Text) == 0x000008, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, K2Node_ComponentBoundEvent_CommitMethod) == 0x000020, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, K2Node_Event_CurrentChannel) == 0x000028, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::K2Node_Event_CurrentChannel' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, K2Node_Event_NewTalkChannel) == 0x000038, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::K2Node_Event_NewTalkChannel' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, CallFunc_GetChannelDisplayName_ReturnValue) == 0x000040, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::CallFunc_GetChannelDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, K2Node_CustomEvent_Text) == 0x000058, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B0, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, K2Node_MakeArray_Array) == 0x0000C0, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, CallFunc_Left_ReturnValue) == 0x0000D0, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F8, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, CallFunc_TextToUpper_ReturnValue) == 0x000110, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler, CallFunc_TextIsEmptyOrWhitespace_ReturnValue) == 0x000128, "Member 'WBP_HUDElement_TextChat_InputHandler_C_ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler::CallFunc_TextIsEmptyOrWhitespace_ReturnValue' has a wrong offset!");

// Function WBP_HUDElement_TextChat_InputHandler.WBP_HUDElement_TextChat_InputHandler_C.BndEvt__MsgInputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUDElement_TextChat_InputHandler_C_BndEvt__MsgInputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDElement_TextChat_InputHandler_C_BndEvt__MsgInputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HUDElement_TextChat_InputHandler_C_BndEvt__MsgInputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_HUDElement_TextChat_InputHandler_C_BndEvt__MsgInputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_HUDElement_TextChat_InputHandler_C_BndEvt__MsgInputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_BndEvt__MsgInputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_HUDElement_TextChat_InputHandler_C_BndEvt__MsgInputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_BndEvt__MsgInputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_HUDElement_TextChat_InputHandler_C_BndEvt__MsgInputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_HUDElement_TextChat_InputHandler.WBP_HUDElement_TextChat_InputHandler_C.InputTextEntered
// 0x0018 (0x0018 - 0x0000)
struct WBP_HUDElement_TextChat_InputHandler_C_InputTextEntered final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_HUDElement_TextChat_InputHandler_C_InputTextEntered) == 0x000008, "Wrong alignment on WBP_HUDElement_TextChat_InputHandler_C_InputTextEntered");
static_assert(sizeof(WBP_HUDElement_TextChat_InputHandler_C_InputTextEntered) == 0x000018, "Wrong size on WBP_HUDElement_TextChat_InputHandler_C_InputTextEntered");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_InputTextEntered, Text) == 0x000000, "Member 'WBP_HUDElement_TextChat_InputHandler_C_InputTextEntered::Text' has a wrong offset!");

// Function WBP_HUDElement_TextChat_InputHandler.WBP_HUDElement_TextChat_InputHandler_C.StopTalking
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUDElement_TextChat_InputHandler_C_StopTalking final
{
public:
	class UDFCommChannel*                         CurrentChannel_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDElement_TextChat_InputHandler_C_StopTalking) == 0x000008, "Wrong alignment on WBP_HUDElement_TextChat_InputHandler_C_StopTalking");
static_assert(sizeof(WBP_HUDElement_TextChat_InputHandler_C_StopTalking) == 0x000008, "Wrong size on WBP_HUDElement_TextChat_InputHandler_C_StopTalking");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_StopTalking, CurrentChannel_0) == 0x000000, "Member 'WBP_HUDElement_TextChat_InputHandler_C_StopTalking::CurrentChannel_0' has a wrong offset!");

// Function WBP_HUDElement_TextChat_InputHandler.WBP_HUDElement_TextChat_InputHandler_C.StartTalking
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUDElement_TextChat_InputHandler_C_StartTalking final
{
public:
	class UDFCommChannel*                         NewTalkChannel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDElement_TextChat_InputHandler_C_StartTalking) == 0x000008, "Wrong alignment on WBP_HUDElement_TextChat_InputHandler_C_StartTalking");
static_assert(sizeof(WBP_HUDElement_TextChat_InputHandler_C_StartTalking) == 0x000008, "Wrong size on WBP_HUDElement_TextChat_InputHandler_C_StartTalking");
static_assert(offsetof(WBP_HUDElement_TextChat_InputHandler_C_StartTalking, NewTalkChannel) == 0x000000, "Member 'WBP_HUDElement_TextChat_InputHandler_C_StartTalking::NewTalkChannel' has a wrong offset!");

}

