#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUDElement_TextChat_InputHandler

#include "Basic.hpp"

#include "HDMain_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUDElement_TextChat_InputHandler.WBP_HUDElement_TextChat_InputHandler_C
// 0x0030 (0x0270 - 0x0240)
class UWBP_HUDElement_TextChat_InputHandler_C final : public UHDTextChatInputWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ChannelNameText;                                   // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       MsgInputTextBox;                                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFCommChannel*                         CurrentChannel;                                    // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnInputTextCommitted;                              // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnInputTextCommitted__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void ExecuteUbergraph_WBP_HUDElement_TextChat_InputHandler(int32 EntryPoint);
	void BndEvt__MsgInputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void InputTextEntered(const class FText& Text);
	void StopTalking(class UDFCommChannel* CurrentChannel_0);
	void StartTalking(class UDFCommChannel* NewTalkChannel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUDElement_TextChat_InputHandler_C">();
	}
	static class UWBP_HUDElement_TextChat_InputHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUDElement_TextChat_InputHandler_C>();
	}
};
static_assert(alignof(UWBP_HUDElement_TextChat_InputHandler_C) == 0x000008, "Wrong alignment on UWBP_HUDElement_TextChat_InputHandler_C");
static_assert(sizeof(UWBP_HUDElement_TextChat_InputHandler_C) == 0x000270, "Wrong size on UWBP_HUDElement_TextChat_InputHandler_C");
static_assert(offsetof(UWBP_HUDElement_TextChat_InputHandler_C, UberGraphFrame) == 0x000240, "Member 'UWBP_HUDElement_TextChat_InputHandler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_InputHandler_C, ChannelNameText) == 0x000248, "Member 'UWBP_HUDElement_TextChat_InputHandler_C::ChannelNameText' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_InputHandler_C, MsgInputTextBox) == 0x000250, "Member 'UWBP_HUDElement_TextChat_InputHandler_C::MsgInputTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_InputHandler_C, CurrentChannel) == 0x000258, "Member 'UWBP_HUDElement_TextChat_InputHandler_C::CurrentChannel' has a wrong offset!");
static_assert(offsetof(UWBP_HUDElement_TextChat_InputHandler_C, OnInputTextCommitted) == 0x000260, "Member 'UWBP_HUDElement_TextChat_InputHandler_C::OnInputTextCommitted' has a wrong offset!");

}

