#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModifierSettingBox

#include "Basic.hpp"

#include "FModifierTextStyle_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModifierSettingBox.WBP_ModifierSettingBox_C.ExecuteUbergraph_WBP_ModifierSettingBox
// 0x0058 (0x0058 - 0x0000)
struct WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0028(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0040(0x0018)()
};
static_assert(alignof(WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox) == 0x000008, "Wrong alignment on WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox");
static_assert(sizeof(WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox) == 0x000058, "Wrong size on WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox");
static_assert(offsetof(WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox, EntryPoint) == 0x000000, "Member 'WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox, Temp_bool_Variable) == 0x000004, "Member 'WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox, Temp_text_Variable) == 0x000008, "Member 'WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox, CallFunc_TextIsEmpty_ReturnValue) == 0x000021, "Member 'WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox, K2Node_Select_Default) == 0x000028, "Member 'WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox, CallFunc_TextToUpper_ReturnValue) == 0x000040, "Member 'WBP_ModifierSettingBox_C_ExecuteUbergraph_WBP_ModifierSettingBox::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WBP_ModifierSettingBox.WBP_ModifierSettingBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModifierSettingBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ModifierSettingBox_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModifierSettingBox_C_PreConstruct");
static_assert(sizeof(WBP_ModifierSettingBox_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModifierSettingBox_C_PreConstruct");
static_assert(offsetof(WBP_ModifierSettingBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModifierSettingBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModifierSettingBox.WBP_ModifierSettingBox_C.SetSettingText
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModifierSettingBox_C_SetSettingText final
{
public:
	class FText                                   InSettingText;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(WBP_ModifierSettingBox_C_SetSettingText) == 0x000008, "Wrong alignment on WBP_ModifierSettingBox_C_SetSettingText");
static_assert(sizeof(WBP_ModifierSettingBox_C_SetSettingText) == 0x000030, "Wrong size on WBP_ModifierSettingBox_C_SetSettingText");
static_assert(offsetof(WBP_ModifierSettingBox_C_SetSettingText, InSettingText) == 0x000000, "Member 'WBP_ModifierSettingBox_C_SetSettingText::InSettingText' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSettingBox_C_SetSettingText, CallFunc_TextToUpper_ReturnValue) == 0x000018, "Member 'WBP_ModifierSettingBox_C_SetSettingText::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WBP_ModifierSettingBox.WBP_ModifierSettingBox_C.GetSettingText
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSettingBox_C_GetSettingText final
{
public:
	class FText                                   SettingText_0;                                     // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(WBP_ModifierSettingBox_C_GetSettingText) == 0x000008, "Wrong alignment on WBP_ModifierSettingBox_C_GetSettingText");
static_assert(sizeof(WBP_ModifierSettingBox_C_GetSettingText) == 0x000018, "Wrong size on WBP_ModifierSettingBox_C_GetSettingText");
static_assert(offsetof(WBP_ModifierSettingBox_C_GetSettingText, SettingText_0) == 0x000000, "Member 'WBP_ModifierSettingBox_C_GetSettingText::SettingText_0' has a wrong offset!");

// Function WBP_ModifierSettingBox.WBP_ModifierSettingBox_C.SetSettingTextStyle
// 0x0078 (0x0078 - 0x0000)
struct WBP_ModifierSettingBox_C_SetSettingTextStyle final
{
public:
	struct FFModifierTextStyle                    InSettingTextStyle;                                // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSettingBox_C_SetSettingTextStyle) == 0x000008, "Wrong alignment on WBP_ModifierSettingBox_C_SetSettingTextStyle");
static_assert(sizeof(WBP_ModifierSettingBox_C_SetSettingTextStyle) == 0x000078, "Wrong size on WBP_ModifierSettingBox_C_SetSettingTextStyle");
static_assert(offsetof(WBP_ModifierSettingBox_C_SetSettingTextStyle, InSettingTextStyle) == 0x000000, "Member 'WBP_ModifierSettingBox_C_SetSettingTextStyle::InSettingTextStyle' has a wrong offset!");

}

