#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModifierSetting_ComboBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModifierSetting_ComboBox.WBP_ModifierSetting_ComboBox_C.OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSetting_ComboBox_C_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_ComboBox_C_OnSelectionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModifierSetting_ComboBox_C_OnSelectionChanged__DelegateSignature");
static_assert(sizeof(WBP_ModifierSetting_ComboBox_C_OnSelectionChanged__DelegateSignature) == 0x000018, "Wrong size on WBP_ModifierSetting_ComboBox_C_OnSelectionChanged__DelegateSignature");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_OnSelectionChanged__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_ModifierSetting_ComboBox_C_OnSelectionChanged__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_OnSelectionChanged__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_ModifierSetting_ComboBox_C_OnSelectionChanged__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_ModifierSetting_ComboBox.WBP_ModifierSetting_ComboBox_C.ExecuteUbergraph_WBP_ModifierSetting_ComboBox
// 0x0080 (0x0080 - 0x0000)
struct WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox) == 0x000008, "Wrong alignment on WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox");
static_assert(sizeof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox) == 0x000080, "Wrong size on WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, EntryPoint) == 0x000000, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, CallFunc_TextIsEmpty_ReturnValue) == 0x000011, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, Temp_text_Variable) == 0x000030, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, K2Node_ComponentBoundEvent_SelectedItem) == 0x000048, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, K2Node_ComponentBoundEvent_SelectionType) == 0x000058, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, Temp_bool_Variable) == 0x000059, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, K2Node_Select_Default) == 0x000060, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x000078, "Member 'WBP_ModifierSetting_ComboBox_C_ExecuteUbergraph_WBP_ModifierSetting_ComboBox::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");

// Function WBP_ModifierSetting_ComboBox.WBP_ModifierSetting_ComboBox_C.BndEvt__ModifierComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSetting_ComboBox_C_BndEvt__ModifierComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModifierSetting_ComboBox_C_BndEvt__ModifierComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModifierSetting_ComboBox_C_BndEvt__ModifierComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_ModifierSetting_ComboBox_C_BndEvt__ModifierComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_ModifierSetting_ComboBox_C_BndEvt__ModifierComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_BndEvt__ModifierComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_ModifierSetting_ComboBox_C_BndEvt__ModifierComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_BndEvt__ModifierComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_ModifierSetting_ComboBox_C_BndEvt__ModifierComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_ModifierSetting_ComboBox.WBP_ModifierSetting_ComboBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModifierSetting_ComboBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ModifierSetting_ComboBox_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModifierSetting_ComboBox_C_PreConstruct");
static_assert(sizeof(WBP_ModifierSetting_ComboBox_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModifierSetting_ComboBox_C_PreConstruct");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModifierSetting_ComboBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModifierSetting_ComboBox.WBP_ModifierSetting_ComboBox_C.SetSettingText
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSetting_ComboBox_C_SetSettingText final
{
public:
	class FText                                   InSettingText;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModifierSetting_ComboBox_C_SetSettingText) == 0x000008, "Wrong alignment on WBP_ModifierSetting_ComboBox_C_SetSettingText");
static_assert(sizeof(WBP_ModifierSetting_ComboBox_C_SetSettingText) == 0x000018, "Wrong size on WBP_ModifierSetting_ComboBox_C_SetSettingText");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_SetSettingText, InSettingText) == 0x000000, "Member 'WBP_ModifierSetting_ComboBox_C_SetSettingText::InSettingText' has a wrong offset!");

// Function WBP_ModifierSetting_ComboBox.WBP_ModifierSetting_ComboBox_C.GetSettingText
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModifierSetting_ComboBox_C_GetSettingText final
{
public:
	class FText                                   SettingText_0;                                     // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(WBP_ModifierSetting_ComboBox_C_GetSettingText) == 0x000008, "Wrong alignment on WBP_ModifierSetting_ComboBox_C_GetSettingText");
static_assert(sizeof(WBP_ModifierSetting_ComboBox_C_GetSettingText) == 0x000018, "Wrong size on WBP_ModifierSetting_ComboBox_C_GetSettingText");
static_assert(offsetof(WBP_ModifierSetting_ComboBox_C_GetSettingText, SettingText_0) == 0x000000, "Member 'WBP_ModifierSetting_ComboBox_C_GetSettingText::SettingText_0' has a wrong offset!");

}

