#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CaptureStatus_FlagIcon

#include "Basic.hpp"

#include "HDMain_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CaptureStatus_FlagIcon.WBP_CaptureStatus_FlagIcon_C
// 0x04E8 (0x0718 - 0x0230)
class UWBP_CaptureStatus_FlagIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bg;                                                // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconFrame;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            IconFrameNoTeam;                                   // 0x0250(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            BgNoTeam;                                          // 0x02D8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            IconLocked;                                        // 0x0360(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            IconFlag;                                          // 0x03E8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            IconFrameEnemy;                                    // 0x0470(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         IconOpacityCapturable;                             // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IconOpacityUncapturable;                           // 0x04FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IconOpacityOffensive;                              // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            IconFrameFriendly;                                 // 0x0508(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            BgEnemy;                                           // 0x0590(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            BgFriendly;                                        // 0x0618(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ColorFriendly;                                     // 0x06A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ColorEnemy;                                        // 0x06C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ColorNoTeam;                                       // 0x06F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_CaptureStatus_FlagIcon(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnUpdateIcon(bool bActive, EHDTeam Team, bool bLocked, EHDControlPointObjectiveType ObjType);
	void SetBrushes(struct FSlateBrush& IconFrame_0, struct FSlateBrush& Bg_0, struct FSlateBrush& Icon_0);
	void UpdateBrushesByTeam(bool bLocked, EHDTeam Team, EHDControlPointObjectiveType ObjType);
	void TintBrushByTeam(struct FSlateBrush& BrushToTint, EHDTeam Team, struct FSlateBrush* NewBrush);
	void SetBrushOpacityByCaptureStatus(struct FSlateBrush& BrushToUpdate, bool bLocked, EHDControlPointObjectiveType ObjType, struct FSlateBrush* NewBrush);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CaptureStatus_FlagIcon_C">();
	}
	static class UWBP_CaptureStatus_FlagIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CaptureStatus_FlagIcon_C>();
	}
};
static_assert(alignof(UWBP_CaptureStatus_FlagIcon_C) == 0x000008, "Wrong alignment on UWBP_CaptureStatus_FlagIcon_C");
static_assert(sizeof(UWBP_CaptureStatus_FlagIcon_C) == 0x000718, "Wrong size on UWBP_CaptureStatus_FlagIcon_C");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, UberGraphFrame) == 0x000230, "Member 'UWBP_CaptureStatus_FlagIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, Bg) == 0x000238, "Member 'UWBP_CaptureStatus_FlagIcon_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, Icon) == 0x000240, "Member 'UWBP_CaptureStatus_FlagIcon_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, IconFrame) == 0x000248, "Member 'UWBP_CaptureStatus_FlagIcon_C::IconFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, IconFrameNoTeam) == 0x000250, "Member 'UWBP_CaptureStatus_FlagIcon_C::IconFrameNoTeam' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, BgNoTeam) == 0x0002D8, "Member 'UWBP_CaptureStatus_FlagIcon_C::BgNoTeam' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, IconLocked) == 0x000360, "Member 'UWBP_CaptureStatus_FlagIcon_C::IconLocked' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, IconFlag) == 0x0003E8, "Member 'UWBP_CaptureStatus_FlagIcon_C::IconFlag' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, IconFrameEnemy) == 0x000470, "Member 'UWBP_CaptureStatus_FlagIcon_C::IconFrameEnemy' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, IconOpacityCapturable) == 0x0004F8, "Member 'UWBP_CaptureStatus_FlagIcon_C::IconOpacityCapturable' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, IconOpacityUncapturable) == 0x0004FC, "Member 'UWBP_CaptureStatus_FlagIcon_C::IconOpacityUncapturable' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, IconOpacityOffensive) == 0x000500, "Member 'UWBP_CaptureStatus_FlagIcon_C::IconOpacityOffensive' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, IconFrameFriendly) == 0x000508, "Member 'UWBP_CaptureStatus_FlagIcon_C::IconFrameFriendly' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, BgEnemy) == 0x000590, "Member 'UWBP_CaptureStatus_FlagIcon_C::BgEnemy' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, BgFriendly) == 0x000618, "Member 'UWBP_CaptureStatus_FlagIcon_C::BgFriendly' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, ColorFriendly) == 0x0006A0, "Member 'UWBP_CaptureStatus_FlagIcon_C::ColorFriendly' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, ColorEnemy) == 0x0006C8, "Member 'UWBP_CaptureStatus_FlagIcon_C::ColorEnemy' has a wrong offset!");
static_assert(offsetof(UWBP_CaptureStatus_FlagIcon_C, ColorNoTeam) == 0x0006F0, "Member 'UWBP_CaptureStatus_FlagIcon_C::ColorNoTeam' has a wrong offset!");

}

