#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Toggle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Toggle.WBP_Toggle_C
// 0x0060 (0x0290 - 0x0230)
class UWBP_Toggle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_TextButton_C*                      OffBtn;                                            // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextButton_C*                      OnBtn;                                             // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bToggleOn;                                         // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             ToggleStateChanged;                                // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   OnText;                                            // 0x0260(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   OffText;                                           // 0x0278(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ToggleStateChanged__DelegateSignature(bool bToggledOn);
	void ExecuteUbergraph_WBP_Toggle(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__OffBtn_K2Node_ComponentBoundEvent_2_ButtonClicked__DelegateSignature();
	void BndEvt__OnBtn_K2Node_ComponentBoundEvent_1_ButtonClicked__DelegateSignature();
	void SetToggle(bool bInToggle);
	void IsToggledOn(bool* bToggledOn);
	void UpdateDesignerView();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Toggle_C">();
	}
	static class UWBP_Toggle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Toggle_C>();
	}
};
static_assert(alignof(UWBP_Toggle_C) == 0x000008, "Wrong alignment on UWBP_Toggle_C");
static_assert(sizeof(UWBP_Toggle_C) == 0x000290, "Wrong size on UWBP_Toggle_C");
static_assert(offsetof(UWBP_Toggle_C, UberGraphFrame) == 0x000230, "Member 'UWBP_Toggle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Toggle_C, OffBtn) == 0x000238, "Member 'UWBP_Toggle_C::OffBtn' has a wrong offset!");
static_assert(offsetof(UWBP_Toggle_C, OnBtn) == 0x000240, "Member 'UWBP_Toggle_C::OnBtn' has a wrong offset!");
static_assert(offsetof(UWBP_Toggle_C, bToggleOn) == 0x000248, "Member 'UWBP_Toggle_C::bToggleOn' has a wrong offset!");
static_assert(offsetof(UWBP_Toggle_C, ToggleStateChanged) == 0x000250, "Member 'UWBP_Toggle_C::ToggleStateChanged' has a wrong offset!");
static_assert(offsetof(UWBP_Toggle_C, OnText) == 0x000260, "Member 'UWBP_Toggle_C::OnText' has a wrong offset!");
static_assert(offsetof(UWBP_Toggle_C, OffText) == 0x000278, "Member 'UWBP_Toggle_C::OffText' has a wrong offset!");

}

