#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModifierSetting_EditableText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FModifierTextStyle_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModifierSetting_EditableText.WBP_ModifierSetting_EditableText_C
// 0x0110 (0x0340 - 0x0230)
class UWBP_ModifierSetting_EditableText_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEditableText*                          ModifierEditableText;                              // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModifierSettingBox_C*              ModifierSetting;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SettingLabelText;                                  // 0x0248(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FFModifierTextStyle                    SettingLabelTextStyle;                             // 0x0260(0x0078)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   DefaultText;                                       // 0x02D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   DefaultHintText;                                   // 0x02F0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class FString>                         DefaultOptions;                                    // 0x0308(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         DefaultSelectedOptionIdx;                          // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnTextChanged;                                     // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnTextCommitted;                                   // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnTextChanged__DelegateSignature(const class FText& Text);
	void OnTextCommitted__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void ExecuteUbergraph_WBP_ModifierSetting_EditableText(int32 EntryPoint);
	void BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__ModifierEditableText_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetSettingLabel(const class FText& InSettingText);
	void GetSettingLabel(class FText* SettingText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModifierSetting_EditableText_C">();
	}
	static class UWBP_ModifierSetting_EditableText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModifierSetting_EditableText_C>();
	}
};
static_assert(alignof(UWBP_ModifierSetting_EditableText_C) == 0x000008, "Wrong alignment on UWBP_ModifierSetting_EditableText_C");
static_assert(sizeof(UWBP_ModifierSetting_EditableText_C) == 0x000340, "Wrong size on UWBP_ModifierSetting_EditableText_C");
static_assert(offsetof(UWBP_ModifierSetting_EditableText_C, UberGraphFrame) == 0x000230, "Member 'UWBP_ModifierSetting_EditableText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_EditableText_C, ModifierEditableText) == 0x000238, "Member 'UWBP_ModifierSetting_EditableText_C::ModifierEditableText' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_EditableText_C, ModifierSetting) == 0x000240, "Member 'UWBP_ModifierSetting_EditableText_C::ModifierSetting' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_EditableText_C, SettingLabelText) == 0x000248, "Member 'UWBP_ModifierSetting_EditableText_C::SettingLabelText' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_EditableText_C, SettingLabelTextStyle) == 0x000260, "Member 'UWBP_ModifierSetting_EditableText_C::SettingLabelTextStyle' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_EditableText_C, DefaultText) == 0x0002D8, "Member 'UWBP_ModifierSetting_EditableText_C::DefaultText' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_EditableText_C, DefaultHintText) == 0x0002F0, "Member 'UWBP_ModifierSetting_EditableText_C::DefaultHintText' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_EditableText_C, DefaultOptions) == 0x000308, "Member 'UWBP_ModifierSetting_EditableText_C::DefaultOptions' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_EditableText_C, DefaultSelectedOptionIdx) == 0x000318, "Member 'UWBP_ModifierSetting_EditableText_C::DefaultSelectedOptionIdx' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_EditableText_C, OnTextChanged) == 0x000320, "Member 'UWBP_ModifierSetting_EditableText_C::OnTextChanged' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_EditableText_C, OnTextCommitted) == 0x000330, "Member 'UWBP_ModifierSetting_EditableText_C::OnTextCommitted' has a wrong offset!");

}

