#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HDRadialMenuBase

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HDRadialMenuBase.WBP_HDRadialMenuBase_C.SubmenuCommit__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_HDRadialMenuBase_C_SubmenuCommit__DelegateSignature final
{
public:
	class FName                                   Category;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SubItem;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HDRadialMenuBase_C_SubmenuCommit__DelegateSignature) == 0x000004, "Wrong alignment on WBP_HDRadialMenuBase_C_SubmenuCommit__DelegateSignature");
static_assert(sizeof(WBP_HDRadialMenuBase_C_SubmenuCommit__DelegateSignature) == 0x000010, "Wrong size on WBP_HDRadialMenuBase_C_SubmenuCommit__DelegateSignature");
static_assert(offsetof(WBP_HDRadialMenuBase_C_SubmenuCommit__DelegateSignature, Category) == 0x000000, "Member 'WBP_HDRadialMenuBase_C_SubmenuCommit__DelegateSignature::Category' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_SubmenuCommit__DelegateSignature, SubItem) == 0x000008, "Member 'WBP_HDRadialMenuBase_C_SubmenuCommit__DelegateSignature::SubItem' has a wrong offset!");

// Function WBP_HDRadialMenuBase.WBP_HDRadialMenuBase_C.ExecuteUbergraph_WBP_HDRadialMenuBase
// 0x0004 (0x0004 - 0x0000)
struct WBP_HDRadialMenuBase_C_ExecuteUbergraph_WBP_HDRadialMenuBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HDRadialMenuBase_C_ExecuteUbergraph_WBP_HDRadialMenuBase) == 0x000004, "Wrong alignment on WBP_HDRadialMenuBase_C_ExecuteUbergraph_WBP_HDRadialMenuBase");
static_assert(sizeof(WBP_HDRadialMenuBase_C_ExecuteUbergraph_WBP_HDRadialMenuBase) == 0x000004, "Wrong size on WBP_HDRadialMenuBase_C_ExecuteUbergraph_WBP_HDRadialMenuBase");
static_assert(offsetof(WBP_HDRadialMenuBase_C_ExecuteUbergraph_WBP_HDRadialMenuBase, EntryPoint) == 0x000000, "Member 'WBP_HDRadialMenuBase_C_ExecuteUbergraph_WBP_HDRadialMenuBase::EntryPoint' has a wrong offset!");

// Function WBP_HDRadialMenuBase.WBP_HDRadialMenuBase_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct WBP_HDRadialMenuBase_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(WBP_HDRadialMenuBase_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_HDRadialMenuBase_C_OnMouseButtonDown");
static_assert(sizeof(WBP_HDRadialMenuBase_C_OnMouseButtonDown) == 0x000218, "Wrong size on WBP_HDRadialMenuBase_C_OnMouseButtonDown");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_HDRadialMenuBase_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_HDRadialMenuBase_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'WBP_HDRadialMenuBase_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WBP_HDRadialMenuBase_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_HDRadialMenuBase.WBP_HDRadialMenuBase_C.OnKeyDown
// 0x02B8 (0x02B8 - 0x0000)
struct WBP_HDRadialMenuBase_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0128(0x00B8)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x01E0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0200(0x00B8)()
};
static_assert(alignof(WBP_HDRadialMenuBase_C_OnKeyDown) == 0x000008, "Wrong alignment on WBP_HDRadialMenuBase_C_OnKeyDown");
static_assert(sizeof(WBP_HDRadialMenuBase_C_OnKeyDown) == 0x0002B8, "Wrong size on WBP_HDRadialMenuBase_C_OnKeyDown");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'WBP_HDRadialMenuBase_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'WBP_HDRadialMenuBase_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'WBP_HDRadialMenuBase_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000128, "Member 'WBP_HDRadialMenuBase_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x0001E0, "Member 'WBP_HDRadialMenuBase_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue) == 0x0001F8, "Member 'WBP_HDRadialMenuBase_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue_1) == 0x0001F9, "Member 'WBP_HDRadialMenuBase_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000200, "Member 'WBP_HDRadialMenuBase_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_HDRadialMenuBase.WBP_HDRadialMenuBase_C.OnMouseButtonDoubleClick
// 0x0218 (0x0218 - 0x0000)
struct WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick final
{
public:
	struct FGeometry                              InMyGeometry;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick) == 0x000008, "Wrong alignment on WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick");
static_assert(sizeof(WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick) == 0x000218, "Wrong size on WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick, InMyGeometry) == 0x000000, "Member 'WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick::InMyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick, InMouseEvent) == 0x000038, "Member 'WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick::InMouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick, ReturnValue) == 0x0000A8, "Member 'WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WBP_HDRadialMenuBase_C_OnMouseButtonDoubleClick::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

