#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RadialMenuBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.SelectionChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_RadialMenuBase_C_SelectionChanged__DelegateSignature final
{
public:
	int32                                         NewSelection;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldSelection;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuBase_C_SelectionChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_RadialMenuBase_C_SelectionChanged__DelegateSignature");
static_assert(sizeof(WBP_RadialMenuBase_C_SelectionChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_RadialMenuBase_C_SelectionChanged__DelegateSignature");
static_assert(offsetof(WBP_RadialMenuBase_C_SelectionChanged__DelegateSignature, NewSelection) == 0x000000, "Member 'WBP_RadialMenuBase_C_SelectionChanged__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_SelectionChanged__DelegateSignature, OldSelection) == 0x000004, "Member 'WBP_RadialMenuBase_C_SelectionChanged__DelegateSignature::OldSelection' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.ExecuteUbergraph_WBP_RadialMenuBase
// 0x0088 (0x0088 - 0x0000)
struct WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_Direction;                      // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_FixInputRotation_ReturnValue;             // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Segments;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSectionDegreeSize_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InDeadzone;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAtan2_ReturnValue;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetSelectedWidget_Output;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase) == 0x000008, "Wrong alignment on WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase");
static_assert(sizeof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase) == 0x000088, "Wrong size on WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, EntryPoint) == 0x000000, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, Temp_bool_Variable) == 0x000004, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, K2Node_CustomEvent_Direction) == 0x00000C, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::K2Node_CustomEvent_Direction' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_FixInputRotation_ReturnValue) == 0x000014, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_FixInputRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, K2Node_CustomEvent_Segments) == 0x00001C, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::K2Node_CustomEvent_Segments' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_GetSectionDegreeSize_ReturnValue) == 0x000028, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_GetSectionDegreeSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, K2Node_CustomEvent_InDeadzone) == 0x000040, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::K2Node_CustomEvent_InDeadzone' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, Temp_bool_Variable_1) == 0x000041, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000042, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_BooleanAND_ReturnValue) == 0x000043, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_Normal2D_ReturnValue) == 0x000044, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000050, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_BreakVector2D_X) == 0x000058, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_BreakVector2D_Y) == 0x00005C, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000060, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_DegAtan2_ReturnValue) == 0x000064, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_DegAtan2_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_Add_FloatFloat_ReturnValue) == 0x000068, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00006C, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_FTrunc_ReturnValue) == 0x000070, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, K2Node_Event_IsDesignTime) == 0x000074, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_GetSelectedWidget_Output) == 0x000078, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_GetSelectedWidget_Output' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, K2Node_Select_Default) == 0x000081, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000084, "Member 'WBP_RadialMenuBase_C_ExecuteUbergraph_WBP_RadialMenuBase::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_RadialMenuBase_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RadialMenuBase_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_RadialMenuBase_C_PreConstruct");
static_assert(sizeof(WBP_RadialMenuBase_C_PreConstruct) == 0x000001, "Wrong size on WBP_RadialMenuBase_C_PreConstruct");
static_assert(offsetof(WBP_RadialMenuBase_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_RadialMenuBase_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.InDeadzone
// 0x0001 (0x0001 - 0x0000)
struct WBP_RadialMenuBase_C_InDeadzone final
{
public:
	bool                                          InDeadzone_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RadialMenuBase_C_InDeadzone) == 0x000001, "Wrong alignment on WBP_RadialMenuBase_C_InDeadzone");
static_assert(sizeof(WBP_RadialMenuBase_C_InDeadzone) == 0x000001, "Wrong size on WBP_RadialMenuBase_C_InDeadzone");
static_assert(offsetof(WBP_RadialMenuBase_C_InDeadzone, InDeadzone_0) == 0x000000, "Member 'WBP_RadialMenuBase_C_InDeadzone::InDeadzone_0' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.UpdateSegments
// 0x0004 (0x0004 - 0x0000)
struct WBP_RadialMenuBase_C_UpdateSegments final
{
public:
	int32                                         Segments_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuBase_C_UpdateSegments) == 0x000004, "Wrong alignment on WBP_RadialMenuBase_C_UpdateSegments");
static_assert(sizeof(WBP_RadialMenuBase_C_UpdateSegments) == 0x000004, "Wrong size on WBP_RadialMenuBase_C_UpdateSegments");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateSegments, Segments_0) == 0x000000, "Member 'WBP_RadialMenuBase_C_UpdateSegments::Segments_0' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.SetInputDirection
// 0x0008 (0x0008 - 0x0000)
struct WBP_RadialMenuBase_C_SetInputDirection final
{
public:
	struct FVector2D                              Direction;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuBase_C_SetInputDirection) == 0x000004, "Wrong alignment on WBP_RadialMenuBase_C_SetInputDirection");
static_assert(sizeof(WBP_RadialMenuBase_C_SetInputDirection) == 0x000008, "Wrong size on WBP_RadialMenuBase_C_SetInputDirection");
static_assert(offsetof(WBP_RadialMenuBase_C_SetInputDirection, Direction) == 0x000000, "Member 'WBP_RadialMenuBase_C_SetInputDirection::Direction' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.GetSectionDegreeSize
// 0x000C (0x000C - 0x0000)
struct WBP_RadialMenuBase_C_GetSectionDegreeSize final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuBase_C_GetSectionDegreeSize) == 0x000004, "Wrong alignment on WBP_RadialMenuBase_C_GetSectionDegreeSize");
static_assert(sizeof(WBP_RadialMenuBase_C_GetSectionDegreeSize) == 0x00000C, "Wrong size on WBP_RadialMenuBase_C_GetSectionDegreeSize");
static_assert(offsetof(WBP_RadialMenuBase_C_GetSectionDegreeSize, ReturnValue) == 0x000000, "Member 'WBP_RadialMenuBase_C_GetSectionDegreeSize::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_GetSectionDegreeSize, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'WBP_RadialMenuBase_C_GetSectionDegreeSize::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_GetSectionDegreeSize, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'WBP_RadialMenuBase_C_GetSectionDegreeSize::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.UpdateDirectionWithMouseCursor
// 0x0068 (0x0068 - 0x0000)
struct WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor final
{
public:
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue_1;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor) == 0x000004, "Wrong alignment on WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor");
static_assert(sizeof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor) == 0x000068, "Wrong size on WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_GetViewportScale_ReturnValue) == 0x000000, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_GetViewportSize_ReturnValue) == 0x000004, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_GetViewportScale_ReturnValue_1) == 0x00000C, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_GetViewportScale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_BreakVector2D_Y) == 0x000014, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000028, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_MakeVector2D_ReturnValue_1) == 0x00002C, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000034, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x000038, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000040, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000048, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_Normal2D_ReturnValue) == 0x000050, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000058, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_VSize2D_ReturnValue) == 0x000060, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000064, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithMouseCursor::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.AddChildToRadialMenu
// 0x0028 (0x0028 - 0x0000)
struct WBP_RadialMenuBase_C_AddChildToRadialMenu final
{
public:
	class UUserWidget*                            Content;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RadialMenuBase_C_AddChildToRadialMenu) == 0x000008, "Wrong alignment on WBP_RadialMenuBase_C_AddChildToRadialMenu");
static_assert(sizeof(WBP_RadialMenuBase_C_AddChildToRadialMenu) == 0x000028, "Wrong size on WBP_RadialMenuBase_C_AddChildToRadialMenu");
static_assert(offsetof(WBP_RadialMenuBase_C_AddChildToRadialMenu, Content) == 0x000000, "Member 'WBP_RadialMenuBase_C_AddChildToRadialMenu::Content' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_AddChildToRadialMenu, Success) == 0x000008, "Member 'WBP_RadialMenuBase_C_AddChildToRadialMenu::Success' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_AddChildToRadialMenu, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_RadialMenuBase_C_AddChildToRadialMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_AddChildToRadialMenu, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_RadialMenuBase_C_AddChildToRadialMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_AddChildToRadialMenu, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'WBP_RadialMenuBase_C_AddChildToRadialMenu::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_AddChildToRadialMenu, CallFunc_AddChildToOverlay_ReturnValue) == 0x000018, "Member 'WBP_RadialMenuBase_C_AddChildToRadialMenu::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_AddChildToRadialMenu, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_RadialMenuBase_C_AddChildToRadialMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_AddChildToRadialMenu, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000024, "Member 'WBP_RadialMenuBase_C_AddChildToRadialMenu::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.GetSelectedWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_RadialMenuBase_C_GetSelectedWidget final
{
public:
	class UUserWidget*                            Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuBase_C_GetSelectedWidget) == 0x000008, "Wrong alignment on WBP_RadialMenuBase_C_GetSelectedWidget");
static_assert(sizeof(WBP_RadialMenuBase_C_GetSelectedWidget) == 0x000018, "Wrong size on WBP_RadialMenuBase_C_GetSelectedWidget");
static_assert(offsetof(WBP_RadialMenuBase_C_GetSelectedWidget, Output) == 0x000000, "Member 'WBP_RadialMenuBase_C_GetSelectedWidget::Output' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_GetSelectedWidget, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000008, "Member 'WBP_RadialMenuBase_C_GetSelectedWidget::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_GetSelectedWidget, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_RadialMenuBase_C_GetSelectedWidget::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.ClearChildren
// 0x0020 (0x0020 - 0x0000)
struct WBP_RadialMenuBase_C_ClearChildren final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RadialMenuBase_C_ClearChildren) == 0x000008, "Wrong alignment on WBP_RadialMenuBase_C_ClearChildren");
static_assert(sizeof(WBP_RadialMenuBase_C_ClearChildren) == 0x000020, "Wrong size on WBP_RadialMenuBase_C_ClearChildren");
static_assert(offsetof(WBP_RadialMenuBase_C_ClearChildren, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_RadialMenuBase_C_ClearChildren::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ClearChildren, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_RadialMenuBase_C_ClearChildren::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ClearChildren, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_RadialMenuBase_C_ClearChildren::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ClearChildren, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_RadialMenuBase_C_ClearChildren::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ClearChildren, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_RadialMenuBase_C_ClearChildren::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_ClearChildren, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_RadialMenuBase_C_ClearChildren::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.UpdateChildPosition
// 0x0078 (0x0078 - 0x0000)
struct WBP_RadialMenuBase_C_UpdateChildPosition final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Out_dir;                                           // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSectionDegreeSize_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSectionDegreeSize_ReturnValue_1;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RadialMenuBase_C_UpdateChildPosition) == 0x000008, "Wrong alignment on WBP_RadialMenuBase_C_UpdateChildPosition");
static_assert(sizeof(WBP_RadialMenuBase_C_UpdateChildPosition) == 0x000078, "Wrong size on WBP_RadialMenuBase_C_UpdateChildPosition");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, Index_0) == 0x000000, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, Out_dir) == 0x000004, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::Out_dir' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_GetSectionDegreeSize_ReturnValue) == 0x000018, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_GetSectionDegreeSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000024, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_RotateAngleAxis_ReturnValue) == 0x000030, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x00003C, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_GetSectionDegreeSize_ReturnValue_1) == 0x000044, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_GetSectionDegreeSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000048, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000054, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x000058, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000070, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateChildPosition, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'WBP_RadialMenuBase_C_UpdateChildPosition::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.UpdateAllChildrenPositions
// 0x0014 (0x0014 - 0x0000)
struct WBP_RadialMenuBase_C_UpdateAllChildrenPositions final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RadialMenuBase_C_UpdateAllChildrenPositions) == 0x000004, "Wrong alignment on WBP_RadialMenuBase_C_UpdateAllChildrenPositions");
static_assert(sizeof(WBP_RadialMenuBase_C_UpdateAllChildrenPositions) == 0x000014, "Wrong size on WBP_RadialMenuBase_C_UpdateAllChildrenPositions");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateAllChildrenPositions, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_RadialMenuBase_C_UpdateAllChildrenPositions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateAllChildrenPositions, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_RadialMenuBase_C_UpdateAllChildrenPositions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateAllChildrenPositions, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_RadialMenuBase_C_UpdateAllChildrenPositions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateAllChildrenPositions, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WBP_RadialMenuBase_C_UpdateAllChildrenPositions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateAllChildrenPositions, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'WBP_RadialMenuBase_C_UpdateAllChildrenPositions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.SetIndex
// 0x0050 (0x0050 - 0x0000)
struct WBP_RadialMenuBase_C_SetIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetSelectedWidget_Output;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetSelectedWidget_Output_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_RadialSlot_C>     K2Node_DynamicCast_AsBPI_Radial_Slot;              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_RadialSlot_C>     K2Node_DynamicCast_AsBPI_Radial_Slot_1;            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RadialMenuBase_C_SetIndex) == 0x000008, "Wrong alignment on WBP_RadialMenuBase_C_SetIndex");
static_assert(sizeof(WBP_RadialMenuBase_C_SetIndex) == 0x000050, "Wrong size on WBP_RadialMenuBase_C_SetIndex");
static_assert(offsetof(WBP_RadialMenuBase_C_SetIndex, Index_0) == 0x000000, "Member 'WBP_RadialMenuBase_C_SetIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_SetIndex, NewIndex) == 0x000004, "Member 'WBP_RadialMenuBase_C_SetIndex::NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_SetIndex, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_RadialMenuBase_C_SetIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_SetIndex, CallFunc_GetSelectedWidget_Output) == 0x000010, "Member 'WBP_RadialMenuBase_C_SetIndex::CallFunc_GetSelectedWidget_Output' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_SetIndex, CallFunc_GetSelectedWidget_Output_1) == 0x000018, "Member 'WBP_RadialMenuBase_C_SetIndex::CallFunc_GetSelectedWidget_Output_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_SetIndex, K2Node_DynamicCast_AsBPI_Radial_Slot) == 0x000020, "Member 'WBP_RadialMenuBase_C_SetIndex::K2Node_DynamicCast_AsBPI_Radial_Slot' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_SetIndex, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_RadialMenuBase_C_SetIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_SetIndex, K2Node_DynamicCast_AsBPI_Radial_Slot_1) == 0x000038, "Member 'WBP_RadialMenuBase_C_SetIndex::K2Node_DynamicCast_AsBPI_Radial_Slot_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_SetIndex, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WBP_RadialMenuBase_C_SetIndex::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_SetIndex, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'WBP_RadialMenuBase_C_SetIndex::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_SetIndex, CallFunc_IsValid_ReturnValue_2) == 0x00004A, "Member 'WBP_RadialMenuBase_C_SetIndex::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_SetIndex, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00004B, "Member 'WBP_RadialMenuBase_C_SetIndex::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.GetChild
// 0x0020 (0x0020 - 0x0000)
struct WBP_RadialMenuBase_C_GetChild final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Output;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuBase_C_GetChild) == 0x000008, "Wrong alignment on WBP_RadialMenuBase_C_GetChild");
static_assert(sizeof(WBP_RadialMenuBase_C_GetChild) == 0x000020, "Wrong size on WBP_RadialMenuBase_C_GetChild");
static_assert(offsetof(WBP_RadialMenuBase_C_GetChild, Index_0) == 0x000000, "Member 'WBP_RadialMenuBase_C_GetChild::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_GetChild, Output) == 0x000008, "Member 'WBP_RadialMenuBase_C_GetChild::Output' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_GetChild, Success) == 0x000010, "Member 'WBP_RadialMenuBase_C_GetChild::Success' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_GetChild, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000011, "Member 'WBP_RadialMenuBase_C_GetChild::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_GetChild, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_RadialMenuBase_C_GetChild::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.GetCurrentIndex
// 0x0008 (0x0008 - 0x0000)
struct WBP_RadialMenuBase_C_GetCurrentIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RadialMenuBase_C_GetCurrentIndex) == 0x000004, "Wrong alignment on WBP_RadialMenuBase_C_GetCurrentIndex");
static_assert(sizeof(WBP_RadialMenuBase_C_GetCurrentIndex) == 0x000008, "Wrong size on WBP_RadialMenuBase_C_GetCurrentIndex");
static_assert(offsetof(WBP_RadialMenuBase_C_GetCurrentIndex, Index_0) == 0x000000, "Member 'WBP_RadialMenuBase_C_GetCurrentIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_GetCurrentIndex, Valid) == 0x000004, "Member 'WBP_RadialMenuBase_C_GetCurrentIndex::Valid' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_GetCurrentIndex, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000005, "Member 'WBP_RadialMenuBase_C_GetCurrentIndex::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.UpdateDirectionWithJoystick
// 0x0028 (0x0028 - 0x0000)
struct WBP_RadialMenuBase_C_UpdateDirectionWithJoystick final
{
public:
	TScriptInterface<class IBPI_RadialInput_C>    K2Node_DynamicCast_AsBPI_Radial_Input;             // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetJoystickDirection_StickInput;          // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RadialMenuBase_C_UpdateDirectionWithJoystick) == 0x000008, "Wrong alignment on WBP_RadialMenuBase_C_UpdateDirectionWithJoystick");
static_assert(sizeof(WBP_RadialMenuBase_C_UpdateDirectionWithJoystick) == 0x000028, "Wrong size on WBP_RadialMenuBase_C_UpdateDirectionWithJoystick");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithJoystick, K2Node_DynamicCast_AsBPI_Radial_Input) == 0x000000, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithJoystick::K2Node_DynamicCast_AsBPI_Radial_Input' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithJoystick, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithJoystick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithJoystick, CallFunc_GetJoystickDirection_StickInput) == 0x000014, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithJoystick::CallFunc_GetJoystickDirection_StickInput' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithJoystick, CallFunc_VSize2D_ReturnValue) == 0x00001C, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithJoystick::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuBase_C_UpdateDirectionWithJoystick, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'WBP_RadialMenuBase_C_UpdateDirectionWithJoystick::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_RadialMenuBase.WBP_RadialMenuBase_C.RegisterPlayerInput
// 0x0028 (0x0028 - 0x0000)
struct WBP_RadialMenuBase_C_RegisterPlayerInput final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_RadialInput_C>    K2Node_DynamicCast_AsBPI_Radial_Input;             // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
