#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeployMenu_PlatoonSquadList

#include "Basic.hpp"

#include "HDMain_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DeployMenu_PlatoonSquadList.WBP_DeployMenu_PlatoonSquadList_C
// 0x0088 (0x02D8 - 0x0250)
class UWBP_DeployMenu_PlatoonSquadList_C final : public UDeployMenu_PlatoonSquadListBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                CreateSquadBtn;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlatoonNameText;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SquadCountText;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SquadsList;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ToggleListVisibilityBtn;                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ToggleListVisibilityImg;                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bExpanded;                                         // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PlatoonTextFormat;                                 // 0x0298(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          bExpandListInDesigner;                             // 0x02B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumFakeSquadItems;                                 // 0x02B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                SquadItemPadding;                                  // 0x02B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCollapsedByUser;                                  // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DeployMenu_SquadSelectionPanel_C*  ParentContainerWidget;                             // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_DeployMenu_PlatoonSquadList(int32 EntryPoint);
	void OnPlatoonSet();
	void BndEvt__CreateSquadBtn_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void SquadsListCollapsed();
	void SquadsListExpanded();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__ListToggleBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void DeconstructSquad(class USquadListEntry* RemovedSquadData, int32 RemovedSquadIdx);
	void GenerateSquad(class USquadListEntry* SquadData);
	void AddNewSquadItemWidget(class USquadListEntry* SquadData, class UWBP_DeployMenu_SquadList_C** SquadItemWidget);
	void RemoveSquadItemWidgetFromList(class USquadListEntry* RemovedSquadData, int32 RemoveIdx);
	void ExpandList();
	void CollapseList();
	void CollapseListIfEmpty();
	void UpdateSquadCountText();
	void UpdateCreateBtnAvailability();
	void SetPlatoonNameText(const class FText& NewPlatoonName);
	void HasAnySquads(bool* bValidSquadsPresent);
	void WasListCollapsedByUser(bool* bCollapsedByUser_0);
	void IsPlatoonValid(bool* bValidPLTN);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DeployMenu_PlatoonSquadList_C">();
	}
	static class UWBP_DeployMenu_PlatoonSquadList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DeployMenu_PlatoonSquadList_C>();
	}
};
static_assert(alignof(UWBP_DeployMenu_PlatoonSquadList_C) == 0x000008, "Wrong alignment on UWBP_DeployMenu_PlatoonSquadList_C");
static_assert(sizeof(UWBP_DeployMenu_PlatoonSquadList_C) == 0x0002D8, "Wrong size on UWBP_DeployMenu_PlatoonSquadList_C");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, UberGraphFrame) == 0x000250, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, CreateSquadBtn) == 0x000258, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::CreateSquadBtn' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, Image_10) == 0x000260, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::Image_10' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, PlatoonNameText) == 0x000268, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::PlatoonNameText' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, SquadCountText) == 0x000270, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::SquadCountText' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, SquadsList) == 0x000278, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::SquadsList' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, ToggleListVisibilityBtn) == 0x000280, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::ToggleListVisibilityBtn' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, ToggleListVisibilityImg) == 0x000288, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::ToggleListVisibilityImg' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, bExpanded) == 0x000290, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::bExpanded' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, PlatoonTextFormat) == 0x000298, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::PlatoonTextFormat' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, bExpandListInDesigner) == 0x0002B0, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::bExpandListInDesigner' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, NumFakeSquadItems) == 0x0002B4, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::NumFakeSquadItems' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, SquadItemPadding) == 0x0002B8, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::SquadItemPadding' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, bCollapsedByUser) == 0x0002C8, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::bCollapsedByUser' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_PlatoonSquadList_C, ParentContainerWidget) == 0x0002D0, "Member 'UWBP_DeployMenu_PlatoonSquadList_C::ParentContainerWidget' has a wrong offset!");

}

