#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogBox_Button

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_DialogBox_Button.WBP_DialogBox_Button_C.ButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DialogBox_Button_C_ButtonClicked__DelegateSignature final
{
public:
	class UWBP_DialogBox_Button_C*                ClickedBtn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogBox_Button_C_ButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DialogBox_Button_C_ButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_DialogBox_Button_C_ButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_DialogBox_Button_C_ButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_DialogBox_Button_C_ButtonClicked__DelegateSignature, ClickedBtn) == 0x000000, "Member 'WBP_DialogBox_Button_C_ButtonClicked__DelegateSignature::ClickedBtn' has a wrong offset!");

// Function WBP_DialogBox_Button.WBP_DialogBox_Button_C.ExecuteUbergraph_WBP_DialogBox_Button
// 0x0020 (0x0020 - 0x0000)
struct WBP_DialogBox_Button_C_ExecuteUbergraph_WBP_DialogBox_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0008(0x0018)()
};
static_assert(alignof(WBP_DialogBox_Button_C_ExecuteUbergraph_WBP_DialogBox_Button) == 0x000008, "Wrong alignment on WBP_DialogBox_Button_C_ExecuteUbergraph_WBP_DialogBox_Button");
static_assert(sizeof(WBP_DialogBox_Button_C_ExecuteUbergraph_WBP_DialogBox_Button) == 0x000020, "Wrong size on WBP_DialogBox_Button_C_ExecuteUbergraph_WBP_DialogBox_Button");
static_assert(offsetof(WBP_DialogBox_Button_C_ExecuteUbergraph_WBP_DialogBox_Button, EntryPoint) == 0x000000, "Member 'WBP_DialogBox_Button_C_ExecuteUbergraph_WBP_DialogBox_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_Button_C_ExecuteUbergraph_WBP_DialogBox_Button, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_DialogBox_Button_C_ExecuteUbergraph_WBP_DialogBox_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_Button_C_ExecuteUbergraph_WBP_DialogBox_Button, CallFunc_TextToUpper_ReturnValue) == 0x000008, "Member 'WBP_DialogBox_Button_C_ExecuteUbergraph_WBP_DialogBox_Button::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WBP_DialogBox_Button.WBP_DialogBox_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DialogBox_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DialogBox_Button_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DialogBox_Button_C_PreConstruct");
static_assert(sizeof(WBP_DialogBox_Button_C_PreConstruct) == 0x000001, "Wrong size on WBP_DialogBox_Button_C_PreConstruct");
static_assert(offsetof(WBP_DialogBox_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DialogBox_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DialogBox_Button.WBP_DialogBox_Button_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct WBP_DialogBox_Button_C_SetActive final
{
public:
	bool                                          bNewActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DialogBox_Button_C_SetActive) == 0x000001, "Wrong alignment on WBP_DialogBox_Button_C_SetActive");
static_assert(sizeof(WBP_DialogBox_Button_C_SetActive) == 0x000001, "Wrong size on WBP_DialogBox_Button_C_SetActive");
static_assert(offsetof(WBP_DialogBox_Button_C_SetActive, bNewActive) == 0x000000, "Member 'WBP_DialogBox_Button_C_SetActive::bNewActive' has a wrong offset!");

// Function WBP_DialogBox_Button.WBP_DialogBox_Button_C.UpdateAppearance
// 0x0528 (0x0528 - 0x0000)
struct WBP_DialogBox_Button_C_UpdateAppearance final
{
public:
	struct FSlateColor                            NewTint;                                           // 0x0000(0x0028)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0040(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0068(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x00F0(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x0178(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x0200(0x0088)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0288(0x0278)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0500(0x0028)()
};
static_assert(alignof(WBP_DialogBox_Button_C_UpdateAppearance) == 0x000008, "Wrong alignment on WBP_DialogBox_Button_C_UpdateAppearance");
static_assert(sizeof(WBP_DialogBox_Button_C_UpdateAppearance) == 0x000528, "Wrong size on WBP_DialogBox_Button_C_UpdateAppearance");
static_assert(offsetof(WBP_DialogBox_Button_C_UpdateAppearance, NewTint) == 0x000000, "Member 'WBP_DialogBox_Button_C_UpdateAppearance::NewTint' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_Button_C_UpdateAppearance, Temp_bool_Variable) == 0x000028, "Member 'WBP_DialogBox_Button_C_UpdateAppearance::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_Button_C_UpdateAppearance, K2Node_MakeStruct_LinearColor) == 0x00002C, "Member 'WBP_DialogBox_Button_C_UpdateAppearance::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_Button_C_UpdateAppearance, K2Node_MakeStruct_SlateColor) == 0x000040, "Member 'WBP_DialogBox_Button_C_UpdateAppearance::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_Button_C_UpdateAppearance, K2Node_MakeStruct_SlateBrush) == 0x000068, "Member 'WBP_DialogBox_Button_C_UpdateAppearance::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_Button_C_UpdateAppearance, K2Node_MakeStruct_SlateBrush_1) == 0x0000F0, "Member 'WBP_DialogBox_Button_C_UpdateAppearance::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_Button_C_UpdateAppearance, K2Node_MakeStruct_SlateBrush_2) == 0x000178, "Member 'WBP_DialogBox_Button_C_UpdateAppearance::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_Button_C_UpdateAppearance, K2Node_MakeStruct_SlateBrush_3) == 0x000200, "Member 'WBP_DialogBox_Button_C_UpdateAppearance::K2Node_MakeStruct_SlateBrush_3' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_Button_C_UpdateAppearance, K2Node_MakeStruct_ButtonStyle) == 0x000288, "Member 'WBP_DialogBox_Button_C_UpdateAppearance::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_Button_C_UpdateAppearance, K2Node_Select_Default) == 0x000500, "Member 'WBP_DialogBox_Button_C_UpdateAppearance::K2Node_Select_Default' has a wrong offset!");

}

