#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeployMenu_ClassSelectionListing

#include "Basic.hpp"

#include "HDMain_structs.hpp"
#include "HDMain_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DeployMenu_ClassSelectionListing.WBP_DeployMenu_ClassSelectionListing_C
// 0x07E8 (0x0A18 - 0x0230)
class UWBP_DeployMenu_ClassSelectionListing_C final : public UDeployMenu_ClassSelectionListing
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ClassBg;                                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ClassNameText;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ClassRestrictedText;                               // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ClassSymbol;                                       // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      EqpGrid;                                           // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EqpSlot1;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EqpSlot2;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EqpSlot3;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EqpSlot4;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EqpSlot5;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EqpSlot6;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EqpSlot7;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EqpSlot8;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_12;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_13;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PrimaryWeaponIcon;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RestrictedOverlay;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SelectClassBtn;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHDKit*                                 Kit;                                               // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bListingInitialized;                               // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HDPlayerControllerBase_C*           HDOwningPlayer;                                    // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClassSelected;                                   // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bSelected;                                         // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bRestricted;                                       // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_302[0x6];                                      // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClassDeselected;                                 // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSlateBrush                            DefaultDisplaySymbolBrush;                         // 0x0318(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FLinearColor                           NoSymbolColor;                                     // 0x03A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DefaultDisplayNameText;                            // 0x03B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FButtonStyle                           SelectedBtnStyle;                                  // 0x03C8(0x0278)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FButtonStyle                           DeselectedBtnStyle;                                // 0x0640(0x0278)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateColor                            ClassSymbolDisabledTint;                           // 0x08B8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateColor                            ClassSymbolEnabledTint;                            // 0x08E0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FHDItemEntry>                   KitItemEntries;                                    // 0x0908(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateBrush                            DefaultEqpSymbolBrush;                             // 0x0918(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FLinearColor                           DefaultEqpSymbolColor;                             // 0x09A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            RestrictedTextColor;                               // 0x09B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateColor                            UnrestrictedTextColor;                             // 0x09D8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	class FText                                   KitLimitationDisplayText;                          // 0x0A00(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void OnClassSelected__DelegateSignature(class UWBP_DeployMenu_ClassSelectionListing_C* SelectedClassWidget);
	void OnClassDeselected__DelegateSignature(class UWBP_DeployMenu_ClassSelectionListing_C* DeselectedClassWidget);
	void ExecuteUbergraph_WBP_DeployMenu_ClassSelectionListing(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__SelectClassBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Init(class UHDKit* Kit_0, class ABP_HDPlayerControllerBase_C* OwningPC);
	void InternalKitDisplaySetup();
	void UpdateRestrictedState();
	void InternalSetupPrimaryWeaponIcon();
	void SelectClass();
	void DeselectClass();
	void InternalSetClassSelectionState(bool bNewSelected);
	void ToggleClassSelection();
	void SetSelected(bool bSelected_0);
	void InternalSetupKitDisplaySymbol();
	void InternalSetupKitDisplayName();
	void InternalSetupKitRestrictionDisplay(bool bKitRestricted, class FText& KitRestrictionReason);
	void InternalUpdateClassRestrictedText(bool bKitRestricted, class FText& KitRestrictionReason);
	void InternalSetClassRestrictedState(bool bNewRestricted, class FText& NewRestrictionReason);
	void InternalSetupKitDisplayEqpSlots();
	void InternalSetEqpDisplaySymbolBySlotNum(int32 SlotNum, class UTexture2D* SlotSymbolToUse, bool bDesignTime);
	void SortItemEntriesInPlaceBySlotNum(TArray<struct FHDItemEntry>& EntriesToSort);
	void InternalFillEqpSlots();

	void InternalIsKitRestricted(bool* bKitRestricted, class FText* KitRestrictionReason) const;
	void InternalGetEqpSlotImageWidgetByNum(int32 SlotNum, class UImage** EqpSlotImage) const;
	void AreColorsNearlyEqual(const struct FLinearColor& ColorOne, const struct FLinearColor& ColorTwo, bool* bEqual) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DeployMenu_ClassSelectionListing_C">();
	}
	static class UWBP_DeployMenu_ClassSelectionListing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DeployMenu_ClassSelectionListing_C>();
	}
};
static_assert(alignof(UWBP_DeployMenu_ClassSelectionListing_C) == 0x000008, "Wrong alignment on UWBP_DeployMenu_ClassSelectionListing_C");
static_assert(sizeof(UWBP_DeployMenu_ClassSelectionListing_C) == 0x000A18, "Wrong size on UWBP_DeployMenu_ClassSelectionListing_C");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, UberGraphFrame) == 0x000230, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, ClassBg) == 0x000238, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::ClassBg' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, ClassNameText) == 0x000240, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::ClassNameText' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, ClassRestrictedText) == 0x000248, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::ClassRestrictedText' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, ClassSymbol) == 0x000250, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::ClassSymbol' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, EqpGrid) == 0x000258, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::EqpGrid' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, EqpSlot1) == 0x000260, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::EqpSlot1' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, EqpSlot2) == 0x000268, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::EqpSlot2' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, EqpSlot3) == 0x000270, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::EqpSlot3' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, EqpSlot4) == 0x000278, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::EqpSlot4' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, EqpSlot5) == 0x000280, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::EqpSlot5' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, EqpSlot6) == 0x000288, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::EqpSlot6' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, EqpSlot7) == 0x000290, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::EqpSlot7' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, EqpSlot8) == 0x000298, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::EqpSlot8' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, Image_10) == 0x0002A0, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::Image_10' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, Image_11) == 0x0002A8, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::Image_11' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, Image_12) == 0x0002B0, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::Image_12' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, Image_13) == 0x0002B8, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::Image_13' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, PrimaryWeaponIcon) == 0x0002C0, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::PrimaryWeaponIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, RestrictedOverlay) == 0x0002C8, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::RestrictedOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, SelectClassBtn) == 0x0002D0, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::SelectClassBtn' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, Kit) == 0x0002D8, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::Kit' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, bListingInitialized) == 0x0002E0, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::bListingInitialized' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, HDOwningPlayer) == 0x0002E8, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::HDOwningPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, OnClassSelected) == 0x0002F0, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::OnClassSelected' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, bSelected) == 0x000300, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::bSelected' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, bRestricted) == 0x000301, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::bRestricted' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, OnClassDeselected) == 0x000308, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::OnClassDeselected' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, DefaultDisplaySymbolBrush) == 0x000318, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::DefaultDisplaySymbolBrush' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, NoSymbolColor) == 0x0003A0, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::NoSymbolColor' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, DefaultDisplayNameText) == 0x0003B0, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::DefaultDisplayNameText' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, SelectedBtnStyle) == 0x0003C8, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::SelectedBtnStyle' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, DeselectedBtnStyle) == 0x000640, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::DeselectedBtnStyle' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, ClassSymbolDisabledTint) == 0x0008B8, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::ClassSymbolDisabledTint' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, ClassSymbolEnabledTint) == 0x0008E0, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::ClassSymbolEnabledTint' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, KitItemEntries) == 0x000908, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::KitItemEntries' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, DefaultEqpSymbolBrush) == 0x000918, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::DefaultEqpSymbolBrush' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, DefaultEqpSymbolColor) == 0x0009A0, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::DefaultEqpSymbolColor' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, RestrictedTextColor) == 0x0009B0, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::RestrictedTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, UnrestrictedTextColor) == 0x0009D8, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::UnrestrictedTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_DeployMenu_ClassSelectionListing_C, KitLimitationDisplayText) == 0x000A00, "Member 'UWBP_DeployMenu_ClassSelectionListing_C::KitLimitationDisplayText' has a wrong offset!");

}

