#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuSubNavSelectionListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MenuSubNavSelectionListEntry.WBP_MenuSubNavSelectionListEntry_C
// 0x0040 (0x0270 - 0x0230)
class UWBP_MenuSubNavSelectionListEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CreateGameSelectionListEntry_C*    SelectionEntry;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ItemText;                                          // 0x0240(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         SubMenuIndex;                                      // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             ButtonClicked;                                     // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ButtonClicked__DelegateSignature(class UWBP_MenuSubNavSelectionListEntry_C* ClickedBtn);
	void ExecuteUbergraph_WBP_MenuSubNavSelectionListEntry(int32 EntryPoint);
	void BndEvt__SelectionEntry_K2Node_ComponentBoundEvent_1_OnSelectionStateChanged__DelegateSignature(class UWBP_CreateGameSelectionListEntry_C* Item, bool bSelected);
	void OnItemSelectionChanged(bool bIsSelected);
	void PreConstruct(bool IsDesignTime);
	void SetSubMenuIndex(int32 Idx);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MenuSubNavSelectionListEntry_C">();
	}
	static class UWBP_MenuSubNavSelectionListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MenuSubNavSelectionListEntry_C>();
	}
};
static_assert(alignof(UWBP_MenuSubNavSelectionListEntry_C) == 0x000008, "Wrong alignment on UWBP_MenuSubNavSelectionListEntry_C");
static_assert(sizeof(UWBP_MenuSubNavSelectionListEntry_C) == 0x000270, "Wrong size on UWBP_MenuSubNavSelectionListEntry_C");
static_assert(offsetof(UWBP_MenuSubNavSelectionListEntry_C, UberGraphFrame) == 0x000230, "Member 'UWBP_MenuSubNavSelectionListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MenuSubNavSelectionListEntry_C, SelectionEntry) == 0x000238, "Member 'UWBP_MenuSubNavSelectionListEntry_C::SelectionEntry' has a wrong offset!");
static_assert(offsetof(UWBP_MenuSubNavSelectionListEntry_C, ItemText) == 0x000240, "Member 'UWBP_MenuSubNavSelectionListEntry_C::ItemText' has a wrong offset!");
static_assert(offsetof(UWBP_MenuSubNavSelectionListEntry_C, SubMenuIndex) == 0x000258, "Member 'UWBP_MenuSubNavSelectionListEntry_C::SubMenuIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MenuSubNavSelectionListEntry_C, ButtonClicked) == 0x000260, "Member 'UWBP_MenuSubNavSelectionListEntry_C::ButtonClicked' has a wrong offset!");

}

