#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HDMenuButton_ModalDialog

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HDMenuButton_ModalDialog.WBP_HDMenuButton_ModalDialog_C.ExecuteUbergraph_WBP_HDMenuButton_ModalDialog
// 0x0038 (0x0038 - 0x0000)
struct WBP_HDMenuButton_ModalDialog_C_ExecuteUbergraph_WBP_HDMenuButton_ModalDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText;                               // 0x0008(0x0018)(ConstParm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0020(0x0018)()
};
static_assert(alignof(WBP_HDMenuButton_ModalDialog_C_ExecuteUbergraph_WBP_HDMenuButton_ModalDialog) == 0x000008, "Wrong alignment on WBP_HDMenuButton_ModalDialog_C_ExecuteUbergraph_WBP_HDMenuButton_ModalDialog");
static_assert(sizeof(WBP_HDMenuButton_ModalDialog_C_ExecuteUbergraph_WBP_HDMenuButton_ModalDialog) == 0x000038, "Wrong size on WBP_HDMenuButton_ModalDialog_C_ExecuteUbergraph_WBP_HDMenuButton_ModalDialog");
static_assert(offsetof(WBP_HDMenuButton_ModalDialog_C_ExecuteUbergraph_WBP_HDMenuButton_ModalDialog, EntryPoint) == 0x000000, "Member 'WBP_HDMenuButton_ModalDialog_C_ExecuteUbergraph_WBP_HDMenuButton_ModalDialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HDMenuButton_ModalDialog_C_ExecuteUbergraph_WBP_HDMenuButton_ModalDialog, K2Node_Event_InText) == 0x000008, "Member 'WBP_HDMenuButton_ModalDialog_C_ExecuteUbergraph_WBP_HDMenuButton_ModalDialog::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(WBP_HDMenuButton_ModalDialog_C_ExecuteUbergraph_WBP_HDMenuButton_ModalDialog, CallFunc_TextToUpper_ReturnValue) == 0x000020, "Member 'WBP_HDMenuButton_ModalDialog_C_ExecuteUbergraph_WBP_HDMenuButton_ModalDialog::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WBP_HDMenuButton_ModalDialog.WBP_HDMenuButton_ModalDialog_C.UpdateButtonText
// 0x0018 (0x0018 - 0x0000)
struct WBP_HDMenuButton_ModalDialog_C_UpdateButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_HDMenuButton_ModalDialog_C_UpdateButtonText) == 0x000008, "Wrong alignment on WBP_HDMenuButton_ModalDialog_C_UpdateButtonText");
static_assert(sizeof(WBP_HDMenuButton_ModalDialog_C_UpdateButtonText) == 0x000018, "Wrong size on WBP_HDMenuButton_ModalDialog_C_UpdateButtonText");
static_assert(offsetof(WBP_HDMenuButton_ModalDialog_C_UpdateButtonText, InText) == 0x000000, "Member 'WBP_HDMenuButton_ModalDialog_C_UpdateButtonText::InText' has a wrong offset!");

}

