#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModifierSetting_CheckBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FModifierTextStyle_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModifierSetting_CheckBox.WBP_ModifierSetting_CheckBox_C
// 0x00D0 (0x0300 - 0x0230)
class UWBP_ModifierSetting_CheckBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCheckBox*                              ModifierCheckBox;                                  // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ModifierSBox;                                      // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModifierSettingBox_C*              ModifierSetting;                                   // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bDefaultIsChecked;                                 // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SettingText;                                       // 0x0258(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             OnCheckStateChanged;                               // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FFModifierTextStyle                    SettingTextStyle;                                  // 0x0280(0x0078)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              CheckBoxMinSize;                                   // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void OnCheckStateChanged__DelegateSignature(bool bIsChecked);
	void ExecuteUbergraph_WBP_ModifierSetting_CheckBox(int32 EntryPoint);
	void OnInitialized();
	void BndEvt__ModifierCheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void PreConstruct(bool IsDesignTime);
	void SetSettingText(const class FText& InSettingText);
	void GetSettingText(class FText* SettingText_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModifierSetting_CheckBox_C">();
	}
	static class UWBP_ModifierSetting_CheckBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModifierSetting_CheckBox_C>();
	}
};
static_assert(alignof(UWBP_ModifierSetting_CheckBox_C) == 0x000008, "Wrong alignment on UWBP_ModifierSetting_CheckBox_C");
static_assert(sizeof(UWBP_ModifierSetting_CheckBox_C) == 0x000300, "Wrong size on UWBP_ModifierSetting_CheckBox_C");
static_assert(offsetof(UWBP_ModifierSetting_CheckBox_C, UberGraphFrame) == 0x000230, "Member 'UWBP_ModifierSetting_CheckBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_CheckBox_C, ModifierCheckBox) == 0x000238, "Member 'UWBP_ModifierSetting_CheckBox_C::ModifierCheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_CheckBox_C, ModifierSBox) == 0x000240, "Member 'UWBP_ModifierSetting_CheckBox_C::ModifierSBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_CheckBox_C, ModifierSetting) == 0x000248, "Member 'UWBP_ModifierSetting_CheckBox_C::ModifierSetting' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_CheckBox_C, bDefaultIsChecked) == 0x000250, "Member 'UWBP_ModifierSetting_CheckBox_C::bDefaultIsChecked' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_CheckBox_C, SettingText) == 0x000258, "Member 'UWBP_ModifierSetting_CheckBox_C::SettingText' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_CheckBox_C, OnCheckStateChanged) == 0x000270, "Member 'UWBP_ModifierSetting_CheckBox_C::OnCheckStateChanged' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_CheckBox_C, SettingTextStyle) == 0x000280, "Member 'UWBP_ModifierSetting_CheckBox_C::SettingTextStyle' has a wrong offset!");
static_assert(offsetof(UWBP_ModifierSetting_CheckBox_C, CheckBoxMinSize) == 0x0002F8, "Member 'UWBP_ModifierSetting_CheckBox_C::CheckBoxMinSize' has a wrong offset!");

}

