#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeployMenu_SpawnMinimap

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.OnSpawnPointSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointSelected__DelegateSignature final
{
public:
	class AActor*                                 POISpawnPointActor;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointSelected__DelegateSignature");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointSelected__DelegateSignature");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointSelected__DelegateSignature, POISpawnPointActor) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointSelected__DelegateSignature::POISpawnPointActor' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.OnSpawnPointDeselected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointDeselected__DelegateSignature final
{
public:
	class AActor*                                 POISpawnPointActor;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointDeselected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointDeselected__DelegateSignature");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointDeselected__DelegateSignature) == 0x000008, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointDeselected__DelegateSignature");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointDeselected__DelegateSignature, POISpawnPointActor) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnSpawnPointDeselected__DelegateSignature::POISpawnPointActor' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap
// 0x0210 (0x0210 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry_1;                         // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0050(0x0070)(ConstParm)
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00C4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UObject>>         K2Node_CustomEvent_AssetsToLoad;                   // 0x0130(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           K2Node_CustomEvent_ClassesToLoad;                  // 0x0140(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Array_Get_Item;                           // 0x0150(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_Array_Get_Item_1;                         // 0x0188(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	class UDFPOIWidget*                           K2Node_Event_POI;                                  // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelected;                            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_Loaded;                         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPOIActorValid_ReturnValue;              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap) == 0x000210, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, EntryPoint) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, Temp_object_Variable) == 0x000008, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_Event_MyGeometry_1) == 0x000014, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_Event_MyGeometry_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_Event_MouseEvent) == 0x000050, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue) == 0x0000C0, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_Event_MyGeometry) == 0x0000C4, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_Event_InDeltaTime) == 0x0000FC, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, Temp_int_Loop_Counter_Variable) == 0x000100, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Add_IntInt_ReturnValue) == 0x000104, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, Temp_int_Loop_Counter_Variable_1) == 0x000108, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_CustomEvent_Loaded_1) == 0x000110, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Add_IntInt_ReturnValue_1) == 0x000118, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, Temp_int_Array_Index_Variable) == 0x00011C, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, Temp_int_Array_Index_Variable_1) == 0x000120, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, Temp_int_Variable) == 0x000124, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Not_PreBool_ReturnValue) == 0x000128, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_BooleanOR_ReturnValue) == 0x000129, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_CustomEvent_AssetsToLoad) == 0x000130, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_CustomEvent_AssetsToLoad' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_CustomEvent_ClassesToLoad) == 0x000140, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_CustomEvent_ClassesToLoad' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Array_Get_Item) == 0x000150, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Array_Length_ReturnValue) == 0x000178, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Array_Length_ReturnValue_1) == 0x00017C, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Less_IntInt_ReturnValue) == 0x000180, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Array_Get_Item_1) == 0x000188, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Array_Length_ReturnValue_2) == 0x0001B0, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Array_Length_ReturnValue_3) == 0x0001B4, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001B8, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001BC, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_CreateDelegate_OutputDelegate) == 0x0001C0, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001D0, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001D4, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, Temp_class_Variable) == 0x0001D8, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001E0, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_Event_POI) == 0x0001F0, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_Event_POI' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_Event_bSelected) == 0x0001F8, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_Event_bSelected' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, K2Node_CustomEvent_Loaded) == 0x000200, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_IsPOIActorValid_ReturnValue) == 0x000208, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_IsPOIActorValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap, CallFunc_DoesImplementInterface_ReturnValue) == 0x000209, "Member 'WBP_DeployMenu_SpawnMinimap_C_ExecuteUbergraph_WBP_DeployMenu_SpawnMinimap::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.ReceiveOnPOISelectionStateChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_ReceiveOnPOISelectionStateChanged final
{
public:
	class UDFPOIWidget*                           POI;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelected;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_ReceiveOnPOISelectionStateChanged) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_ReceiveOnPOISelectionStateChanged");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_ReceiveOnPOISelectionStateChanged) == 0x000010, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_ReceiveOnPOISelectionStateChanged");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ReceiveOnPOISelectionStateChanged, POI) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_ReceiveOnPOISelectionStateChanged::POI' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ReceiveOnPOISelectionStateChanged, bSelected) == 0x000008, "Member 'WBP_DeployMenu_SpawnMinimap_C_ReceiveOnPOISelectionStateChanged::bSelected' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.OnContentPreloadStarted
// 0x0020 (0x0020 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_OnContentPreloadStarted final
{
public:
	TArray<TSoftObjectPtr<class UObject>>         AssetsToLoad;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           ClassesToLoad;                                     // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_OnContentPreloadStarted) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_OnContentPreloadStarted");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_OnContentPreloadStarted) == 0x000020, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_OnContentPreloadStarted");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnContentPreloadStarted, AssetsToLoad) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnContentPreloadStarted::AssetsToLoad' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnContentPreloadStarted, ClassesToLoad) == 0x000010, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnContentPreloadStarted::ClassesToLoad' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_Tick) == 0x000004, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_Tick");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_Tick) == 0x00003C, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_Tick");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_DeployMenu_SpawnMinimap_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_OnMouseEnter");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_OnMouseEnter) == 0x0000A8, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_OnMouseEnter");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_PreConstruct");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_PreConstruct) == 0x000001, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_PreConstruct");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.OnLoaded_BB8D079144A98AFE7BD3849D43A40947
// 0x0008 (0x0008 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BB8D079144A98AFE7BD3849D43A40947 final
{
public:
	class UClass*                                 Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BB8D079144A98AFE7BD3849D43A40947) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BB8D079144A98AFE7BD3849D43A40947");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BB8D079144A98AFE7BD3849D43A40947) == 0x000008, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BB8D079144A98AFE7BD3849D43A40947");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BB8D079144A98AFE7BD3849D43A40947, Loaded) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BB8D079144A98AFE7BD3849D43A40947::Loaded' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.OnLoaded_BACDC4954F814289E55DD7AAEBE3E34E
// 0x0008 (0x0008 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BACDC4954F814289E55DD7AAEBE3E34E final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BACDC4954F814289E55DD7AAEBE3E34E) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BACDC4954F814289E55DD7AAEBE3E34E");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BACDC4954F814289E55DD7AAEBE3E34E) == 0x000008, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BACDC4954F814289E55DD7AAEBE3E34E");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BACDC4954F814289E55DD7AAEBE3E34E, Loaded) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnLoaded_BACDC4954F814289E55DD7AAEBE3E34E::Loaded' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.InitMapBg
// 0x0010 (0x0010 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_InitMapBg final
{
public:
	class UTexture2D*                             MapTexture_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_InitMapBg) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_InitMapBg");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_InitMapBg) == 0x000010, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_InitMapBg");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_InitMapBg, MapTexture_0) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_InitMapBg::MapTexture_0' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_InitMapBg, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_DeployMenu_SpawnMinimap_C_InitMapBg::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.OnMouseButtonDown
// 0x0220 (0x0220 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown) == 0x000220, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue) == 0x000160, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.OnMouseMove
// 0x0310 (0x0310 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_OnMouseMove final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FVector2D                              CallFunc_PointerEvent_GetCursorDelta_ReturnValue;  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0180(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0238(0x00B8)()
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x02FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0304(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_OnMouseMove");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove) == 0x000310, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_OnMouseMove");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, MyGeometry) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, MouseEvent) == 0x000038, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, ReturnValue) == 0x0000A8, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_PointerEvent_GetCursorDelta_ReturnValue) == 0x000160, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_PointerEvent_GetCursorDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000168, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue) == 0x00016C, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_GetLocalSize_ReturnValue) == 0x000170, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_BreakVector2D_X) == 0x000178, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_BreakVector2D_Y) == 0x00017C, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_Unhandled_ReturnValue) == 0x000180, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_Handled_ReturnValue) == 0x000238, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0002F0, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002F4, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0002F8, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x0002FC, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseMove, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000304, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseMove::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.GetLocalCursorDelta
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta final
{
public:
	struct FGeometry                              Geometry;                                          // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector2D                              LocalDelta;                                        // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_PointerEvent_GetLastScreenSpacePosition_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue_1;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta) == 0x0000D8, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta, Geometry) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta::Geometry' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta, MouseEvent) == 0x000038, "Member 'WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta, LocalDelta) == 0x0000A8, "Member 'WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta::LocalDelta' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue) == 0x0000B0, "Member 'WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta, CallFunc_PointerEvent_GetLastScreenSpacePosition_ReturnValue) == 0x0000B8, "Member 'WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta::CallFunc_PointerEvent_GetLastScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta, CallFunc_AbsoluteToLocal_ReturnValue) == 0x0000C0, "Member 'WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta::CallFunc_AbsoluteToLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta, CallFunc_AbsoluteToLocal_ReturnValue_1) == 0x0000C8, "Member 'WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta::CallFunc_AbsoluteToLocal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000D0, "Member 'WBP_DeployMenu_SpawnMinimap_C_GetLocalCursorDelta::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.UpdateMapMatParams
// 0x0008 (0x0008 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_UpdateMapMatParams final
{
public:
	float                                         CallFunc_BreakVector2D_X;                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_UpdateMapMatParams) == 0x000004, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_UpdateMapMatParams");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_UpdateMapMatParams) == 0x000008, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_UpdateMapMatParams");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_UpdateMapMatParams, CallFunc_BreakVector2D_X) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_UpdateMapMatParams::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_UpdateMapMatParams, CallFunc_BreakVector2D_Y) == 0x000004, "Member 'WBP_DeployMenu_SpawnMinimap_C_UpdateMapMatParams::CallFunc_BreakVector2D_Y' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.OnMouseButtonUp
// 0x0218 (0x0218 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp) == 0x000218, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.OnMouseWheel
// 0x0228 (0x0228 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
	float                                         CallFunc_PointerEvent_GetWheelDelta_ReturnValue;   // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel) == 0x000228, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel, MyGeometry) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel, MouseEvent) == 0x000038, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel, ReturnValue) == 0x0000A8, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel, CallFunc_PointerEvent_GetWheelDelta_ReturnValue) == 0x000218, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel::CallFunc_PointerEvent_GetWheelDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel, CallFunc_Abs_ReturnValue) == 0x00021C, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel, CallFunc_SignOfFloat_ReturnValue) == 0x000220, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000224, "Member 'WBP_DeployMenu_SpawnMinimap_C_OnMouseWheel::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.ZoomIn
// 0x0014 (0x0014 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_ZoomIn final
{
public:
	float                                         ZoomIncrement;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_ZoomIn) == 0x000004, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_ZoomIn");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_ZoomIn) == 0x000014, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_ZoomIn");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ZoomIn, ZoomIncrement) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_ZoomIn::ZoomIncrement' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ZoomIn, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'WBP_DeployMenu_SpawnMinimap_C_ZoomIn::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ZoomIn, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000008, "Member 'WBP_DeployMenu_SpawnMinimap_C_ZoomIn::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ZoomIn, CallFunc_FMax_ReturnValue) == 0x00000C, "Member 'WBP_DeployMenu_SpawnMinimap_C_ZoomIn::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ZoomIn, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'WBP_DeployMenu_SpawnMinimap_C_ZoomIn::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.ZoomOut
// 0x0014 (0x0014 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_ZoomOut final
{
public:
	float                                         ZoomDecrement;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_ZoomOut) == 0x000004, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_ZoomOut");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_ZoomOut) == 0x000014, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_ZoomOut");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ZoomOut, ZoomDecrement) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_ZoomOut::ZoomDecrement' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ZoomOut, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'WBP_DeployMenu_SpawnMinimap_C_ZoomOut::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ZoomOut, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000008, "Member 'WBP_DeployMenu_SpawnMinimap_C_ZoomOut::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ZoomOut, CallFunc_FMax_ReturnValue) == 0x00000C, "Member 'WBP_DeployMenu_SpawnMinimap_C_ZoomOut::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_ZoomOut, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'WBP_DeployMenu_SpawnMinimap_C_ZoomOut::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.PreloadContent
// 0x0028 (0x0028 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_PreloadContent final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UObject>>         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_PreloadContent) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_PreloadContent");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_PreloadContent) == 0x000028, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_PreloadContent");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_PreloadContent, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'WBP_DeployMenu_SpawnMinimap_C_PreloadContent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_PreloadContent, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_DeployMenu_SpawnMinimap_C_PreloadContent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DeployMenu_SpawnMinimap_C_PreloadContent, K2Node_MakeArray_Array_1) == 0x000018, "Member 'WBP_DeployMenu_SpawnMinimap_C_PreloadContent::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function WBP_DeployMenu_SpawnMinimap.WBP_DeployMenu_SpawnMinimap_C.ApplyPreloadedContent
// 0x0018 (0x0018 - 0x0000)
struct WBP_DeployMenu_SpawnMinimap_C_ApplyPreloadedContent final
{
public:
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DeployMenu_SpawnMinimap_C_ApplyPreloadedContent) == 0x000008, "Wrong alignment on WBP_DeployMenu_SpawnMinimap_C_ApplyPreloadedContent");
static_assert(sizeof(WBP_DeployMenu_SpawnMinimap_C_ApplyPreloadedContent) == 0x000018, "Wrong size on WBP_DeployMenu_SpawnMinimap_C_ApplyPreloadedContent");
